package eyes.blue;
public class TheoryData{
/*更新:$Date: 2014-01-10 01:17:21 +0800 (Fri, 10 Jan 2014) $
*作者:$Author: kingofeyesblue@gmail.com $
*版本:$Revision: 112 $
*ID：$Id: TheoryData.java 112 2014-01-09 17:17:21Z kingofeyesblue@gmail.com $
*/
	public final static String[]content={
		//######################物件化######################
		/*===========================第 1 頁===========================*/
		"<b>菩提道次第廣論卷一</b>\n"+
		"　　宗喀巴大師造\n"+
		"　　法尊法師譯\n"+
		"　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　校正版\n"+
		"　南無姑如曼殊廓喀耶（梵語）　　敬禮尊重妙音（漢譯）\n"+
		"　俱胝圓滿妙善所生身　　成滿無邊眾生希願語\n"+
		"　如實觀見無餘所知意　　於是釋迦尊主稽首禮\n"+
		"　是無等師最勝子　荷佛一切事業擔　現化遊戲無量土　禮阿逸多及妙音\n"+
		"　如極難量勝者教　造釋密意贍部嚴　名稱遍揚於三地　我禮龍猛無著足\n"+
		"　攝二大車善傳流　深見廣行無錯謬　圓滿道心教授藏　敬禮持彼燃燈智\n"+
		"　遍視無央佛語目　賢種趣脫最勝階　悲動方便善開顯　敬禮此諸善知識\n"+
		"　今勤瑜伽多寡聞　廣聞不善於修要　觀視佛語多片眼　復乏理辯教義力"
		,
		/*===========================第 2 頁===========================*/
		"　故離智者歡喜道　圓滿教要勝教授　見已釋此大車道　故我心意遍勇喜\n"+
		"　諸有偏執暗未覆　具辨善惡妙慧力　欲令暇身不唐捐　諸具善者專勵聽\n"+
		"　　此中總攝一切佛語扼要。遍攝龍猛無著二大車之道軌。往趣一切種智地位勝士法\n"+
		"範‧三種士夫‧一切行持‧所有次第‧無所缺少。依菩提道次第門中‧導具善者趣佛地理‧是謂\n"+
		"此中所詮諸法。\n"+
		"　　此中傳有二派釋儀。勝那蘭陀諸智論師‧許由三種清淨門中‧詮釋正法。謂軌範語淨‧\n"+
		"學者相續淨‧所說法清淨。後時止迦摩囉室囉‧聖教盛行‧彼諸智者‧則許三種而為初要。謂\n"+
		"正法造者殊勝‧正法殊勝‧如何講聞彼法規理。今於此中‧應如後釋。\n"+
		"<b><s>　由是菩提道次引導分四‧<n>一</n>為顯其法根源淨故開示造者殊勝‧<n>二</n>令於教授起敬重故開示其</s></b>\n"+
		"<b><s>　法殊勝‧<n>三</n>如何講聞二種殊勝相應正法‧<n>四</n>如何正以教授引導學徒之次第。　　今初</s></b>\n"+
		"　　總此教授‧即是至尊慈氏所造‧現觀莊嚴所有教授。別則此之教典‧即是菩提道炬。故\n"+
		"彼造者‧亦即此之造者。彼復即是大阿闍黎勝燃燈智‧別諱共稱勝阿底峽。\n"+
		"<b><s>　其殊勝分三‧<n>一</n>圓滿種中受生事理‧<n>二</n>其身獲得功德事理‧<n>三</n>得已於教所作事業。　　今初</s></b>"
		,
		/*===========================第 3 頁===========================*/
		"　　如拏錯大譯師所造八十讚云‧「東薩賀勝境‧其間有大城‧謂次第聚落。其中有王都‧\n"+
		"名為有金幢。其宮極廣博‧受用位饒盛‧等支那國王。其國王善勝‧妃名吉祥光。父母有三子‧\n"+
		"名蓮藏月藏‧並其吉祥藏。太子蓮華藏‧有五妃九子。長子福吉祥‧現時大善巧‧稱為陀那喜。\n"+
		"幼子吉祥藏‧比丘精進月。次子月藏者‧即現至尊師。」\n"+
		"<b><s>　獲得功德事理分二‧<n>一</n>知見廣博獲教功德事理‧<n>二</n>如理修行獲證功德事理。　　今初</s></b>\n"+
		"　　如讚云‧「二十一歲中‧善巧六十四‧技術及一切‧工處善構言‧及一切諸量。」謂於二\n"+
		"十一歲以內‧學習內外四共明處。聲明‧因明‧工巧業明‧及醫方明‧善巧究竟。特如大卓龍巴\n"+
		"云‧十五歲時‧僅聞一次正理滴論‧與一黠慧戲論外道興辯‧令彼墮伏‧美譽遍揚。\n"+
		"　　於其黑山道場‧瑜伽自在‧親見歡喜金剛尊身‧獲得金剛空行佛母授記之尊重‧羅喉\n"+
		"羅毱多前‧具足請受一切灌頂‧立密諱為智密金剛。二十九歲以內‧於多獲得成就師前‧習\n"+
		"金剛乘教典教授‧善巧無餘。於諸密咒唯我善巧‧作是念已‧諸空行母於其夢中‧陳示眾多\n"+
		"昔所未見密咒經函‧摧其慢意。此後尊重及諸本尊‧若寤若夢‧隨其所應‧勸云‧若出家者‧則\n"+
		"於聖教及諸眾生‧起大饒益。依是勸已‧如讚中云‧「共稱汝親教‧為加行道者。」隨請大眾"
		,
		/*===========================第 4 頁===========================*/
		"部持律上座‧得加行道一分真實三摩地者‧厥號戒鎧為親教師而正出家‧其諱又名勝燃\n"+
		"燈智。此後乃至三十一歲‧習學相乘內明‧上下諸藏。特於能飛聚落‧法鎧師前‧十二年中聽\n"+
		"受大毘婆沙‧極善根本四部教典。於諸異部‧作受食等‧諸微細分‧互捨取處‧遍知無雜。\n"+
		"　　由是度越自他諸部宗海彼岸‧故是無倒解了一切教正法中樞要處者。\n"+
		"　　獲得證德事理者。總佛一切教法聖教‧三藏寶攝‧故證聖教亦須攝入三學寶中。其中\n"+
		"戒學‧至言及釋數數讚為定慧學等‧一切功德之所依處。故須先具戒學增上諸證功德。其\n"+
		"中分三。\n"+
		"　　成就最勝別解脫律儀事理者。如讚中云‧「尊入聲聞乘門已‧護戒如氂牛愛尾‧具妙\n"+
		"梵行勝比丘‧持律上座我敬禮。」謂其正受圓滿比丘諸律儀已‧如愛尾牛‧若尾一縷掛著\n"+
		"於樹‧雖見獵士將離其命‧寧捨其命護尾不斷。如是雖於一輕學處‧尚寧捨命防護不犯‧況\n"+
		"其所受重大學處‧是故成大持律上座。\n"+
		"　　成就菩薩律儀者。如讚中云‧「尊入度彼岸門已‧增上意樂善清淨‧覺心不捨諸眾生‧\n"+
		"具慧大悲我敬禮。」總具修習慈悲為本‧菩提之心眾多教授‧特依金洲大師‧多時修習至"
		,
		/*===========================第 5 頁===========================*/
		"尊慈氏及妙音尊‧傳授無著及寂靜天最勝教授。如讚中云‧「能捨自利以利他‧為勝是即\n"+
		"我師尊。」謂心發起‧愛他勝自菩提之心‧以此願心所引行心‧受學菩薩廣大妙行‧學受隨\n"+
		"行所有學處‧行賢妙故‧能不違越諸勝者子所有制限。\n"+
		"　　成就金剛乘律儀者。如讚中云‧「尊入金剛乘門已‧自見天具金剛心‧瑜伽自在獲中\n"+
		"者‧修密護禁我敬禮。」成就觀見自身即天生起次第‧及金剛心圓滿次第三摩地故‧總讚\n"+
		"為其瑜伽中尊‧特讚如理護三昧耶‧不越制限。亦如讚云‧「由具念正知‧不作意非戒‧慎念\n"+
		"無諂誑‧犯罪不染尊。」如是於諸三種律儀淨戒學處‧非僅勇受‧如其所受隨行防護‧不越\n"+
		"制限‧設少違犯‧亦以各各還出儀軌‧疾疾令淨。如是淨傳‧應知是諸通達聖語扼要智者‧所\n"+
		"喜愛傳‧隨諸正士應當修學。\n"+
		"　　成就定學分二。共者‧謂由奢摩他門‧得堪能心。不共定學者‧謂具極穩生起次第。此復\n"+
		"三年或六年中‧修明禁行。爾時遙聞‧飛行國中‧諸空行母‧謳歌之聲‧心中亦有所憶持者。\n"+
		"　　成就慧學中‧共者‧謂得止觀雙運毘缽舍那三摩地。不共者‧謂得圓滿次第殊勝三摩\n"+
		"地。如讚中云‧「如密咒乘教‧顯是加行道。」"
		,
		/*===========================第 6 頁===========================*/
		"<b><s>　於聖教所作事中分二‧<n>一</n>於印度所作事理‧<n>二</n>藏中所作事理。　　今初</s></b>\n"+
		"　　於勝金剛座大菩提寺‧曾經三次以法戰敗外道惡論住持佛教。即於自部‧上下聖教‧\n"+
		"所有未達‧邪解疑惑‧諸惡垢穢‧亦善除遣‧而弘聖教。故一切部‧不分黨類奉為頂嚴。如讚中\n"+
		"云‧「於大菩提寺‧一切集會中‧自部及他部‧諸惡宗敵者‧以獅吼聲語‧一切腦漿崩。」又云‧\n"+
		"「能飛聚落中‧出家二百半‧能映覆戒中‧出家不滿百。四本部全住‧尊部無慠舉‧摩羯陀境\n"+
		"內‧一切寺無餘‧成大師四眾。一切頂上珠‧尊居十八部‧一切頂中時‧一切皆受教。」\n"+
		"　　藏中所作事理者。天尊師長叔姪‧如其次第起大殷勤‧數數遣使洛拶嚩賈精進獅子‧\n"+
		"及拏錯戒勝‧往印迎請。菩提光時‧請至哦日鐸‧啟請治理佛陀聖教。依是因緣‧總集一切經\n"+
		"咒要義‧束為修行次第‧遂造菩提炬論等‧而興教法。此復住於哦日三載‧聶塘九歲‧衛藏餘\n"+
		"處‧五年之中‧為諸善士‧開示經咒教典教授‧罄盡無餘。聖教規模諸已沒者‧重新建樹‧諸略\n"+
		"存軌倍令增廣‧諸被邪解垢穢染者‧皆善治除‧令聖教寶悉離垢染。總之雪山聚中前弘聖\n"+
		"教‧謂聖靜命及蓮華生‧建聖教軌。然由支那和尚堪布‧解了空性未達扼要。以是因緣‧謗方\n"+
		"便分‧遮止一切作意思惟‧損減教法‧為蓮華戒大阿闍黎善破滅已‧決擇勝者所有密意‧為"
		,
		/*===========================第 7 頁===========================*/
		"恩極重。於後宏聖教‧則有一類妄自矜為善巧智者及瑜伽師‧由其倒執相續部義‧於教根\n"+
		"本清淨梵行‧作大損害‧為此善士‧善為破除。復能殄滅諸邪執著‧弘盛增廣無倒聖教‧故其\n"+
		"深恩普遍雪山一切眾生。\n"+
		"　　如是造論‧光顯能仁所有密意‧復有三種圓滿勝因‧謂善所知五種明處及具教授‧謂\n"+
		"從正遍知輾轉傳來‧於其中間善士未斷修持彼義扼要教授‧並得謁見本尊天顏‧獲言開\n"+
		"許。此等隨一雖能造論‧然三齊具極為圓滿‧此大阿闍黎三皆備具。\n"+
		"　　其為本尊所攝受者。如讚云‧「勝歡喜金剛‧立三昧耶王‧雄猛世自在‧主尊度母等‧謁\n"+
		"顏得許故‧或夢或現前‧常聞最甚深‧及廣大正法。」師傳承中‧有所共乘及其大乘二種傳\n"+
		"承。後中分二‧謂度彼岸及秘密咒。度彼岸中復有二種傳承‧謂見傳承及行傳承。其行傳承\n"+
		"復有從慈尊傳及妙音傳。於密咒中‧亦復具足傳承非一‧謂五派傳承‧復具宗派傳承‧加持\n"+
		"傳承‧及其種種教授傳承等。親從聞學諸尊長者‧如讚云‧「恆親近尊重‧謂寂靜金洲‧覺賢\n"+
		"吉祥智‧多得成就者。尊又特具足‧從龍猛輾轉傳來最甚深‧及廣大教授。」說有十二得成\n"+
		"就師‧然餘尚多善巧五種明處者‧前已說訖。是故此阿闍黎能善決擇勝者密意。此阿闍黎"
		,
		/*===========================第 8 頁===========================*/
		"於五印度‧迦溼彌羅‧鄔僅‧尼泊爾‧藏中諸地‧所有弟子不可思數。然主要者印度有四‧謂與\n"+
		"依怙智慧平等大善巧師‧號毘柁跋‧及法生慧‧中獅‧地藏‧或復加入友密為五。哦日則有寶\n"+
		"賢譯師‧拏錯譯師‧天尊重菩提光。後藏則有迦格瓦‧及廓枯巴天生。羅札則有卡巴勝位‧及\n"+
		"善護。康地則有大瑜伽師‧阿蘭若師‧智慧金剛卡達敦巴。中藏則有枯種三。是等之中‧能\n"+
		"廣師尊所有法業‧大持承者‧厥為度母親授記莂‧種敦巴勝生是也。造者殊勝略說如是‧廣\n"+
		"則應知出廣傳文。\n"+
		"　　顯示法殊勝中‧法者此教授基論‧謂菩提道炬。依怙所造雖有多論‧然如根本極圓滿\n"+
		"者‧厥為道炬。具攝經咒所有樞要而開示故‧所詮圓滿。調心次第為最勝故‧易於受持。又以\n"+
		"善巧二大車軌‧二師教授而莊嚴故‧勝出餘軌。\n"+
		"<b><s>　此論教授殊勝分四‧<n>一</n>通達一切聖教無違殊勝‧<n>二</n>一切聖言現為教授殊勝‧<n>三</n>易於獲得勝者密\n"+
		"　意殊勝‧<n>四</n>極大罪行自趣消滅殊勝。　　今初</s></b>\n"+
		"　　聖教者‧如般若燈廣釋中云‧「言聖教者‧謂無倒顯示‧諸欲證得甘露勝位‧若人若天\n"+
		"‧所應遍知‧所應斷除‧所應現證‧所應修行。即薄伽梵所說至言。」謂盡勝者所有善說。"
		,
		/*===========================第 9 頁===========================*/
		"　　達彼一切悉無違者。謂於此中解了是一補特伽羅成佛之道。此復隨其所應‧有是道\n"+
		"之正體‧有是道之支分。此中諸菩薩所欲求事者‧謂是成辦世間義利‧亦須遍攝三種種性\n"+
		"所化之機‧故須學習彼等諸道。如釋菩提心論云‧「如自定欲令‧他發決定故‧諸智者恆應‧\n"+
		"善趣無謬誤。」釋量亦云‧「彼方便生因‧不現彼難宣。」自若未能如實決定‧不能宣說開\n"+
		"示他故。\n"+
		"　　了知三乘道者‧即是成辦菩薩求事所有方便。阿逸多云‧「諸欲饒益眾生‧由道種智\n"+
		"成辦世間利。」勝者母中亦云‧「以諸菩薩應當發起一切道‧應當了知一切道‧謂所有聲\n"+
		"聞道‧所有獨覺道‧所有佛陀道。如是諸道亦應圓滿‧亦應成辦諸道所作。」故有說云‧是大\n"+
		"乘人故‧不應學習劣乘法藏者‧是相違因。\n"+
		"　　趣入大乘道者‧有共不共二種道。共者即是劣乘藏中所說諸道。此等何因而成應捨‧\n"+
		"故除少分希求獨自寂靜樂等不共者外‧所餘一切‧雖大乘人亦應修持。故諸菩薩方廣藏\n"+
		"中‧廣說三乘‧其因相者亦即此也。\n"+
		"　　復次正遍覺者‧非盡少過‧圓少分德。是遍斷盡一切種過‧周遍圓滿一切種德‧能成辦"
		,
		/*===========================第 10 頁===========================*/
		"此所有大乘‧亦滅眾過備起眾德。故大乘道遍攝一切餘乘所有一切斷證德類。是故一切\n"+
		"至言‧悉皆攝入成佛大乘道支分中。以能仁言‧無其弗能盡一過失‧或令發生一功德故。又\n"+
		"彼一切‧大乘亦無不成辦故。\n"+
		"　　設作是云‧若入波羅蜜多大乘‧雖須劣乘法藏所說諸道‧然於趣入金剛乘者‧度彼岸\n"+
		"乘所有諸道非為共同‧道不順故。此極非理‧以度彼岸道之體性‧悉皆攝入‧意樂‧謂於菩提\n"+
		"發心‧行‧謂修學六到彼岸‧是則一切定應習近。如勝金剛頂云‧「縱為活命故‧不應捨覺\n"+
		"心。」又云‧「六度彼岸行‧畢竟不應捨。」又餘咒教‧宣說非一。\n"+
		"　　眾多趣入無上瑜伽曼陀羅時‧亦多說須受共不共二種律儀。共者即是菩薩律儀。受\n"+
		"律儀者‧即是受學三聚戒等菩薩學處。除發心已如其誓受學所學處而修學外‧雖於波羅\n"+
		"蜜多乘中‧亦無餘道故。又金剛空行及三補止‧金剛頂中‧受阿彌陀三昧耶時‧悉作是云‧\n"+
		"「無餘受外密‧三乘正妙法。」受咒律儀須誓受故。由見此等少有開遮不同之分‧即執一\n"+
		"切‧猶如寒熱遍相違者‧是顯自智極粗淺耳。\n"+
		"　　如是唯除少分別緣開遮之外‧諸正至言‧極隨順故。若趣上上三乘五道‧必須完具下"
		,
		/*===========================第 11 頁===========================*/
		"下乘道功德種類。波羅蜜多道者‧如佛母中云‧「所有去來現在佛‧共道是此度非餘。」是\n"+
		"趣佛陀道之棟梁‧故不應捨。金剛乘中亦多說此‧故是經續二所共道。若於其上更加密咒\n"+
		"諸不共道‧灌頂‧三昧耶‧律儀‧二種次第及其眷屬‧故能速疾趣至佛陀。若棄共道‧是大錯謬。\n"+
		"若未獲得如是知解‧於一種法獲得一分相似決定‧便謗諸餘。特於上乘若得發起一似勝\n"+
		"解‧如其次第遂謗棄捨下乘法藏諸度彼岸‧即於咒中亦當謗捨下三部等‧則當集成極相\n"+
		"係屬‧甚易生起‧尤重異熟‧毀謗正法深厚業障。其中根據至下當說。\n"+
		"　　是故應當依善依怙‧於其一切正言‧皆是一數取趣成佛支緣‧所有道理‧令起定解。諸\n"+
		"現能修者即當修習。諸現未能實進止者‧亦不應以自未能趣而為因相‧即便棄捨。應作是\n"+
		"思‧願於何時於如是等‧由趣遮門‧現修學耶。遂於其因‧集積資糧‧淨治罪障‧廣發正願。以是\n"+
		"不久‧漸漸增長智慧能力‧於彼一切悉能修學。善知識敦巴仁波卿亦云‧「能知以四方道‧\n"+
		"攝持一切聖教者‧謂我師長。」此語即是極大可觀察處。由是因緣‧以此教授能攝經咒一\n"+
		"切扼要‧於一補特伽羅成佛道中而正引導。故此具足通達一切聖教無違殊勝。\n"+
		"　　一切聖言現為教授者。總之能辦諸欲解脫‧現時久遠一切利樂之方便者‧是即唯有"
		,
		/*===========================第 12 頁===========================*/
		"勝者至言。以能開示一切取捨要義‧盡離謬誤者‧獨唯佛故。如是亦如相續本母云‧「此世\n"+
		"間中更無善巧於勝者‧遍智正知無餘勝性定非餘‧是故大仙自立契經皆勿亂‧壞牟尼軌\n"+
		"故彼亦損於正法。」故諸契經及續部寶勝者聖言‧是勝教授。雖其如是‧然因末代諸所化\n"+
		"機‧若不具足定量釋論及善教授‧於佛至言自力趣者‧密意莫獲。故諸大車‧造諸釋論及諸\n"+
		"教授。是故若是清淨教授‧於諸廣大經論‧須能授與決定信解。若於教授雖多練習‧然於廣\n"+
		"大佛語釋論所有義理‧不能授與決定信解。或反顯示彼不順道‧唯應棄捨。若起是解‧諸大\n"+
		"經論是講說法‧其中無有可修要旨‧別有開示修行心要正義教授‧遂於正法執有別別講\n"+
		"修二法‧應知是於無垢經續無垢釋論‧起大敬重而作障礙。說彼等中‧不顯內義‧唯是開闢\n"+
		"廣大外解‧執為可應輕毀之處‧是集誹謗正法業障。是故應須作如是思而尋教授‧諸大經\n"+
		"論對於諸欲求解脫者‧實是無欺最勝教授。然由自慧微劣等因‧唯依是諸教典‧不能定知\n"+
		"是勝教授‧故應依止善士教授‧於是等中尋求定解。莫作是念起如是執‧謂諸經論唯是開\n"+
		"闢廣博外解‧故無心要。諸教授者‧開示內義故是第一。\n"+
		"　　大瑜伽師菩提寶云‧「言悟入教授者‧非說僅於量如掌許一小函卷而得定解。是說"
		,
		/*===========================第 13 頁===========================*/
		"了解一切至言皆是教授。」又如大依怙之弟子修寶喇嘛云‧「阿底峽之教授‧於一座上‧\n"+
		"身語意三‧碎為微塵。今乃了解‧一切經論皆是教授。」須如是知。如敦巴仁波卿云‧「若曾\n"+
		"學得眾多法已‧更須別求修法軌者‧是為錯謬。」雖經長時學眾多法‧然於修軌全未能知。\n"+
		"若欲修法‧諸更須從餘求者‧亦是未解如前說義而成過失。此中聖教‧如俱舍云‧「佛正法\n"+
		"有二‧以教證為體。」除其教證二聖教外‧別無聖教。教正法者‧謂是決擇受持道理修行正\n"+
		"軌。證正法者‧謂是如其前決擇時‧所決擇已而起修行。故彼二種‧成為因果。如跑馬時‧先示\n"+
		"其馬所應跑地‧既示定已‧應向彼跑。若所示地是此跑處而向餘跑者‧定成笑事。豈可聞思\n"+
		"決擇此事‧若修行時修行所餘。如是亦如修次第後編云‧「復次聞及思慧之所通達‧即是\n"+
		"修慧之所應修‧非應修餘‧如示跑地‧而應隨跑。」如是由此教授‧能攝一切經論道之樞要。\n"+
		"於從親近善知識法乃至止觀‧此一切中諸應捨修者‧即作捨修‧諸應舉修者‧即以擇慧而\n"+
		"正思擇。編為行持次第引導‧故一切聖言皆現為教授。若不爾者‧於非圓滿道體一分‧離觀\n"+
		"察慧雖盡壽修‧諸大經論非但不現為真教授‧且於彼等‧見唯開闢博大外解‧而謗捨之。現\n"+
		"見諸大經論之中所詮諸義‧多分皆須以觀察慧而正觀擇。此復修時若棄捨者‧則於彼等"
		,
		/*===========================第 14 頁===========================*/
		"何能發生定解‧見為最勝教授。此等若非最勝教授‧誰能獲得‧較造此等尤為殊勝教授論\n"+
		"師。如是若能將其深廣契經及釋現為教授‧則其甚深續部及論‧諸大教典‧亦無少勞現為\n"+
		"教授‧則能發起執持彼等為勝教授所有定解。能盡遮遣妄執彼等非實教授‧背棄正法諸\n"+
		"邪分別罄無所餘。\n"+
		"　　易於獲得勝者密意者。至言及論諸大教典‧雖是第一最勝教授。然初發業未曾慣修\n"+
		"補特伽羅‧若不依止善士教授‧直趣彼等難獲密意。設能獲得‧亦必觀待長久時期‧極大勤\n"+
		"勞。若能依止尊長教授‧則易通達。以此教授‧能速授與決定解了經論扼要。其中道理於各\n"+
		"時中茲當廣說。\n"+
		"　　極大惡行自行消滅者。如白蓮華及諦者品宣說‧一切佛語‧或實或權‧皆是開示成佛\n"+
		"方便。有未解是義者‧妄執一類為成佛方便及執他類為成佛障礙‧遂判好惡‧應理非理‧及\n"+
		"大小乘。謂其菩薩須於是學‧此不須學‧執為應捨‧遂成謗法。遍攝一切研磨經云‧「曼殊室\n"+
		"利‧毀謗正法‧業障細微。曼殊室利‧若於如來所說聖語‧於其一類起善妙想‧於其一類起惡\n"+
		"劣想‧是為謗法。若謗法者‧由謗法故‧是謗如來‧是謗僧伽。若作是云‧此則應理‧此非應理‧是"
		,
		/*===========================第 15 頁===========================*/
		"為謗法。若作是言‧此是為諸菩薩宣說‧此是為諸聲聞宣說‧是為謗法。若作是言‧此是為諸\n"+
		"獨覺宣說‧是為謗法。若作是言‧此者非諸菩薩所學‧是為謗法。」若毀謗法‧其罪極重。三摩\n"+
		"地王云‧「若毀此贍部洲中一切塔‧若毀謗契經‧此罪極尤重。若弒盡殑伽沙數阿羅漢‧若\n"+
		"毀謗契經‧此罪極尤重。」雖起謗法總有多門‧前說此門極為重大‧故應勵力而斷除之。此\n"+
		"亦若能獲得如前定解‧即能遮除。故其惡行自趣息滅。此定解者‧應由多閱諦者品及妙法\n"+
		"白蓮華經‧而尋求之。諸餘謗法之門‧如攝研經中‧應當了知。\n"+
		"<b><s>　如何講聽二種殊勝相應法中分三‧<n>一</n>聽聞軌理‧<n>二</n>講說軌理‧<n>三</n>於完結時共作軌理。　初中分三‧\n"+
		"　<n>一</n>思惟聞法所有勝利‧<n>二</n>於法法師發起承事‧<n>三</n>正聽軌理。　今初</s></b>\n"+
		"　　聽聞集云‧「由聞知諸法‧由聞遮諸惡‧由聞斷無義‧由聞得涅槃。」又云‧「如入善覆\n"+
		"蔽‧黑暗障室內‧縱然有眾色‧具眼亦莫見。如是於此中‧生人雖具慧‧然未聽聞時‧不知善惡\n"+
		"法。如具眼有燈‧則能見諸色‧如是由聽聞‧能知善惡法。」本生論亦云‧「若由聞法發信意‧\n"+
		"成妙歡喜獲堅住‧啟發智慧無愚癡‧用自肉買亦應理。聞除癡暗為明燈‧盜等難攜最勝財‧\n"+
		"是摧愚怨器開示‧方便教授最勝友。雖貧不變是愛親‧無所損害愁病藥‧摧大罪軍最勝軍‧"
		,
		/*===========================第 16 頁===========================*/
		"亦是譽德最勝藏‧遇諸善士為勝禮‧於大眾中智者愛。」又云‧「聽聞隨轉修心要‧少力即\n"+
		"脫生死城。」於其所說諸聞勝利‧應當決心發起勝解。\n"+
		"　　復次應如菩薩地說‧須以五想聽聞正法。謂佛出世極罕難遇‧其法亦然‧由稀貴故‧作\n"+
		"珍寶想。時時增長俱生慧故‧作眼目想。由其所授智慧眼目能見如所有性‧及盡所有性故‧\n"+
		"作光明想。於究竟時能與涅槃菩提果故‧作大勝利想。現在亦能得彼二之因‧止觀樂故‧作\n"+
		"無罪想。作是思惟‧即是思惟聽聞勝利。\n"+
		"　　於法法師發起承事者。如地藏經云‧「專信恭敬聽聞法‧不應於彼起毀謗。於說法師\n"+
		"供養者‧謂於師起如佛想。」應視如佛‧以獅座等恭敬利養而為供事‧斷不尊敬。應如菩薩\n"+
		"地中所說‧而正聽聞。謂應無雜染‧不應作意法師五處。離高舉者‧應時聽聞‧發起恭敬‧發起\n"+
		"承事‧不應忿恚‧隨順正行‧不求過失‧由此六事而聽聞之。離輕蔑雜染者‧謂極敬重法及法\n"+
		"師‧及於彼二不生輕蔑。不應作意五處所者‧謂戒穿缺‧種性下劣‧形貌醜陋‧文辭鄙惡‧所發\n"+
		"語句粗不悅耳。便作是念‧不從此聞‧而棄捨之。如本生中亦云‧「處極低劣座‧發起調伏德‧\n"+
		"以具笑目視‧如飲甘露雨‧起敬專至誠‧善淨無垢意‧如病聽醫言‧起承事聞法。」"
		,
		/*===========================第 17 頁===========================*/
		"<b><s>　正聞軌理分二‧<n>一</n>斷器三過‧<n>二</n>依六種想。　　今初</s></b>\n"+
		"　　若器倒覆‧及縱向上然不淨潔‧並雖淨潔若底穿漏。天雖於彼降以雨澤‧然不入內。及\n"+
		"雖入內或為不淨之所染污‧不能成辦餘須用事。或雖不為不淨染污‧然不住內‧當瀉漏之。\n"+
		"如是雖住說法之場‧然不屬耳‧或雖屬耳然有邪執‧或等起心有過失等。雖無上說彼等眾\n"+
		"過‧然聽聞時‧所受文義不能堅持‧由忘念等之所失壞‧則其聞法全無大益‧故須離彼等。此\n"+
		"三對治‧經說三語‧謂善‧諦聽聞‧意思念之。此亦猶如菩薩地說‧「希於遍知‧專注屬耳‧意善\n"+
		"敬住‧以一切心‧思惟聽聞。」\n"+
		"　　依六想中‧於自安住如病想者。如入行云‧「若遭常病逼‧尚須依醫言‧況長遭貪等‧百\n"+
		"過病所逼。」延長難療‧發猛利苦‧貪等惑病‧於長時中‧而痛惱故‧於彼應須了知是病。迦摩\n"+
		"巴云‧「若非實事‧作實事修‧雖成顛倒。然遭三毒‧極大乾病之所逼迫‧病勢極重‧我等竟無\n"+
		"能知自是病者。」\n"+
		"　　於說法師住如醫想者。如遭極重風膽等病‧便求善醫‧若得會遇發大歡喜‧隨教聽受\n"+
		"恭敬承事。如是於宣說法善知識所‧亦應如是尋求‧既會遇已‧莫覺如負擔‧應持為莊嚴‧依"
		,
		/*===========================第 18 頁===========================*/
		"教奉行‧恭敬承事。攝德寶中作是說故‧「故諸勇求勝菩提‧智者定應摧我慢‧如諸病人親\n"+
		"醫治‧親善知識應無懈。」\n"+
		"　　於所教誡起藥品想者。如諸病者‧於其醫師所配藥品‧起大珍愛。於說法師‧所說教授‧\n"+
		"及其教誡‧見重要已‧應多勵力‧珍愛執持‧莫令由其忘念等門‧而致損壞。\n"+
		"　　於殷重修起療病想者。猶如病者‧見若不服醫所配藥‧病則不瘥‧即便飲服。於說法師\n"+
		"所垂教授‧若不修習‧亦見不能摧伏貪等‧則應殷重而起修習。不應無修‧唯愛多積異類文\n"+
		"辭‧而為究竟。是亦猶如害重癩疾‧手足脫落‧若僅習近一二次藥‧全無所濟。我等自從無始‧\n"+
		"而遭煩惱重病之所逼害‧若依教授義‧僅一二次‧非為完足。故於圓具一切道分‧應勤勵力‧\n"+
		"如瀑流水‧以觀察慧‧而正思惟。如大德月大阿闍黎讚悔中云‧「此中心亦恆愚昧‧長時習\n"+
		"近重病痾‧如具癩者斷手足‧依少服藥有何益。」由是於自作病者想‧極為切要。如有此想‧\n"+
		"餘想皆起。此若僅是空言‧則亦不為除煩惱故修教授義‧唯樂多聞‧猶如病者‧求醫師已‧而\n"+
		"不服藥‧若唯愛著所配藥品‧病終無脫。三摩地王經云‧「諸人病已身遭苦‧無數年中未暫\n"+
		"離‧彼因重病久惱故‧為療病故亦求醫。彼若數數勤訪求‧獲遇黠慧明了醫‧醫亦安住其悲"
		,
		/*===========================第 19 頁===========================*/
		"愍‧教令服用如是藥。受其珍貴眾良藥‧若不服用療病藥‧非醫致使非藥過‧唯是病者自過\n"+
		"失。如是於此教出家‧遍了力根靜慮已‧若於修行不精進‧不勤現證豈涅槃。」又云‧「我雖\n"+
		"宣說極善法‧汝若聞已不實行‧如諸病者負藥囊‧終不能醫自體病。」入行論亦云‧「此等\n"+
		"應身行‧唯言說何益‧若唯誦藥方‧豈益諸病者。」故於殷重修‧應當發起療病之想。言殷重\n"+
		"者‧謂於善知識教授‧諸取捨處‧如實行持。此復行持‧須先了知‧知則須聞。聞已了知‧所有須\n"+
		"要‧即是行持。故於聞義‧應隨力能‧而起行持‧是極扼要。如是亦如聽聞集云‧「設雖有多聞‧\n"+
		"不善護尸羅‧由戒故呵彼‧其聞非圓滿。設雖聞寡少‧能善護尸羅‧由戒故讚彼‧其聞為圓滿。\n"+
		"若人既少聞‧不善護尸羅‧由俱故呵彼‧其禁行非圓。若人聞廣博‧及善護尸羅‧由俱故讚彼‧\n"+
		"其禁行圓滿。」又云‧「雖聞善說知心藏‧修諸三昧知堅實‧若行放逸令粗暴‧其聞及知無\n"+
		"大義。若喜聖者所說法‧身語如之起正行‧是等具忍友伴喜‧根護得聞知彼岸。」勸發增上\n"+
		"意樂亦云‧「謂我失修今何作‧歿時凡愚起憂悔‧未獲根底極苦惱‧此是愛著言說失。」又\n"+
		"云‧「如有處居觀戲場‧談說其餘勇士德‧自己失壞殷重修‧此是愛著言說失。」又云‧「甘\n"+
		"蔗之皮全無實‧所喜之味處於內‧若人嚼皮故非能‧獲得甘蔗精美味。如其外皮言亦爾‧思"
		,
		/*===========================第 20 頁===========================*/
		"此中義如其味‧故應遠離言說著‧常不放逸思惟義。」\n"+
		"　　於如來所住善士想者。隨念世尊是說法師‧發起恭敬。\n"+
		"　　於正法理起久住想者。作是思惟‧何能由其聞如是法‧令勝者教‧久住於世。\n"+
		"　　復次於法若講若聽‧將自相續若置餘處‧另說餘法‧是則任其講何法事‧不關至要。故\n"+
		"須正為‧決擇自身‧而聽聞之。譬如欲知面上有無黑污等垢‧照鏡知已即除其垢。若自行為\n"+
		"有諸過失‧由聞正法現於法鏡‧爾時意中便生熱惱‧謂我相續何乃至此。次乃除過‧修習功\n"+
		"德‧是故須應隨法修學。本生論云‧「我鄙惡行影‧明見於法鏡‧意極起痛惱‧我當趣正法。」\n"+
		"是如蘇達薩子‧請月王子宣說法時‧菩薩了知彼之意樂‧成聞法器而為說法。總之應作是\n"+
		"念發心‧謂我為利一切有情‧願當成佛‧為成佛故‧現見應須修學其因。因須先知‧知須聽法‧\n"+
		"是故應當聽聞正法。思念聞法勝利‧發勇悍心‧斷器過等而正聽聞。\n"+
		"<b><s>　第二說法軌理分四‧<n>一</n>思惟說法所有勝利‧<n>二</n>發起承事大師及法‧<n>三</n>以何意樂加行而說‧<n>四</n>於何\n"+
		"　等境應說不說所有差別。　　今初</s></b>\n"+
		"　　若不顧慮利養恭敬名等染事‧而說法者勝利極大。勸發增上意樂中云‧「慈氏‧無染"
		,
		/*===========================第 21 頁===========================*/
		"法施‧謂不希欲‧利養恭敬‧而施法施。此二十種是其勝利。何等二十‧謂成就念‧成就勝慧‧成\n"+
		"就覺慧‧成就堅固‧成就智慧‧隨順證達出世間慧‧貪欲微劣‧瞋恚微劣‧愚癡微劣‧魔羅於彼\n"+
		"不能得便‧諸佛世尊而為護念‧諸非人等於彼守護‧諸天於彼助發威德‧諸怨敵等不能得\n"+
		"便‧其諸親愛終不破離‧言教威重‧其人當得無所怖畏‧得多喜悅‧智者稱讚‧其行法施是所\n"+
		"堪念。」於眾經中所說勝利‧皆應至心發起勝解。其中成就堅固者‧新譯集學論中‧譯為成\n"+
		"就勝解‧諸故譯中‧譯為成就勇進。\n"+
		"　　發起承事大師及法者。如薄伽梵說佛母時‧自設座等‧法者尚是諸佛所應恭敬之田‧\n"+
		"故應於法起大尊敬‧及應隨念大師功德‧及其深恩起大敬重。\n"+
		"　　以何意樂加行而說中‧其意樂者‧謂應安住‧海慧問經所說五想。謂於自所應起醫想‧\n"+
		"於法起藥想‧於聞法者起病人想‧於如來所起善士想‧於正法理起久住想‧及於徒眾修習\n"+
		"慈心。應斷恐他高勝嫉妬‧推延懈怠‧數數宣說所生疲厭‧讚自功德舉他過失‧於法慳吝‧顧\n"+
		"著財物謂衣食等。應作是念‧為令自他得成佛故‧說法功德‧即是我之安樂資具。其加行者‧\n"+
		"謂先沐浴具足潔淨‧著鮮淨服‧於其清潔悅意處所‧坐於座已‧若能誦持伏魔真言‧海慧經"
		,
		/*===========================第 22 頁===========================*/
		"說則其周匝百踰繕那‧魔羅及其魔眾諸天所不能至‧縱使其來亦不能障‧故應誦咒。次以\n"+
		"舒顏‧具足審定義理所有喻因至教‧而為宣說。妙法白蓮經云‧「智者常應無嫉妬‧說具眾\n"+
		"義和美言‧復應遠離諸懈怠‧不應起發厭患想。智者應離一切慼‧應於徒眾修慈力‧晝夜善\n"+
		"修最勝法‧智以俱胝阿庾喻‧令眾愛樂生歡喜‧於彼終無少希欲‧亦不思欲諸飲食‧噉嚼衣\n"+
		"服及臥具‧法衣病緣醫藥等‧於諸徒眾悉無求。餘則智者恆願自‧及諸有情當成佛‧為利世\n"+
		"故而說法‧思彼即我安樂具。」\n"+
		"　　於何等境應說不說‧所有差別者。如毘奈耶經云‧「未請不應說。」謂未啟請不應為\n"+
		"說‧雖其請白亦應觀器‧若知是器‧縱未勸請‧亦可為說。如三摩地王經云‧「若為法施故‧請\n"+
		"白於汝者‧應先說是語‧我學未廣博‧汝是知善巧‧我於大士前‧如何能宣說。汝應說彼語‧不\n"+
		"應忽爾說。觀器而後行‧若已知是器‧未請亦應說。」復次毘奈耶經云‧「立為坐者不應說\n"+
		"法‧坐為臥者不應說法‧坐於底座為坐高座不應說法‧妙惡亦爾。在後行者為前行者不應\n"+
		"說法‧在道側者為道行者不應說法‧為諸覆頭‧抄衣‧雙抄‧抱肩及抱項者不應說法‧為頭結\n"+
		"髻‧著帽‧著冠‧著鬘‧纏首不應說法‧為乘象馬坐輦餘乘‧及著鞋履不應說法‧為手執杖‧傘‧器‧"
		,
		/*===========================第 23 頁===========================*/
		"劍‧鉞及被甲者‧不應說法。」返是應說‧依無病也。\n"+
		"　　於完結時共作軌理者。由講聞法所獲眾善‧應以猛利欲心迴向現時究竟‧諸希願處。\n"+
		"若以是軌講聞正法者‧雖僅一座亦定能生如經所說所有勝利。若講聞法至扼要故‧依是\n"+
		"因緣‧則昔所集於法法師‧不恭敬等一切業障‧悉能清淨。諸新集積亦截其流。又講聞軌至\n"+
		"於要故‧所講教授於相續上‧亦成饒益。總之先賢由見此故‧遂皆於此而起慎重‧特則今此\n"+
		"教授‧昔諸尊重殷重尤極。\n"+
		"　　現見此即極大教授‧謂見極多由於此事未獲定解‧心未轉故‧任說幾許深廣正法‧如\n"+
		"天成魔‧即彼正法而反成其煩惱助伴。是故如云初一若錯乃至十五。故此講聞入道之理‧\n"+
		"諸具慧者應當勵力。凡講聞時‧下至應令具足一分。講教授前第一加行‧即是此故。恐其此\n"+
		"等文詞浩繁‧總略攝其諸珍要者‧廣於餘處應當了知。教授先導已宣說訖。\n"+
		"<b><s>　第四如何正以教授‧引導學徒次第分二。<n>一</n>道之根本親近知識軌理‧<n>二</n>既親近已如何修心次\n"+
		"　第。　初中分二‧<n>一</n>令發定解故稍開宣說‧<n>二</n>總略宣說修持軌理。　　今初</s></b>\n"+
		"　　攝決定心藏云‧「住性數取趣‧應親善知識。」又如鐸巴所集博朵瓦語錄中云‧「總"
		,
		/*===========================第 24 頁===========================*/
		"攝一切教授首‧是不捨離善知識。」能令學者相續之中‧下至發起一德‧損減一過‧一切善\n"+
		"樂之本源者‧厥為善知識。故於最初‧依師軌理極為緊要。菩薩藏經作如是說‧「總之獲得\n"+
		"菩薩一切諸行‧如是獲得圓滿一切波羅蜜多‧地‧忍‧等持‧神通‧總持‧辯才‧迴向‧願及佛法‧皆\n"+
		"賴尊重為本。從尊重出‧尊重為生及為其處‧以尊重生‧以尊重長‧依於尊重‧尊重為因。」博\n"+
		"朵瓦亦云‧「修解脫者‧更無緊要過於尊重。即觀現世可看他而作者‧若無教者亦且無成\n"+
		"‧況是無間從惡趣來‧欲往從所未經之地‧豈能無師。」\n"+
		"<b><s>　由是親近知識之理分六‧<n>一</n>所依善知識之相‧<n>二</n>能依學者之相‧<n>三</n>彼應如何依師之理‧<n>四</n>依止勝</s></b>\n"+
		"<b><s>　利‧<n>五</n>未依過患‧<n>六</n>攝彼等義。　　今初</s></b>\n"+
		"　　總諸至言及解釋中‧由各各乘增上力故‧雖說多種‧然於此中所說知識‧是於三士所\n"+
		"有道中‧能漸引導‧次能導入大乘佛道。如經莊嚴論云‧「知識調伏靜近靜‧德增具勤教富\n"+
		"饒‧善達實性具巧說‧悲體離厭應依止。」是說學人‧須依成就十法知識。此復說為自未調\n"+
		"伏‧而調伏他‧無有是處。故其尊重能調他者‧須先調伏自類相續。若爾須一何等調伏‧謂若\n"+
		"隨宜略事修行‧於相續中有假證德名‧全無所益。故須一種順總佛教‧調相續法‧此即定為"
		,
		/*===========================第 25 頁===========================*/
		"三種寶學‧是故論說調伏等三。\n"+
		"　　其中調伏者‧謂尸羅學。別解脫云‧「心馬常馳奔‧恆勵終難制‧百利針順銜‧即此別解\n"+
		"脫。」又如分辨教云‧「此是未調所化銜。」如調馬師‧以上利銜調𢤱悷馬‧根如悷馬隨邪\n"+
		"境轉‧若其逐趣非應行時‧應制伏之。學習尸羅‧調伏心馬‧以多勵力制令趣向‧所應作品。寂\n"+
		"靜者‧如是於其妙行惡行‧所有進止‧由其依止念正知故‧令心發起內寂靜住‧所有定學。近\n"+
		"寂靜者‧依心堪能奢摩他故‧觀擇真義發起慧學。如是唯具調伏相續三學證德‧猶非完足‧\n"+
		"尚須成就聖教功德。言教富者‧謂於三藏等‧成就多聞。善知識敦巴云‧「言大乘尊重者‧謂\n"+
		"是須一‧若講說時‧能令發生無量知解‧若行持時‧於後聖教‧能成何益‧當時能有何種義\n"+
		"利。」\n"+
		"　　達實性者‧是殊勝慧學‧是謂通達法無我性‧或以現證真實為主。此若無者‧說由教理\n"+
		"通達亦成。\n"+
		"　　如是雖能具足教證‧若較學者或劣或等‧猶非圓足‧故須一種德增上者。親友集中作\n"+
		"如是說‧「諸人依劣當退失‧依平等者平然住‧依尊勝者獲尊勝‧故應親近勝自者。所有具"
		,
		/*===========================第 26 頁===========================*/
		"最勝‧戒近靜慧尊‧若親近是師‧較尊勝尤勝。」如樸窮瓦云‧「聞諸善士史傳之時‧我是向\n"+
		"上仰望於彼。」又如塔乙云‧「我於惹珍諸耆宿所‧而作目標。」是須一種目向上望。增上\n"+
		"德者。如是六法‧是自所應獲得之德‧諸所餘者是攝他德。此亦如云‧「諸佛非以水洗罪‧非\n"+
		"以手除眾生苦‧非移自證於餘者‧示法性諦令解脫。」若除為他說無謬道攝受而外‧無有\n"+
		"以水洗罪等事。其中四法‧善巧說者‧謂於如何引導次第而得善巧‧能將法義巧便送入所\n"+
		"化心中。\n"+
		"　　悲愍者‧謂宣說法等起清淨‧不顧利養及恭敬等‧是由慈悲等起而說‧是須猶如博朵\n"+
		"瓦告慬哦瓦云‧「黎摩子‧任說幾許法‧我未曾受讚一善哉‧以無眾生非苦惱故。」\n"+
		"　　具精勤者‧謂於利他勇悍剛決。遠離厭患者‧數數宣說而無疲倦‧謂能堪忍宣說苦勞。\n"+
		"博朵瓦云‧「三學‧及通達實性‧並悲愍心‧五是主要。我阿闍黎嚮尊滾‧既無多聞復不耐勞‧\n"+
		"雖酬謝語亦不善說‧具前五德故‧誰居其前悉能獲益。嚀敦‧全無善說‧雖說施願‧唯作是念\n"+
		"今此大眾皆未解此‧餘無所知‧然有前五‧故誰近能益。」如是若於諸所學處‧不樂修行‧唯\n"+
		"讚學處所有美譽或其功德以謀自活者‧則不堪任為善知識。宛如有人讚美栴檀‧謀自活"
		,
		/*===========================第 27 頁===========================*/
		"命‧有諸欲求妙栴檀者‧而問彼曰‧汝有檀耶‧答曰‧實無‧此全無義唯虛言故。三摩地王經云‧\n"+
		"「末世諸比丘‧多是無律儀‧希欲求多聞‧唯讚美尸羅‧然不求尸羅。」於定慧解脫三種‧亦\n"+
		"如是說。次云‧「如一類士夫‧稱揚栴檀德‧謂栴檀如此‧香相極可愛。次有諸餘人‧問如所稱\n"+
		"讚‧栴檀少有耶‧諸士夫此問‧答彼士夫云‧我是稱讚香‧以求自活命‧非我有其香。如是末世\n"+
		"出‧諸不勤瑜伽‧以讚戒活命‧彼等無尸羅。」所餘三種亦如是說故。如是修行解脫之尊重‧\n"+
		"乃是究竟欲樂之根本‧故諸欲求依尊重者‧應當了知‧彼諸德相‧勵力尋求具其相者。諸欲\n"+
		"為作學人依者‧亦應知此‧勵力具足如是德相。\n"+
		"　　由時運故‧具全德者實屬難得‧若未獲得如是師時‧將如何耶。妙臂請問經云‧「如其\n"+
		"僅有一輪車‧具馬於道亦不行‧如是若無修行伴‧有情不能獲成就。若有具慧形貌正‧潔淨\n"+
		"姓尊趣注法‧大辯勇悍根調伏‧和言能施有悲愍‧堪忍餓渴及苦惱‧不供婆羅門餘天‧精悍\n"+
		"工巧知報恩‧敬信三寶是良伴。諸能完具如是德‧於諍世中極稀故‧半德四分或八分‧應依\n"+
		"如是咒師伴。」此中所說圓滿伴相‧八分之一為下邊際。鐸巴所集博朵瓦語錄中‧述大依\n"+
		"怙說尊重相‧亦復同此。故於所說完具圓滿諸德相中‧隨其所應配其難易‧具八分者‧為下"
		,
		/*===========================第 28 頁===========================*/
		"邊際。\n"+
		"　　第二能依學者。四百論曰‧「說正住具慧‧希求為聞器。不變說者德‧亦不轉聽者。」釋\n"+
		"論解云‧「說具三法堪為聞器。若具其三‧則於法師所有眾德‧見為功德不見過失。猶非止\n"+
		"此‧即於聽眾所有功德‧亦即於彼補特伽羅‧見為功德非見過失。若不完具如是器相‧說法\n"+
		"知識雖極遍淨‧然由聞者過增上故‧執為有過‧於說者過‧反執為德。」是故縱得完具一切\n"+
		"德相知識‧然於其師亦難了知。若知彼已能親近者‧必須自具是諸德相。\n"+
		"　　其中正住者‧謂不墮黨類‧若墮黨執‧由彼蔽覆不見功德‧故不能得善說妙義。如中觀\n"+
		"心論云‧「由墮黨惱心‧終不證寂靜。」墮黨類者‧謂貪著自宗‧瞋他法派。應觀自心‧捨如是\n"+
		"執。菩薩別解脫經云‧「應捨自欲‧敬重安住‧親教軌範‧所有論宗。」\n"+
		"　　若念唯此即完足耶‧雖能正住‧若無簡擇善說正道‧惡說似道‧二事慧力‧猶非其器。故\n"+
		"須具慧解彼二說‧則能棄捨無堅實品取諸堅實。若念僅具二德足耶‧縱有此二‧若如畫中\n"+
		"聽聞法者‧全無發趣‧仍非其器‧故須具有廣大希求。釋中更加敬法法師‧屬意二相‧開說為\n"+
		"五。若如是者可攝為四‧謂於其法具大希求。聽聞之時善住其意‧於法法師起大敬重‧棄捨"
		,
		/*===========================第 29 頁===========================*/
		"惡說受取善說。此四順緣謂具慧解‧棄捨違緣謂正直住。\n"+
		"　　是諸堪為尊重引導所有之法‧應當觀察為具不具。若完具者應修歡慰‧若不具者須\n"+
		"於將來能完因緣勵力修作。故應了知能依諸法‧若不了知如是德相‧則不覺察‧由此退失\n"+
		"廣大義利。\n"+
		"　　第三彼應如何依師軌理者。如是若自具足器相‧應善觀察尊重具否如前說相。應於\n"+
		"具相‧受取法益。是復有二傳記不同‧謂善知識敦巴與桑樸瓦。桑樸瓦者‧尊重繁多‧凡有講\n"+
		"說‧即從聽聞。自康來時‧途中有一鄔波索迦說法而住‧亦從聽聞‧徒眾白曰‧「從彼聽聞‧退\n"+
		"自威儀。」答云‧「汝莫作是言‧我得二益。」善知識敦巴者‧尊重尠少‧數未過五。博朵瓦與\n"+
		"公巴仁勤喇嘛共相議論‧彼二誰善。謂於未修心‧易見師過‧起不信時‧善知識敦巴軌理善\n"+
		"美‧應如是行。現見此說‧極為諦實‧應如是學。\n"+
		"<b><s>　如是應知‧曾受法恩‧特於圓滿教授‧導心知識‧如何依止。其理分二‧<n>一</n>意樂親近軌理‧<n>二</n>加行親\n"+
		"　近軌理。　初中分三‧<n>一</n>總示親近意樂‧<n>二</n>特申修信以為根本‧<n>三</n>隨念深恩應起敬重。　　今初</s></b>\n"+
		"　　華嚴經說‧以九種心‧親近承事諸善知識‧能攝一切親近意樂所有扼要。即彼九心攝"
		,
		/*===========================第 30 頁===========================*/
		"之為四。棄自自在‧捨於尊重令自在者‧如孝子心。謂如孝子自於所作‧不自在轉‧觀父容顏‧\n"+
		"隨父自在‧依教而行。如是亦應觀善知識容顏而行。現在佛陀現證三摩地經中亦云‧「彼\n"+
		"於一切應捨自意‧隨善知識意樂而轉。」此亦是說‧於具德前乃可施行‧任於誰前不能隨\n"+
		"便授其鼻肉。\n"+
		"　　誰亦不能離其親愛能堅固者‧如金剛心。謂諸魔羅及惡友等‧不能破離。即前經云‧\n"+
		"「應當遠離‧親睦無常‧情面無常。」\n"+
		"　　荷負尊重一切事擔者‧如大地心。謂負一切擔‧悉無懈怠。如博朵瓦教示慬哦瓦諸徒\n"+
		"眾云‧「汝能值遇如此菩薩‧我之知識‧如教奉行‧實屬大福‧今後莫覺如擔‧當為莊嚴。」\n"+
		"　　荷負擔已應如何行‧其中分六。如輪圍山心者‧任起如何一切苦惱‧悉不能動。慬哦住\n"+
		"於汝巴時‧公巴德熾因太寒故‧身體衰退‧向依怙童稱議其行住。如彼告云‧「臥具安樂‧雖\n"+
		"曾多次住尊勝宮‧然能親近大乘知識‧聽聞正法者‧唯今始獲‧應堅穩住。」如世間僕使心\n"+
		"者‧謂雖受行一切穢業‧意無慚疑‧而正行辦。昔後藏中‧一切譯師智者集會之處‧有一泥灘‧\n"+
		"敦巴盡脫衣服掃除泥穢‧不知從何取來乾潔白土覆之‧於依怙前作一供壇。依怙笑曰‧"
		,
		/*===========================第 31 頁===========================*/
		"「奇哉‧印度亦有類似汝者。」如除穢人心者‧盡斷一切慢及過慢‧較於尊重應自低劣。如\n"+
		"善知識敦巴云‧「我慢高坵‧不出德水。」慬哦亦云‧「應當觀視春初之時‧為山峰頂諸高\n"+
		"起處‧青色遍生‧抑於溝坑諸低下處‧而先發起。」如乘心者‧謂於尊重事‧雖諸重擔極難行\n"+
		"者‧亦勇受持。如犬心者‧謂尊重毀罵‧於師無忿。如朵壟巴對於善知識畫師‧每來謁見便降\n"+
		"呵責‧畫師弟子摩瓦云‧「此阿闍黎於我師徒‧特為瞋恚。」畫師告云‧「汝尚聽為是呵\n"+
		"責耶‧我每受師如此賜教一次‧如得黑茹迦一次加持。」八千頌云‧「若說法師於求法者\n"+
		"現似毀咨而不思念‧然汝於師不應退捨‧復應增上希求正法‧敬重不厭‧隨逐師行。」如船\n"+
		"心者‧謂於尊重事任載幾許‧若往若來‧悉無厭患。\n"+
		"　　第二修信為根本者。寶炬陀羅尼云‧「信為前行如母生‧守護增長一切德‧除疑度脫\n"+
		"諸暴流‧信能表喻妙樂城。信無濁穢令心淨‧能令離慢是敬本‧信是最勝財藏足‧攝善之本\n"+
		"猶如手。」十法亦云‧「由何出導師‧信為最勝乘‧是故具慧人‧應隨依於信。諸不信心人‧不\n"+
		"生眾白法‧如種為火焦‧豈生青苗芽。」由進退門‧而說信為一切德本。敦巴請問大依怙云‧\n"+
		"「藏地多有修行者‧然無獲得殊勝德者‧何耶。」依怙答云‧「大乘功德‧生多生少‧皆依尊"
		,
		/*===========================第 32 頁===========================*/
		"重‧乃能生起。汝藏地人‧於尊重所‧僅凡庸想‧由何能生。」有於依怙發大聲白‧「阿底峽請\n"+
		"教授。」如其答云‧「哈哈‧我卻具有好好耳根‧言教授者‧謂是信心信信。」信為極要。其信\n"+
		"總之亦有多種‧謂信三寶‧業果‧四諦。然此中者‧謂信尊重。此復弟子於尊重所‧應如何觀。如\n"+
		"金剛手灌頂續云‧「秘密主‧弟子於阿闍黎所應如何觀‧如於佛薄伽梵即應如是。其心若\n"+
		"如是‧其善常生長‧彼當速成佛‧利一切世間。」諸大乘經亦說應起大師之想‧毘奈耶中亦\n"+
		"有是說。此諸義者‧謂若知是佛‧則於佛不起尋求過心‧起思德心。於尊重所‧特應棄捨一切\n"+
		"尋察過心‧修觀德心。此復應如彼續所說‧依之而行‧「應取軌範德‧終不應執過‧取德得成\n"+
		"就‧執眾過不成。」謂其尊重雖德增上‧若僅就其少有過處而觀察者‧則必障礙自己成就。\n"+
		"雖過增上若不觀過‧由功德處而修信心‧於自當為得成就因。是故凡是自之尊重‧任其過\n"+
		"失若大若小‧應當思惟‧尋求師過所有過患‧多起斷心而滅除之。設由放逸煩惱盛等之勢\n"+
		"力故‧發起尋覓過失之時‧亦應勵力悔除防護。若如是行‧力漸微劣。復應於其具諸淨戒‧或\n"+
		"具多聞‧或信等德‧令心執取‧思惟功德。如是修習‧設見若有少許過失‧由心執取功德品故‧\n"+
		"亦不能為信心障難。譬如自於所不樂品‧雖見具有眾多功德‧然由見過心勢猛故‧而能映"
		,
		/*===========================第 33 頁===========================*/
		"蔽見德之心。又如於自雖見眾過‧若見自身一種功德‧心勢猛利‧此亦能蔽見過之心。\n"+
		"　　復次如大依怙持中觀見‧金洲大師持唯識宗實相分見‧由見門中雖有勝劣‧然大乘\n"+
		"道總體次第及菩提心‧是由依彼始得發起‧故執金洲為諸尊重中無能匹者。\n"+
		"<b>菩提道次第廣論卷一終<b>"
		,
		/*===========================第 34 頁===========================*/
		"<b>菩提道次第廣論卷二</b>\n"+
		"　　下至唯從聞一偈頌‧雖犯戒等‧亦應就其功德思惟‧莫觀過失‧悉無差別。寶雲經云‧\n"+
		"「若知由其依止尊重‧諸善增長‧不善損減‧則親教師或聞廣博‧或復寡少‧或有智解‧或無\n"+
		"智解‧或具尸羅‧或犯尸羅‧皆應發起大師之想。如於大師信敬愛樂‧於親教師亦應信樂‧於\n"+
		"軌範師悉當發起恭敬承事。由此因緣菩提資糧‧未圓滿者悉能圓滿‧煩惱未斷悉能斷除。\n"+
		"如是思已‧便能獲得歡喜踴躍‧於諸善法應隨順行‧於不善法應不順行。」猛利問經亦云‧\n"+
		"「長者‧若諸菩薩求受聖教‧及求讀誦。若從誰所聽聞受持‧施戒忍進定慧相應‧或是集積\n"+
		"菩薩正道資糧相應‧一四句偈‧即應如法恭敬尊重此阿闍黎。隨以幾許名句文身開示其\n"+
		"偈‧假使即於爾所劫中‧以無諂心‧以一切種‧利養恭敬及諸供具‧承事供養此阿闍黎。長者\n"+
		"於阿闍黎‧作應敬重阿闍黎事‧猶未圓滿‧況非以法而為敬事。」\n"+
		"　　第三隨念恩者。十法經云‧「於長夜中‧馳騁生死尋覓我者。於長夜中為愚癡覆而重\n"+
		"睡眠‧醒覺我者。沈溺有海‧拔濟我者。我入惡道示善道者。繫縛有獄解釋我者。我於長夜‧病"
		,
		/*===========================第 35 頁===========================*/
		"所逼惱為作醫王。我被貪等猛火燒燃‧為作雲雨而為息滅。應如是想。」華嚴經說‧「善財\n"+
		"童子‧如是隨念痛哭流涕。諸善知識‧是於一切惡趣之中‧救護於我。令善通達法平等性。開\n"+
		"示安穩不安穩道。以普賢行而為教授。指示能往一切智城‧所有之道。護送往赴一切智處。\n"+
		"正令趣入法界大海。開示三世所知法海。顯示聖眾妙曼陀羅。善知識者‧長我一切白淨善\n"+
		"法。」應如此文而正隨念。一切句首‧悉加「諸善知識是我」之語。於前作意善知識相‧口\n"+
		"中讀誦此諸語句‧意應專一念其義理。於前經中‧亦可如是‧而加諸語。\n"+
		"　　又如華嚴經云‧「我此知識說正法‧普示一切法功德‧遍示菩薩威儀道‧專心思惟而\n"+
		"來此。此是能生如我母‧與德乳故如乳母‧周遍長養菩提分‧此諸善識遮無利。解脫老死如\n"+
		"醫王‧如天帝釋降甘雨‧增廣白法如滿月‧猶日光明示靜品。對於怨親如山王‧心無擾亂猶\n"+
		"大海‧等同船師遍救護‧善財是思而來此。菩薩啟發我覺慧‧佛子能生大菩提‧我諸知識佛\n"+
		"所讚‧由是善心而來此。救護世間如勇士‧是大商主及怙依‧此給我樂如眼目‧以此心事善\n"+
		"知識。」應咏其頌而憶念之‧易其善財而誦自名。\n"+
		"　　第二加行親近軌理者。如尊重五十頌云‧「此何須繁說‧勵觀彼及彼‧應作師所喜‧不"
		,
		/*===========================第 36 頁===========================*/
		"喜應盡遮。金剛持自說‧成就隨軌範‧知已一切事‧悉敬奉尊長。」總之應勵力行‧修師所喜‧\n"+
		"斷除不喜。作所喜者‧謂有三門‧供獻財物‧身語承事‧如教修行。如是亦如莊嚴經論云‧「由\n"+
		"諸供事及承事‧修行親近善知識。」又云‧「堅固由依教奉行‧能令其心正歡喜。」\n"+
		"　　其中初者‧如五十頌云‧「恆以諸難施‧妻子自命根‧事自三昧師‧況諸動資財。」又云‧\n"+
		"「此供施即成‧恆供一切佛‧此是福資糧‧從糧得成就。」復如拉梭瓦云‧「如有上妙供下\n"+
		"惡者‧犯三昧耶。若是尊長喜樂於彼‧或是唯有下劣供物‧則無違犯。」此與五十頌所說符\n"+
		"順‧如云‧「欲求無盡性‧如如少可意‧即應以彼彼‧勝妙供尊長。」此復若就學者方面‧以是\n"+
		"最勝集資糧故‧實應如是。就師方面‧則必須一‧不顧利養。霞惹瓦云‧「愛樂修行‧於財供養‧\n"+
		"全無顧著‧說為尊重。與此相違‧非是修行解脫之師。」\n"+
		"　　第二者謂為洗浴按摩擦拭及侍病等‧當如實讚師功德等。\n"+
		"　　第三者謂於教授遵行無違‧此是主要。本生論云‧「報恩供養者‧謂依教奉行。」設若\n"+
		"須隨師教行者‧若所依師引入非理及令作違三律儀事‧如何行耶。毘奈耶經於此說云‧\n"+
		"「若說非法‧應當遮止。」寶雲亦云‧「於其善法隨順而行‧於不善法應不順行。」故於所"
		,
		/*===========================第 37 頁===========================*/
		"教‧應不依行。不行非理者‧本生論第十二品亦有明證。然亦不應以此諸理‧遂於師所‧不敬\n"+
		"輕訾而毀謗等。如尊重五十頌云‧「若以理不能‧啟白不能理。」應善辭謝而不隨轉。如是\n"+
		"親近時‧亦如莊嚴經論云‧「為受法分具功德‧親近知識非為財。」是須受行正法之分。博\n"+
		"朵瓦云‧「差阿難陀為大師侍者時‧謂若不持大師不著之衣‧不食大師之餘食‧許一切時\n"+
		"至大師前‧則當侍奉承事大師。如此慎重‧其意是在教誨未來補特伽羅。我等於法全不計\n"+
		"較‧雖少許茶‧悉計高低‧謂師心中愛不愛念‧此是心內腐爛之相。」幾時親近者‧如博朵瓦\n"+
		"云‧「有一來者‧是加我擔‧若去一二‧是擔減少‧然住餘處‧亦不能成‧是須於一遠近適中經\n"+
		"久修習。」\n"+
		"　　第四親近勝利者。近諸佛位‧諸佛歡喜。終不缺離大善知識。不墮惡趣。惡業煩惱悉不\n"+
		"能勝。終不違越菩薩所行‧於菩薩行具正念故‧功德資糧漸漸增長。悉能成辦現前究竟一\n"+
		"切利義。承事師故‧意樂加行悉獲善業‧作自他利資糧圓滿。如是亦如華嚴經云‧「善男子‧\n"+
		"若諸菩薩‧為善知識正所攝受‧不墮惡趣。若諸菩薩‧為善知識所思念者‧則不違越菩薩學\n"+
		"處。若諸菩薩‧為善知識所守護者‧勝出世間。若諸菩薩‧承事供養善知識者‧於一切行不忘"
		,
		/*===========================第 38 頁===========================*/
		"而行。若諸菩薩‧為善知識所攝持者‧諸業煩惱難以取勝。」又云‧「善男子‧若諸菩薩‧隨善\n"+
		"知識所有教誡‧諸佛世尊心正歡喜。若諸菩薩‧於善知識所有言教‧安住無違‧近一切智。於\n"+
		"善知識‧言教無疑‧則能近於諸善知識。作意不捨善知識者‧一切利義‧悉能成辦。」不可思\n"+
		"議秘密經中亦云‧「若善男子‧或善女人‧應極恭敬‧依止親近承事尊重。若如是者‧聞善法\n"+
		"故成善意樂‧及由彼故成善加行。由是因緣‧造作善業。轉趣善行‧能令善友‧愛樂歡喜。由是\n"+
		"不作惡業‧作純善故‧能令自他不起憂惱。由能隨順護自他故‧能滿無上菩提之道‧故能利\n"+
		"益趣向惡道諸有情類。是故菩薩應依尊重‧圓滿一切功德資糧。」復次由其承事知識‧應\n"+
		"於惡趣所受諸業‧於現法中身心之上‧少起病惱‧或於夢中而領受者‧亦能引彼令盡無餘。\n"+
		"又能映蔽供事無量諸佛善根‧有如是等最大勝利。地藏經云‧「彼攝受者‧應經無量俱胝\n"+
		"劫中‧流轉惡趣所有諸業‧然於現法因疾疫等‧或飢饉等‧損惱身心而能消除‧下至呵責‧或\n"+
		"唯夢中亦能清淨。雖於俱胝佛所‧種諸善根‧謂行布施‧或行供養‧或受學處‧所起眾善‧然彼\n"+
		"僅以上半日善‧即能映蔽。承事尊重‧成就功德不可思議。」又云‧「諸佛無量功德神變‧應\n"+
		"觀一切悉從此出‧是故應如承事諸佛‧依止親近供事尊重。」本生論亦云‧「悉不應遠諸"
		,
		/*===========================第 39 頁===========================*/
		"善士‧以調伏理修善行‧由近彼故其德塵‧雖不故染自然薰。」博朵瓦云‧「我等多有破衣\n"+
		"之過‧如拖破衣‧唯著草穢‧不沾金沙。其善知識‧所有功德‧不能薰染‧略有少過‧即便染著。故\n"+
		"於一切略略親近‧悉無所成。」\n"+
		"　　第五不依過患者。請為知識若不善依‧於現世中‧遭諸疾疫非人損惱‧於未來世‧當墮\n"+
		"惡趣‧經無量時受無量苦。金剛手灌頂續云‧「薄伽梵‧若有毀謗阿闍黎者‧彼等當感何等\n"+
		"異熟。世尊告曰‧金剛手‧莫作是語‧天人世間悉皆恐怖‧秘密主‧然當略說‧勇士應諦聽。我說\n"+
		"無間等諸極苦地獄‧即是彼生處‧住彼無邊劫‧是故一切種‧終不應毀師。」五十頌亦云‧\n"+
		"「毀謗阿闍黎‧是大愚應遭‧疾癘及諸病‧魔疫諸毒死‧王火及毒蛇‧水羅叉盜賊‧非人礙神\n"+
		"等‧殺墮有情獄。終不應惱亂‧諸阿闍黎心‧設由愚故為‧地獄定燒煮。所說無間等‧極可畏地\n"+
		"獄‧諸謗師範者‧佛說住其中。」善巧成就寂靜論師‧所造札那釋難論中‧亦引經云‧「設唯\n"+
		"聞一頌‧若不執為尊‧百世生犬中‧後生賤族姓。」\n"+
		"　　又諸功德‧未生不生‧已生退失‧如現在諸佛現證三摩地經云‧「若彼於師住嫌恨心‧\n"+
		"或堅惡心‧或恚惱心‧能得功德‧無有是處。若不能作大師想者亦復如是。若於三乘補特伽"
		,
		/*===========================第 40 頁===========================*/
		"羅‧說法比丘‧不起恭敬‧及尊長想‧或大師想者‧此等能得未得之法‧或已得者‧令不退失‧無\n"+
		"有是處。由不恭敬‧沈沒法故。」設若親近不善知識及罪惡友‧亦令諸德漸次損減‧一切罪\n"+
		"惡漸次增長‧能生一切非所愛樂‧故一切種悉當遠離。念住經云‧「為貪瞋癡一切根本者‧\n"+
		"謂罪惡友‧此如毒樹。」涅槃經云‧「如諸菩薩怖畏惡友‧非醉象等‧此唯壞身‧前者俱壞善\n"+
		"及淨心。」又說彼二‧一唯壞肉身‧一兼壞法身。一者不能擲諸惡趣‧一定能擲。諦者品亦云‧\n"+
		"「若為惡友蛇執心‧棄善知識療毒藥‧此等雖聞正法寶‧嗚呼放逸墮險處。」親友集云‧\n"+
		"「無信而慳吝‧妄語及離間‧智者不應親‧勿共惡人住。若自不作惡‧近諸作惡者‧亦疑為作\n"+
		"惡‧惡名亦增長。人近非應親‧由彼過成過‧如毒箭置囊‧亦染無毒者。」惡知識者‧謂若近誰\n"+
		"能令性罪遮罪惡行‧諸先有者不能損減‧諸先非有令新增長。善知識敦巴云‧「下者雖與\n"+
		"上伴共住‧僅成中等。上者若與下者共住‧不待劬勞‧而成下趣。」\n"+
		"　　第六攝彼等義者。世遍讚說尊長瑜伽教授者‧應知即是如前所說。若一二次‧修所緣\n"+
		"境‧全無所至。若是至心欲行法者‧須恆親近‧無錯引導‧最勝知識。爾時亦如伽喀巴云‧「依\n"+
		"尊重時‧恐有所失。」謂若不知依止軌理而依止者‧不生利益反致虧損。故此依止知識法"
		,
		/*===========================第 41 頁===========================*/
		"類‧較餘一切極為重要。見是究竟欲樂根本‧故特引諸無垢經論‧並以易解‧能動心意‧符合\n"+
		"經義‧諸善士語‧而為莊嚴‧將粗次第‧略為建設‧廣如餘處‧應當了知。我等煩惱‧極其粗重。多\n"+
		"不了知依師道理。知亦不行‧諸聞法者‧反起無量依師之罪‧即於此罪亦難發生悔防等心‧\n"+
		"故應了知如前所說勝利過患‧數數思惟。於昔多生‧未能如法依止諸罪‧應由至心而悔‧多\n"+
		"發防護之心。自應勵備法器諸法‧數思圓滿德相知識‧積集資糧‧廣發大願‧為如是師‧乃至\n"+
		"未證菩提以來攝受之因。若如是者‧不久當如志力希有常啼佛子‧及求知識不知厭足善\n"+
		"財童子。\n"+
		"<b><s>　略說修習軌理分二‧<n>一</n>正明修法‧<n>二</n>破除此中邪妄分別。　初中分二‧<n>一</n>正修時應如何‧<n>二</n>未修中\n"+
		"　間應如何。初中分三‧<n>一</n>加行‧<n>二</n>正行‧<n>三</n>完結。　今初</s></b>\n"+
		"　　初加行法有六‧乃是金洲大師傳記。謂善灑掃所住處所‧莊嚴安布身語意像。由無諂\n"+
		"誑求諸供具端正陳設。次如聲聞地中所說‧「從昏睡蓋‧淨治心時‧須為經行。除此從餘‧貪\n"+
		"欲等蓋‧淨治心時‧應於床座‧或小座等‧結跏趺坐。」故於安樂臥具‧端正其身‧結跏趺坐‧或\n"+
		"半跏趺‧隨宜威儀。既安住已‧皈依發心‧決定令與相續和合。於前虛空明現觀想‧廣大行派"
		,
		/*===========================第 42 頁===========================*/
		"及深見派傳承諸師‧復有無量諸佛菩薩‧聲聞獨覺及護法眾為資糧田。又自相續中‧若無\n"+
		"能生道之順緣積集資糧‧及除逆緣淨治業障二助緣者‧唯勵力修所緣行相之正因‧亦難\n"+
		"生起。是故次應修習七支以治身心‧攝盡集淨諸扼要處。\n"+
		"　　其禮敬支中‧三門總禮者‧謂「所有」等一頌。非緣一方世界及一時之佛‧應緣十方\n"+
		"過去當來及現在所有一切諸佛‧以至誠心‧三業敬禮‧非隨他轉。智軍阿闍黎釋中云‧「此\n"+
		"復若僅頂禮一佛‧所得福德‧且無限量‧何況緣禮爾許諸佛。」\n"+
		"　　三門別禮中身禮敬者‧「普賢行願」等一頌。謂以方時所攝一切諸佛‧以意攀緣‧如\n"+
		"現前境。變化自身等諸佛剎‧極微塵數‧而申敬禮。此復是於諸境所有普賢妙行‧發淨信力‧\n"+
		"由此信力‧發起禮敬。「一身頂禮其福尚大‧況以爾許身業禮敬‧其福尤大。」智軍阿闍黎\n"+
		"所釋也。\n"+
		"　　意敬禮者‧「於一塵中」等一頌。謂於一一微塵之上‧皆有一切塵數諸佛安住菩薩\n"+
		"圍繞會中‧應發勝解‧隨念諸佛所有功德。\n"+
		"　　語敬禮者‧「各以一切」等一頌。謂於諸佛功德勝譽‧不可窮盡‧化一一身‧有無量首‧"
		,
		/*===========================第 43 頁===========================*/
		"化一一首‧有無量舌‧以微妙音而稱讚之。此中音者‧即是讚辭‧其支分者‧謂因即是舌根‧\n"+
		"（此與漢文稍有出入）海者是繁多辭。\n"+
		"　　供養支中‧有上供者‧「以諸最勝」等兩頌。最勝華者‧謂人天等處‧所有眾多希有散\n"+
		"華‧鬘謂配貫種種妙華。此二種中‧皆有一切或實或假。伎樂者‧謂諸樂具‧若弦若吹‧若打若\n"+
		"擊。塗香者‧謂妙香泥。勝傘蓋者‧謂諸傘中諸勝妙者。燈燭者‧謂香油等氣香‧光明及摩尼寶\n"+
		"有光明者。燒香者‧謂配眾香‧或唯一種所燒燃香。勝衣服者‧謂一切衣中最勝妙者。最勝香\n"+
		"者‧謂妙香水供為飲水‧以氛馥香遍三千界所熏水等。末香者‧謂妙香末可撒可燒‧或積為\n"+
		"堆‧或畫壇場‧支配顏色形量高廣等妙高峰。聚者加於前文一切之後‧有眾多義及莊飾義\n"+
		"並種種義。\n"+
		"　　無上供者‧「我以廣大」等一頌。言有上者‧謂世間供。此中乃是諸菩薩等‧神力所變\n"+
		"微妙供具。頌後二句‧於前一切不具足此二句義者悉應加之‧是說敬禮及諸供養所有等\n"+
		"起及其境界。（此與漢文稍有出入）\n"+
		"　　悔罪支者‧「我昔所作」等一頌。依三毒因‧身等三事‧其罪自性謂我所作‧此復具有"
		,
		/*===========================第 44 頁===========================*/
		"親自所作‧及教他作‧或於他作而發隨喜。總攝一切說「諸惡業」應念此等所有過患‧悔\n"+
		"先防後‧至心懺除‧則昔已作‧斷其增長‧諸未來者‧堵其相續。\n"+
		"　　隨喜支者‧「十方一切」等一頌。隨念此五補特伽羅所有善利修習歡喜‧猶如貧者\n"+
		"獲得寶藏。\n"+
		"　　勸請轉法輪支者‧「十方所有」等一頌。謂於十方剎土之中‧現證菩提‧獲得無著無\n"+
		"障礙智‧未經久時‧變爾許身‧勸請說法。智軍阿闍黎作「現證菩提」而為解釋。\n"+
		"　　請住世支者‧「諸佛若欲」等一頌。謂於十方剎土之中‧諸欲示現般涅槃者‧為令發\n"+
		"起一切眾生究竟利益‧現前安樂‧故變無量身‧勸住佛剎微塵數劫‧不般涅槃。\n"+
		"　　迴向支者‧「所有禮讚」等一頌。以上六支善‧表舉所有一切善根‧悉與一切有情共\n"+
		"同‧以猛利欲樂迴向令成大菩提因‧永無罄盡。如是了解此諸文義‧意不餘散‧具如文中所\n"+
		"說而行‧則能攝持無量德聚。此中禮敬‧供養‧勸請‧請住‧隨喜五者‧是為順緣積集資糧。悔者‧\n"+
		"是除違緣淨治罪障。隨喜支中一分‧於自造善‧修歡喜者‧亦是增長自所作善。其迴向者‧是\n"+
		"使積集淨治長養諸善‧雖極微少‧令增廣多。又使現前諸已感果將罄盡者‧終無窮盡‧總之"
		,
		/*===========================第 45 頁===========================*/
		"攝於積集‧淨治‧增長無盡三事之中。\n"+
		"　　次令所緣明了顯現‧供曼陀羅‧應以猛利欲樂‧多返祈禱‧謂「維願加持‧從不恭敬善\n"+
		"知識起‧乃至執著二種我相‧所有一切顛倒分別‧速當滅除。從敬知識‧乃至通達無我真實‧\n"+
		"所有一切無顛倒心‧速當發起。及其內外一切障緣‧悉當寂滅。」\n"+
		"<b><s>　正行分二‧<n>一</n>總共修法‧<n>二</n>此處修法。　　今初</s></b>\n"+
		"　　所言修者。謂其數數於善所緣‧令心安住‧將護修習所緣行相。蓋從無始‧自為心所自\n"+
		"在‧心則不為自所自在。心復隨向煩惱等障‧而為發起一切罪惡。此修即是‧為令其心‧隨自\n"+
		"自在‧堪如所欲‧住善所緣。此復若隨‧任遇所緣‧即便修者‧則於所欲如是次第‧修習爾許善\n"+
		"所緣境‧定不隨轉。反於如欲善所緣境堪任安住‧成大障礙。若從最初令成惡習‧則終生善\n"+
		"行‧悉成過失。故於所修諸所緣境‧數量次第‧先須決定。次應發起猛利誓願‧謂如所定‧不令\n"+
		"修餘。即應具足憶念正知‧而正修習‧如所決定‧令無增減。\n"+
		"　　此處修法者。先應思惟依止勝利速成佛等‧及不親近所有過患‧謂能引發現法後世\n"+
		"諸大苦等。次應多起防護之心。謂不容蓄‧分別尊長過失之心。隨自所知‧應當思惟‧戒定智"
		,
		/*===========================第 46 頁===========================*/
		"慧聞等諸德。乃至自心未起清淨行相信時‧應恆修習。次應思惟如前經說‧於自已作當作\n"+
		"諸恩‧乃至未發誠敬而修。\n"+
		"　　後時如何行者。應將所集眾多福善‧以猛利欲由普賢行願‧及七十願等‧迴向現時畢\n"+
		"竟諸可願處。如是應於晨起‧午前‧午後‧初夜‧四次修習。此復初修‧若時長久‧易隨掉沈自在\n"+
		"而轉。此若串習‧極難醫改‧故應時短‧次數增多。如云‧「有欲修心‧即便截止‧則於後次心欲\n"+
		"趣入。若不爾者‧見座位時‧即覺發嘔。」若待稍固‧時漸延長‧於一切中‧應離太急太緩加行\n"+
		"過失。由此能令障礙減少‧疲倦昏沈等亦當消滅。\n"+
		"　　未修中間如何行者。總之雖有禮拜旋繞及讀誦等‧多可行事‧然今此中正主要者‧謂\n"+
		"於正修時勵力修已‧未修之間‧若於所修行相所緣‧不依念知‧任其逸散‧則所生德‧極其微\n"+
		"尠。故於中間應閱顯說此法經論‧數數憶持。應由多門修集資糧生德順緣‧亦由多門淨治\n"+
		"所有違緣罪障。一切之根本‧應如所知‧勵力守護所受律儀。故亦有於所緣行相淨修其心‧\n"+
		"及律儀戒‧積集資糧三法之上‧名為三合而引導者。\n"+
		"　　復應學習四種資糧‧是易引發奢摩他道‧毘缽舍那道之正因‧所謂密護根門‧正知而"
		,
		/*===========================第 47 頁===========================*/
		"行‧飲食知量‧精勤修習悎寤瑜伽‧於眠息時應如何行。\n"+
		"　　初中有五。以何防護者‧謂遍護正念及於正念起常委行。其中初者‧謂於防護根門諸\n"+
		"法‧數數修習令不忘失。二者謂於正念‧常恆委重而修習之。何所防護者‧謂六種根。從何防\n"+
		"護者‧謂從可愛及非可愛六種境界。如何防護‧其中有二‧守護根者‧謂根境合‧起六識後‧意\n"+
		"識便於六可愛境六非愛境‧發生貪瞋‧應當勵力‧從彼諸境護令不生。即以六根而防護者‧\n"+
		"若於何境‧由瞻視等‧能起煩惱‧即於此境‧不縱諸根而正止息。其守護根者‧是於六境‧不取\n"+
		"行相‧不取隨好。若由忘念煩惱熾盛‧起罪惡心‧亦由防護而能止息。取行相者‧謂於非應觀\n"+
		"視色等‧正為境界‧或現在前‧即便作意彼等行相‧現前往觀。取隨好者‧謂於六識起後‧能引\n"+
		"貪瞋癡三之境‧意識執持‧或其境界‧雖未現前‧由從他聞‧分別彼等。防護為何者‧謂從雜染\n"+
		"守護其意‧令住善性‧或無記性。此中所住無覆無記者‧謂威儀等時‧非是持心住善緣時。\n"+
		"　　正知而行者有二‧何為所行事‧於彼行正知。初中有二‧謂五行動業及五受用業。其中\n"+
		"初五之身事業者‧謂若往赴所餘聚落餘寺院等‧若從彼還。眼事業者‧一若略睹‧謂無意為\n"+
		"先‧見種種境。二若詳瞻‧謂動意為先‧而有所見。一切支節業者‧謂諸支節‧若屈若伸。衣缽業"
		,
		/*===========================第 48 頁===========================*/
		"者‧謂若受用及其受持三衣及缽。乞食業者‧謂飲食等。寺內五種受用業中‧身事業者‧若行\n"+
		"謂往經行處‧或往同法者所‧或為法故行經於道。若住謂住行處‧同法親教‧軌範尊重‧似尊\n"+
		"等前。若坐謂於床等上結跏趺坐。語事業者‧謂若請受‧曾所未受‧十二分教‧分別了解。諸已\n"+
		"受者‧或自誦讀‧或為他說‧或為引發正精進故‧與他議論所有言說。意事業者‧謂諸默然‧若\n"+
		"於中夜而正眠臥‧若赴靜處‧思所聞義‧若以九心修三摩地‧若正勤修毘缽舍那‧或於熱季\n"+
		"極疲倦時‧於非時中起睡眠欲‧略為消遣。晝夜二業者‧謂於永日及初後夜‧不應睡眠‧此亦\n"+
		"顯示身語二業。言睡眠者‧顯示唯是夜間之業及是意業。\n"+
		"　　於此十事正知行者‧謂隨發起若行動業‧或受用業‧即於此業先應住念‧不放逸行。\n"+
		"由彼二種所攝持故‧應以何相而正觀察‧如何方便而正觀察‧即以是相‧如是方便觀察正\n"+
		"知。此中復有四種行相‧初謂於其身事業等十種依處‧應以何相如何觀察‧即於是處以是\n"+
		"行相‧如是觀察‧譬如於其往返事業‧如律所說‧往返行儀‧正了知已‧即於其時正知現前‧行\n"+
		"如是事。二謂於其何種方所‧應以何相如何觀察‧即於是方‧以是行相如是觀察‧譬如行時‧\n"+
		"應先了知沽酒等處‧五非應行‧除此所餘是可行處‧於彼彼時‧安住正知。三謂於其何等時"
		,
		/*===========================第 49 頁===========================*/
		"分‧應以何相如何觀察‧即於是時‧以如是相如是觀察‧譬如午前可赴聚落‧午後不可‧既了\n"+
		"知已‧即如是行‧爾時亦應安住正知。四於所有此諸事業‧應以何相如何觀察‧即應於其爾\n"+
		"所事業‧以如是相‧如是觀察‧譬如宣說行時應當極善防護而入他家‧所有此等行走學處‧\n"+
		"悉當憶念。總之所有若晝若夜一切現行‧悉應憶念‧了知其中‧應不應行‧於進止時‧一切皆\n"+
		"應安住正知‧謂我現前正行如是‧若進若止。若如是行‧則現法中不為罪染‧沒後亦不墮諸\n"+
		"惡趣‧諸道證德未獲得者‧即住能得正因資糧。\n"+
		"　　此與密護根門二者‧如聖無著引經解釋而正錄取。若能勵力修此二事‧則能增長一\n"+
		"切善行‧非餘能等。特能清淨尸羅及能速引止觀所攝無分別心勝三摩地‧故應勤學。\n"+
		"　　飲食知量者‧謂具四法。非太減少‧若太減少飢虛羸劣‧無勢修善‧故所食量‧應令未到\n"+
		"次日食時無飢損惱。非太多食‧若食太多‧令身沈重‧如負重擔‧息難出入‧增長昏睡‧無所堪\n"+
		"任‧故於斷惑全無勢力。相宜而食消化而食者‧依飲食起‧諸舊苦受‧悉當斷除‧諸新苦受皆\n"+
		"不生長。非染污心中量食者‧謂不起眾罪安樂而住。又於飲食愛著對治者‧謂依修習飲食\n"+
		"過患。過患有三‧由受用因所生過患者‧謂應思惟任何精妙色香味食‧為齒所嚼‧為涎所濕‧"
		,
		/*===========================第 50 頁===========================*/
		"猶如嘔吐。由食消化所生過患者‧謂思所食至中夜分或後夜分‧消化之後‧生血肉等‧諸餘\n"+
		"一類變成大小便穢不淨‧住身下分。此復日日應須除遣‧及由依食生多疾病。由求飲食所\n"+
		"起過患‧此有五種‧由為成辦所生過患者‧謂為成辦食及食因‧遭寒熱苦‧多施劬勞。若不成\n"+
		"辦憂憾而苦‧設若成辦‧亦恐劫奪及損失故‧發起猛利精勤守護‧而受諸苦。親友失壞者‧謂\n"+
		"由此故‧雖父子等互相鬥諍。不知滿足者‧由於飲食愛增長故‧諸國王等互相陣戰‧領受非\n"+
		"一眾多大苦。無自在過失者‧諸食他食者‧為其主故‧與他鬥競‧受眾多苦。從惡行生者‧謂為\n"+
		"飲食‧飲食因故‧三業造罪‧臨命終時‧憶念其罪‧追悔而死‧沒後復當墮諸惡趣。雖乃如是‧然\n"+
		"亦略有少許勝利‧謂由飲食安住其身。若唯為此故‧依止飲食‧不應道理。故應善思而後受\n"+
		"用‧謂由身住‧我當善修清淨梵行。施者施主亦為希求殊勝果故‧搾皮血肉而行惠施‧亦當\n"+
		"成辦彼等所願‧令得大果。又應憶念集學論說‧應當思念饒益施主‧及身中蟲‧現以財攝‧於\n"+
		"當來世‧當以法攝。又應思惟當辦一切有情義利‧而受飲食。親友書亦云‧「應知飲食如醫\n"+
		"藥‧無貪瞋癡而近習‧非為憍故非慢故‧非壯唯為住其身。」\n"+
		"　　精勤修習悎寤瑜伽‧於眠息時如何行者。親友書云‧「種性之主於永晝‧夜間亦過初"
		,
		/*===========================第 51 頁===========================*/
		"後分‧眠時亦莫空無果‧具足正念於中眠。」此顯永日‧及其夜間初後二分‧若正修時‧若其\n"+
		"中間‧如所應行。故行坐時‧應從五蓋‧淨修其心‧令不唐捐‧如前已說。此與護根‧正知三中‧皆\n"+
		"具修時修後二法‧此中所說‧是修後者。眠睡現行是修後事‧故此莫令空無果。如何眠者‧謂\n"+
		"於永日及夜三分‧於初分中‧修諸善行‧過初分已至中分時‧應當眠息‧諸為睡眠所養大種‧\n"+
		"由須睡眠而增長故。若能如是長養其身‧於諸善品修二精進‧極有堪能‧極為利益。臨睡息\n"+
		"時‧應出房外‧洗足入內‧右脅而臥‧重疊左足於右足上‧猶如獅子而正睡眠。如獅子臥者‧猶\n"+
		"如一切旁生之中‧獅力最大‧心高而穩‧摧伏於他。如是修習悎寤瑜伽‧亦應由其大勢力等‧\n"+
		"伏他而住‧故如獅臥。餓鬼諸天‧及受欲人‧所有臥狀‧則不能爾。彼等一切悉具懈怠‧精進微\n"+
		"劣‧少伏他故。又有異門‧猶如獅子右脅臥者‧法爾令身‧能不緩散。雖睡沈已‧亦不忘念。睡不\n"+
		"濃厚。無諸惡夢。若不如是而睡眠者‧違前四種‧一切過失‧悉當生起。\n"+
		"　　以何意樂睡眠有四‧光明想者‧謂應善取光明之相‧以其光心而睡眠之‧由是睡時心\n"+
		"無黑暗。念者‧謂聞思修諸善法義所成正念‧乃至未入熟睡之際‧應令隨逐。由此能令已睡\n"+
		"沈時等同未睡‧於彼諸法心多隨轉‧總之睡時亦能修諸善行。正知者‧謂由如是依止念時‧"
		,
		/*===========================第 52 頁===========================*/
		"隨起煩惱即能了知‧斷除不受。起想有三‧初者謂一切種‧其心不應為睡所蔽‧應以精進所\n"+
		"攝之心‧驚懾而眠‧猶如傷鹿‧由此睡眠‧不甚沈重‧不越起時‧而能醒覺。二者謂作是念‧我今\n"+
		"應修‧佛所開許悎寤瑜伽‧為修此故‧應大勵力‧引發欲樂。由是能依佛所開許獅子臥式眠\n"+
		"無增減。三者謂應作是思‧如我今日勤修悎寤‧及諸善法‧明日亦應如是勤修‧由是‧於善欲\n"+
		"樂相續‧雖忘念中亦能精勤修上上品。此食睡行‧若能無罪‧具義而行‧現見能遮眾多無義\n"+
		"虛耗壽數故。如聖者無著引經‧如所決擇‧而為解說。如是唯除正修時中所有不共修法之\n"+
		"外‧加行‧正行‧完結‧中間諸應行者‧從此乃至毘缽舍那‧所修一切所緣行相‧皆如是行。已釋\n"+
		"中間所應行說。\n"+
		"　　第二破除於此修軌邪執分別者。心未趣向聖言及釋諸大教典‧現教授者‧作如是言‧\n"+
		"正修道時‧不應於境數數觀察‧唯應止修‧若以觀慧數觀擇者‧是聞思時故。又諸分別‧是有\n"+
		"相執‧於正等覺‧為障礙故。此乃未達修行扼要‧極大亂說。莊嚴經論云‧「此依先聞‧如理作\n"+
		"意‧起修正作意‧真義境智生。」此說從其思所成慧‧如理作意‧所聞諸義‧修所成慧‧真義現\n"+
		"觀‧乃得起故。"
		,
		/*===========================第 53 頁===========================*/
		"　　故所應修者‧須先從他聞‧由他力故而發定解。次乃自以聖教正理‧如理思惟所聞諸\n"+
		"義‧由自力故而得決定。如是若由聞思決定‧遠離疑惑‧數數串習‧是名為修。故以數數觀察\n"+
		"而修‧及不觀察住止而修‧二俱須要。以於聞思所決擇義‧現見俱有不觀止住‧及以觀慧思\n"+
		"擇修故。是故若許一切修習皆止修者‧如持一麥說一切穀‧皆唯是此‧等同無異。復如聞所\n"+
		"成慧‧以聞為先‧思所成慧以思為先‧如是修所成慧‧亦應以修為先‧以其修慧從修成故。若\n"+
		"如是者‧則修所成慧前行之修‧即是修習思所成慧所決定義‧故說修慧從思慧生。以是若\n"+
		"有幾許多聞‧亦有爾多從此成慧‧此慧幾多其思亦多‧思惟多故從思成慧‧亦當不尠。如思\n"+
		"慧多‧則多修行‧修行多故‧則有眾多滅除過失‧引德道理。故諸經論‧皆說於修‧聞思最要。若\n"+
		"謂聞思所決擇者‧非為修故‧唯是廣闢諸外知解‧若正修時‧另修一種無關餘事‧如示跑處\n"+
		"另向餘跑‧則前所說悉無係屬‧亦是善破諸聖言中‧諸總建立三慧次第生起之理‧則其亂\n"+
		"說「趣無錯道‧不須多聞」亦成善說。未達此等扼要之相‧即是多習經典續部‧與一從來\n"+
		"未習教者‧於正修時‧二人所修‧全無多寡。又彼行者‧是執聞法及觀擇等以為過失‧諸惡軌\n"+
		"派令成堅固。是故串習聞思二慧所決定義‧雖非修成‧然許是修‧有何相違。若相違者‧則諸"
		,
		/*===========================第 54 頁===========================*/
		"異生未得初禪未到定時‧應全無修。以欲地中‧除說已得入大地時‧由彼因緣‧可生修所成\n"+
		"慧之外‧餘於欲地無修所成‧對法論中數宣說故。故言修者‧應當了知‧如波羅蜜多釋論明\n"+
		"顯文句中云‧「所言修者‧謂令其意‧成彼體分‧或成彼事。」譬如說云修信修悲‧是須令意\n"+
		"生為彼彼。以是諸大譯師‧有譯修道‧有譯串習。如現觀莊嚴論云‧「見習諸道中。」蓋修習\n"+
		"二‧同一義故。\n"+
		"　　又如至尊慈氏云‧「決擇分見道‧及於修道中‧數思惟稱量‧觀察修習道。」此說大乘\n"+
		"聖者修道‧尚有數數思惟‧稱量觀察。思擇此語‧則知若說將護與修二事相違‧是可笑處。\n"+
		"　　如是如說修習淨信‧修四無量‧修菩提心‧修無常苦‧皆是數數思擇將護‧說名為修‧極\n"+
		"多無邊。入行論及集學論云‧「為自意修我造此。」是二論中所說一切道之次第‧皆說為\n"+
		"修。集學論云‧「以如是故‧身受用福‧如其所應‧當恆修習‧捨護淨長。」此說身及受用善根\n"+
		"等三‧於一一中‧皆作捨護淨長四事‧說此一切皆名為修。故言修者‧不應執其範圍太小。\n"+
		"　　又說一切分別是相執故‧障礙成佛‧棄捨一切觀察之修‧此為最下邪妄分別‧乃是支\n"+
		"那和尚堪布之規。破除此執‧於止觀時‧茲當廣說。又此邪執障礙敬重諸大教典‧以彼諸教"
		,
		/*===========================第 55 頁===========================*/
		"所有義理‧現見多須以觀察慧而思擇故。諸思擇者‧亦見修時無所須故。又此即是聖教隱\n"+
		"沒極大因緣‧以見諸大經論非是教授‧心不重故。\n"+
		"　　如是修道有思擇修‧及不思擇止修二種。然如何者思擇修耶‧及如何者止住修耶‧謹\n"+
		"當解釋。如於知識修習淨信。及修暇滿‧義大難得。死沒無常。業果。生死過患‧及菩提心。須思\n"+
		"擇修。謂於此等‧須能令心猛利‧恆常變改其意。此若無者‧則不能滅此之違品‧不敬等故。起\n"+
		"如是心‧唯須依賴數數觀察思擇修故。如於貪境‧若多增益可愛之相‧則能生起猛利之貪‧\n"+
		"及於怨敵‧若多思惟不悅意相‧則能生起猛利瞋恚‧是故修習此諸道者‧境相明顯不明皆\n"+
		"可‧然須心力猛利恆常‧故應觀修。\n"+
		"　　若心不能住一所緣‧於一所緣‧為令如欲‧堪能住故‧修止等時‧若數觀察‧住心不生。故\n"+
		"於爾時則須止修。於止觀時此當廣說。\n"+
		"　　又有未解此理者‧說凡智者唯應觀修‧凡孤薩黎唯應止修。此說亦非‧以此一一皆須\n"+
		"二故。雖諸智者‧亦須修習奢摩他等。諸孤薩黎‧於善知識‧亦須修習猛信等故。又此二種修\n"+
		"行道理‧於諸經藏及續藏中‧俱說多種‧須由觀察而修習者。若無觀修或是微少‧則不能生"
		,
		/*===========================第 56 頁===========================*/
		"無垢淨慧‧道勝命根。慧縱略生‧亦不增長‧故於修道全無進步。道所修證最究竟者‧如敬母\n"+
		"阿闍黎云‧「慧中如遍智。」謂能無雜簡擇一切如所有性‧盡所有性‧即是慧故。\n"+
		"　　是故於道幾許修習‧反有爾許重大忘念‧念力鈍劣‧簡擇取捨意漸遲鈍‧當知即是走\n"+
		"入錯道正因之相。\n"+
		"　　又於三寶等功德差別‧若能多知‧依此之信亦多增長。若多了知生死過患‧故生眾多\n"+
		"厭患出離。若由多門‧能見解脫所有勝利‧故亦於此猛利希求。若多了解大菩提心‧及六度\n"+
		"等希有諸行‧則於此等諸不退信‧欲樂精進‧漸能增廣。如是一切皆依觀慧‧觀察經義修習\n"+
		"而起‧故諸智者應於此理‧引起定解‧他不能轉。\n"+
		"　　諸於修理見解極狹者‧作如是言‧若以觀慧‧極多思擇而修習者‧則能障礙‧專注一緣\n"+
		"勝三摩地‧故不能成堅固等持。此當宣說。若謂其心於一所緣‧如其所欲‧堪能安住‧此三摩\n"+
		"地‧先未成辦現新修時‧若數觀擇眾多所緣‧定則不生。乃至其定未成以來‧於引定修‧唯應\n"+
		"止修‧亦是我許。若謂引發如是定前‧觀修眾多即許是此定障礙者‧是全未解大車釋論宣\n"+
		"說引發三摩地軌。謂如黠慧鍛師‧將諸金銀數數火燒‧數數水洗‧淨除所有一切垢穢‧成極"
		,
		/*===========================第 57 頁===========================*/
		"柔軟堪能隨順。次作耳環等諸莊嚴具‧如欲而轉堪能成辦。如是先於煩惱隨惑及諸惡行‧\n"+
		"如在修習諸黑業果‧生死患等時中所說‧應以觀慧數數修習彼等過患‧令心熱惱‧或起厭\n"+
		"離‧以是作意如火燒金‧令意背棄諸黑惡品‧淨此諸垢。如在修習知識功德‧暇滿義大‧三寶\n"+
		"功德‧白淨業果及菩提心諸勝利等時中所說‧以觀察慧數數修習此等功德‧令心潤澤‧或\n"+
		"令淨信。以此作意‧如水洗金‧令意趣向諸白淨品‧愛樂歡喜‧以白善法澤潤其心。\n"+
		"　　如是成已‧隨所欲修若止若觀‧於彼屬意無大劬勞‧即能成辦。如是觀修‧即是成辦無\n"+
		"分別定勝方便故。如是亦如聖無著云‧「譬如黠慧鍛師或彼弟子‧若時為欲淨除金銀一\n"+
		"切垢穢‧於時時中火燒水洗‧柔軟隨順‧現前堪能成辦彼彼妙莊嚴具。黠慧鍛師若彼弟子‧\n"+
		"隨所了知‧順彼工巧以諸工具‧隨所欲樂妙莊嚴相‧皆能成辦。如是諸瑜伽師‧若時令心‧由\n"+
		"不趣向貪等垢穢‧而生厭離‧即能不趣染污憂惱。若時令心‧由於善品‧愛樂趣向‧即生歡喜。\n"+
		"次瑜伽師‧為令其心於奢摩他品‧或毘缽舍那品‧加行修習‧即於彼彼極能隨順‧極能安住‧\n"+
		"無動無轉‧如為成辦所思義故‧皆能成辦。」\n"+
		"　　又能令心堅固安住‧一所緣境勝三摩地‧所有違緣要有二種‧謂沈及掉。是中若有猛"
		,
		/*===========================第 58 頁===========================*/
		"利無間‧見三寶等功德之心‧則其沈沒極易斷除。以彼對治‧即是由見功德門中策舉其心。\n"+
		"定量諸師‧多宣說故。若有無間猛利能見無常苦等過患之心‧則其掉舉極易斷除。以掉舉\n"+
		"者‧是貪分攝散亂之心。能對治彼‧諸經論中‧讚厭離故。是故從於知識修信‧乃至淨修行心\n"+
		"以來‧若有幾許眾多熏修‧即有爾許速易成辦‧智者所喜妙三摩地。又非但止修‧即諸觀修‧\n"+
		"亦須遠離掉沈二過‧將護修習。此教授中諸大善巧先覺尊長‧隨授何等應時所緣‧為令於\n"+
		"其所緣法類‧起定解故‧由師教授‧引諸經論‧應時之義‧更以先覺語錄‧莊嚴環繞其心‧圓滿\n"+
		"講說。又如說云‧「若善說者為善聽者宣講演說‧如法會中所變心力‧暗中獨思難得生\n"+
		"起。」善哉‧誠然。故不應謂此是修時方略策勵。以此所說「聞思之時‧修行時者。」即是計\n"+
		"執說眾多法與正修持‧二時相違之邪分別故。\n"+
		"　　然能了解‧一切講說皆為修持者‧實屬少際。故能略攝所應修事‧亦可別書。\n"+
		"　　能不能現一切至言皆教授者‧唯是於此修習道理‧獲與未獲決定知解‧隨逐而成。況\n"+
		"於法藏諸未學者‧縱於經咒廣大教典諸久習者‧至修道時‧現見多成自所學習經論對方。\n"+
		"此亦雖應廣為決擇‧然恐文繁故不多說。破於修理諸邪分別‧已廣釋訖。"
		,
		/*===========================第 59 頁===========================*/
		"　　今應顯示‧如前所說‧如理依止善知識之弟子‧尊重應當如何引導之次第。\n"+
		"<b><s>　第二依已如何修心之次第分二‧<n>一</n>於有暇身勸取心要‧<n>二</n>如何攝取心要之理。　初中分三‧<n>一</n>正\n"+
		"　明暇滿‧<n>二</n>思其義大‧<n>三</n>思惟難得。　初中分二‧<n>一</n>閒暇‧<n>二</n>圓滿。　　今初</s></b>\n"+
		"　　如攝功德寶云‧「由戒斷諸畜趣體‧及八無暇常得暇。」謂離八無暇即是其暇‧八無\n"+
		"暇者如親友書云‧「執邪倒見‧生旁生‧餓鬼‧地獄‧無佛教‧及生邊地懱戾車‧性為騃啞‧長壽\n"+
		"天。於隨一中受生已‧名為八無暇過患‧離此諸過得閒暇‧故當策勵斷生死。」此復若無四\n"+
		"眾遊行‧是謂邊地。愚啞缺耳‧斷支節等名根不具。妄執無有前世後世‧業果‧三寶‧是邪見者。\n"+
		"無佛出世名無佛教。四中初二及最後者‧不能了解應取應捨‧第三不能信解正法。三惡趣\n"+
		"者‧極難發生修法之心‧設少生起‧亦因苦逼不能修行。長壽天者‧親友書釋中說是無想及\n"+
		"無色天‧八無暇論中‧亦說常為欲事散亂諸欲界天。無想天者‧對法中說‧於第四靜慮廣果\n"+
		"天中‧處於一分‧如聚落外阿蘭若處。除初生時及臨沒時‧餘心心所‧現行皆滅‧住多大劫。無\n"+
		"色聖人非是無暇‧故是生彼諸異生類‧以無善根修解脫道‧故是無暇。恆散欲天‧亦復如是‧\n"+
		"故說彼等亦名無暇。如親友書釋云‧「此八處中‧以無閒暇‧修作善品‧故名無暇。」"
		,
		/*===========================第 60 頁===========================*/
		"　　第二圓滿。分二‧五自圓滿者‧如云‧「人‧生中‧根具‧業未倒‧信處。」言生中者‧謂能生於\n"+
		"四眾弟子所遊之地。諸根具者‧謂非騃啞‧支節眼耳皆悉圓具。業未倒者‧謂未自作或教他\n"+
		"作無間之罪。信依處者‧謂信毘奈耶‧是世出世一切白法所生之處。毘奈耶者此通三藏。此\n"+
		"五屬於自身所攝‧是修法緣‧故名自滿。五他圓滿者‧如云‧「佛降‧說正法‧教住‧隨教轉‧有他\n"+
		"具悲愍。」言佛降世或出世者‧謂經三大阿僧祇劫積集資糧‧坐菩提座現正等覺。說正法\n"+
		"者‧謂若佛陀或彼聲聞宣說正法。教法住世者‧謂從成佛乃至未示入般涅槃‧勝義正法‧可\n"+
		"現修證未壞滅故。法住隨轉者‧謂即如是證正法者‧了知有力能證如是正法眾生‧即如所\n"+
		"證‧隨轉隨順教授教誡。他悲愍者‧謂有施者‧及諸施主與衣服等。此五屬於他身所有‧是修\n"+
		"法緣‧故名他滿。聲聞地中所說前四他圓滿者‧現在不具。然說正法‧法教安住‧隨住法轉‧尚\n"+
		"有隨順堪為具足。\n"+
		"　　第二思惟暇滿利大者。為欲引發畢竟樂故‧若未清淨修習正法‧僅為命存以來引樂\n"+
		"除苦而劬勞者‧旁生亦有‧故雖生善趣‧等同旁生。弟子書云‧「猶如象兒為貪著‧深阱邊生\n"+
		"數口草‧欲得無成墮險阬‧願現世樂亦如是。」"
		,
		/*===========================第 61 頁===========================*/
		"　　總之修行如是正法‧特若修行大乘道者‧任隨一身不為完具‧須得如前所說之身。如\n"+
		"弟子書云‧「善逝道依將成導眾生‧廣大心力人所獲得者‧此道非天龍得非非天‧妙翅持\n"+
		"明似人腹行得。」入胎經亦云‧「雖生人中‧亦具如是無邊眾苦‧然是勝處‧經俱胝劫亦難\n"+
		"獲得。諸天臨沒時‧諸餘天云‧願汝生於安樂趣中‧其樂趣者即是人趣。」諸天亦於此身為\n"+
		"願處故。又有欲天‧昔人世時‧由其修道習氣深厚‧堪為新證見諦之身‧然上界身‧則定無新\n"+
		"得聖道者。如前所說‧欲天亦多成無暇處‧故於最初修道之身‧人為第一。此復俱盧洲人‧不\n"+
		"堪為諸律儀所依‧故讚三洲之身‧其中尤以贍部洲身‧為所稱歎。是故應當作是思惟‧我今\n"+
		"獲得如是妙身‧何故令其空無果利。我若令此空無利者‧更有何事較此自欺‧較此愚蒙‧而\n"+
		"為重大。曾數馳奔諸惡趣等無暇險處‧一次得脫‧此若空耗仍還彼處者‧我似無心‧如被明\n"+
		"咒之所蒙蔽‧由此等門應數數修。如聖勇云‧「得何能下種‧度生死彼岸‧妙菩提勝種‧勝於\n"+
		"如意珠‧功德流諸人‧誰令此無果。」入行論亦云‧「得如是暇已‧我若不修善‧無餘欺過此‧\n"+
		"亦無過此愚。若我解是義‧愚故仍退屈‧至臨命終時‧當起大憂惱。若難忍獄火‧常燒我身者‧\n"+
		"粗猛惡作火‧定當燒我心。難得利益地‧由何偶獲得‧若我如有知‧仍被引入獄‧如受咒所蒙‧"
		,
		/*===========================第 62 頁===========================*/
		"我於此無心‧何蒙我未知‧我心有何物。」敦巴亦謂慬哦瓦云‧「憶念已得暇滿人身乎。」\n"+
		"慬哦亦於每次修時‧必誦一遍入中論頌中‧「若時自在轉順住‧設不於此自任持‧墮險成\n"+
		"他自在轉‧後以何事從彼出。」而為心要‧應如是學。如其觀待畢竟義大‧如是觀待現時亦\n"+
		"然。謂增上生中‧自身受用眷屬圓滿之因‧布施持戒及忍辱等‧若以此身易能成辦‧此諸道\n"+
		"理亦應思惟。如是觀待若增上生‧若決定勝‧義大之身‧若不晝夜殷勤勵力此二之因‧而令\n"+
		"失壞‧如至寶洲空手而返‧後世亦當匱乏安樂‧莫得暇身。若不得此‧眾苦續生‧更有何事較\n"+
		"此欺誑‧應勤思惟。如聖勇云‧「若眾善富人‧由無量劫得‧愚故於此身‧未略集福藏‧彼等趣\n"+
		"他世‧難忍憂惱室‧如商至寶洲‧空手返自家‧無十善業道‧後亦不能得‧不得人唯苦‧如何能\n"+
		"受樂‧他欺無過此‧無過此大愚。」如是思後‧當發極大取心要欲。如入行論云‧「與此工價\n"+
		"已‧令今作我利‧於此無恩利‧不應與一切。」又云‧「由依人身筏‧當度大苦流‧此筏後難得‧\n"+
		"愚莫時中眠。」又如博朵瓦喻法中云‧「蟲禮騎野馬‧藏魚梅烏食。」應如是思‧發起攝取\n"+
		"心要欲樂。\n"+
		"　　第三思惟極難得者。如是暇身如事教中說‧「從惡趣死復生彼者‧如大地土‧從彼死"
		,
		/*===========================第 63 頁===========================*/
		"沒生善趣者‧如爪上塵。從二善趣死生惡趣者‧如大地土‧從彼沒已生善趣者‧如爪上塵。」\n"+
		"故從善趣惡趣二俱難得。若作是念‧彼由何故如是難得‧如四百頌云‧「諸人多受行‧非殊\n"+
		"勝善品‧是故諸異生‧多定往惡趣。」謂善趣人等‧亦多受行十不善等‧非勝妙品‧由是亦多\n"+
		"往惡趣故。又如於菩薩所‧起瞋恚心‧一一剎那‧尚須經劫住阿鼻獄。況內相續現有往昔多\n"+
		"生所造眾多惡業‧果未出生‧對治未壞‧豈能不經多劫住惡趣耶。如是若能決定淨治往昔\n"+
		"所造惡趣之因‧防護新造‧則諸善趣雖非希貴‧然能爾者‧實極稀少。若未如是修則定往惡\n"+
		"趣。既入惡趣則不能修善‧相續為惡‧故經多劫‧雖善趣名亦不得聞‧故極難得。入行論云‧「\n"+
		"我以如是行‧且不得人身‧人身若不得‧唯惡全無善。若時能善行‧然我不作善‧惡趣苦蒙蔽‧\n"+
		"爾時我何為。未能作諸善‧然已作眾惡‧經百俱胝劫‧不聞善趣名。是故薄伽梵‧說人極難得‧\n"+
		"如龜項趣入‧海漂軛木孔。雖剎那作罪‧尚住無間劫‧況無始生死‧作惡豈善趣。」若作是念‧\n"+
		"由受惡趣苦盡昔惡業已‧仍可生樂趣‧故非難脫也。即受彼苦之時‧時時為惡‧從惡趣沒後‧\n"+
		"仍須轉惡趣‧故難脫離。如云‧「非唯受彼已‧即便能脫離‧謂正受彼時‧復起諸餘惡。」如是\n"+
		"思惟難得之後‧應作是念‧而發欲樂攝取心要。謂若使此身為惡行者‧是徒耗費‧應修正法"
		,
		/*===========================第 64 頁===========================*/
		"而度時期。如親友書云‧「從旁生出得人身‧較龜處海遇軛木‧孔隙尤難故大王‧應行正法\n"+
		"令有果。若以眾寶飾金器‧而用除棄吐穢等‧若生人中作惡業‧此極愚蒙過於彼。」弟子書\n"+
		"中亦云‧「得極難得人身已‧應勤修證所思義。」此又如大瑜伽師謂慬哦云‧「應略休\n"+
		"息。」答云‧「實當如是‧然此暇滿‧實為難得。」又如博朵瓦云‧「如昔坌宇有一雕房‧名瑪\n"+
		"卡喀‧甚為壯麗‧次為敵人所劫‧經久失壞。有一老人因此房故‧心極痛惜‧後有一次聞說其\n"+
		"房為主所得‧自不能走‧憑持一矛逶迤而至‧如彼喜曰‧今得瑪卡喀‧寧非夢歟。今得暇滿‧亦\n"+
		"應獲得如是歡喜‧而修正法。」乃至未得如是心時‧應勤修學。\n"+
		"　　如是若於暇身‧能發一具相取心要之欲樂‧須思四法。其中須修行者‧謂一切有情‧皆\n"+
		"唯愛樂而不愛苦‧然引樂除苦亦唯依賴於正法故。能修行者‧謂外緣知識‧內緣暇滿‧悉具\n"+
		"足故。此復必須現世修者‧現世不修‧次多生中‧暇滿之身極難得故。須於現在而修行者‧謂\n"+
		"何日死‧無決定故。其中第三‧能破推延於後生中修法懈怠。第四能破雖於現法定須修行‧\n"+
		"然於前前諸年月日‧不起修行‧而念後後修行‧亦可不趣懈怠。總攝此二為應速修‧作三亦\n"+
		"可。是則念死亦與此係屬‧然恐文繁至下當說。"
		,
		/*===========================第 65 頁===========================*/
		"　　如是若由種種門中正思惟者‧變心力大‧故應思惟如前所說。若不能者則應攝為‧如\n"+
		"何是為暇滿體性‧現竟門中利大道理‧因果門中難得道理。隨所相宜從前說中‧取而修習。\n"+
		"其中因門難獲得者‧謂僅總得生於善趣‧亦須戒等修一淨善‧特若獲得暇滿具足‧則須淨\n"+
		"戒而為根本‧施等助伴‧無垢淨願為結合等眾多善根。現見修積如是因者‧極為希少‧比此\n"+
		"而思善趣身果‧若總若別‧皆屬難得。由果門中難獲得者‧觀非同類諸惡趣眾‧僅得善趣‧亦\n"+
		"屬邊際‧觀待同類諸善趣眾‧殊勝暇身極屬希少。如格喜鐸巴云‧「殷重修此‧餘一切法由\n"+
		"此引生。」故應勵力。\n"+
		"<b>菩提道次第廣論卷二終</b>"
		,
		/*===========================第 66 頁===========================*/
		"<b>菩提道次第廣論卷三</b>\n"+
		"<b><s>　第二如何取心要之理分二‧<n>一</n>於道總建立發決定解‧<n>二</n>正於彼道取心要之理。　初中分二‧<n>一</n>\n"+
		"　三士道中總攝一切至言之理‧<n>二</n>顯示由三士門如次引導之因相。　　今初</s></b>\n"+
		"　　佛初發心‧中集資糧‧最後現證圓滿正覺‧一切皆是為利有情‧故所說法一切亦唯為\n"+
		"利有情。如是所成有情利義‧略有二種‧謂現前增上生及畢竟決定勝。其中依於成辦現前\n"+
		"增上生事‧盡其所說‧一切皆悉攝入下士‧或共下士所有法類。殊勝下士者‧是於現世不以\n"+
		"為重‧希求後世善趣圓滿‧以集能往善趣因故。道炬論云‧「若以諸方便‧唯於生死樂‧希求\n"+
		"自利義‧知彼為下士。」決定勝中‧略有二種‧謂證解脫僅出生死及一切種智位。其中若依\n"+
		"諸聲聞乘及獨覺乘‧盡其所說一切皆悉攝入中士‧或共中士所有法類。中士夫者‧謂發厭\n"+
		"患一切諸有‧為求自利‧欲得度出三有解脫‧以趣解脫方便之道三種學故。道炬論云‧「背\n"+
		"棄諸有樂‧遮惡業為性‧若唯求自靜‧說名中士夫。」如覺所造攝行炬論云‧「尊長佛說\n"+
		"依‧密咒度彼岸‧能辦菩提故‧此當書彼義。」謂修種智方便有二‧謂密咒大乘及波羅蜜多"
		,
		/*===========================第 67 頁===========================*/
		"大乘。此二攝入上士法類。上士夫者‧謂由大悲自在而轉‧為盡有情一切苦故‧希得成佛學\n"+
		"習六度及二次第等故。道炬論云‧「由達自身苦‧若欲正盡除‧他一切苦者‧是為勝士夫。」\n"+
		"此士所修菩提方便‧謂波羅蜜多及咒‧下當廣說。\n"+
		"　　三士之名‧攝決擇曰‧「復有三士‧謂有成就正受非律儀非非律儀所攝淨戒律儀。亦\n"+
		"有成就正受聲聞相應淨戒律儀。亦有成就正受菩薩淨戒律儀。其中初者為下‧第二為中‧\n"+
		"第三為勝。」與此義同‧復說多種上中下士建立道理。如道炬所說‧世親阿闍黎於俱舍釋\n"+
		"中‧亦說三士之相。下士夫中‧雖有二類‧謂樂現法及樂後世。此是第二‧復須趣入增上生無\n"+
		"謬方便。\n"+
		"<b><s>　第二顯示由三士門如次引導之因相分二‧<n>一</n>顯示何為由三士道引導之義‧<n>二</n>如是次第引導\n"+
		"　之因相。　　今初</s></b>\n"+
		"　　如是雖說三士‧然於上士道次第中‧亦能攝納餘二士道無所缺少‧故彼二種是大乘\n"+
		"道或分或支。馬鳴阿闍黎所造‧修世俗菩提心論云‧「無害與諦實‧與取及梵行‧捨一切所\n"+
		"執‧此是善趣行。遍觀生死苦‧斷故修諦道‧斷除二種罪‧此是寂靜行。亦應取此等‧是出離道"
		,
		/*===========================第 68 頁===========================*/
		"支。由達諸法空‧生悲眾生流‧無邊巧便行‧是勝出離行。」是故此中非導令趣‧唯以三有之\n"+
		"樂‧為所欲得下士夫道‧及為自利唯脫生死‧為所欲得中士夫道。是將少許共彼二道‧作上\n"+
		"士道引導前行‧為修上士道之支分。\n"+
		"　　是故若發如前所說取心要欲‧取心要之法‧如中觀心論云‧「誰不將無堅‧如蕉沫之\n"+
		"身‧由行利他緣‧修須彌堅實。上士具悲故‧將剎那老死‧病根本之身‧為他安樂本。具正法炬\n"+
		"時‧斷八無暇暇‧應以上士行‧令其有果利。」謂應念云‧我身無實‧如蕉如沫‧眾病巢穴‧老等\n"+
		"眾苦所出生處‧應以上士所有現行度諸晝夜‧令其不空而趣大乘。\n"+
		"　　若爾理應先從上士引導‧云何令修共下中耶。謂修此二所共之道‧即上士道發起前\n"+
		"行‧此中道理後當宣說。\n"+
		"<b><s>　第二如是次第引導之因相分二‧<n>一</n>正明因相‧<n>二</n>所為義。　　今初</s></b>\n"+
		"　　轉趣大乘能入之門者‧謂即發心於勝菩提。若於相續中生起此心‧如入行論云‧「若\n"+
		"發大心剎那頃‧繫生死獄諸苦惱‧應說是諸善逝子。」謂即獲得佛子之名‧或菩薩名‧其身\n"+
		"即入大乘之數。若退此心‧亦從大乘還退出故。是故諸欲入大乘者‧須以眾多方便勵力令"
		,
		/*===========================第 69 頁===========================*/
		"發。然發此心須先修習發心勝利‧令於勝利由於至心勇悍增廣。及須皈依七支願行。是能\n"+
		"開示菩薩道次最勝教典‧集學處論及入行論中所說。\n"+
		"　　如是所說勝利略有二種‧謂諸現前及畢竟勝利。初中復二‧謂不墮惡趣及生善趣。若\n"+
		"發此心能淨宿造眾多惡趣之因‧能斷當來相續積集。諸善趣因‧先已作者‧由此攝故‧增長\n"+
		"廣大‧諸新作者‧亦由此心為等起故‧無窮盡際。畢竟利義者‧謂諸解脫及一切種智‧亦依此\n"+
		"心易於成辦。若於現時畢竟勝利‧先無真實欲得樂故‧雖作是言‧此諸勝利從發心生‧故應\n"+
		"勵力發起此心。亦唯空言。觀自相續‧極明易了。若於增上生及決定勝‧二種勝利發欲得者‧\n"+
		"故須先修共中下士所有意樂。如是若於二種勝利‧發欲得已‧趣修具有勝利之心者‧則須\n"+
		"發起此心根本大慈大悲。此復若思‧自於生死安樂匱乏‧眾苦逼惱‧流轉道理‧身毛全無‧若\n"+
		"動若轉‧則於其他有情流轉生死之時‧樂乏苦逼‧定無不忍。入行論云‧「於諸有情先‧如是\n"+
		"思自利。夢中尚未夢‧何能生利他。」故於下士之時‧思惟自於諸惡趣中‧受苦道理。及於中\n"+
		"士之時‧思惟善趣‧無寂靜樂‧唯苦道理。次於親屬諸有情所‧比度自心‧而善修習‧即是發生\n"+
		"慈悲之因。菩提之心從此發生。故修共同中下心者‧即是生起真菩提心所有方便‧非是引"
		,
		/*===========================第 70 頁===========================*/
		"導令趣餘途。如是又於彼二時中‧思惟皈依及業果等‧多門勵力‧集福淨罪‧如其所應‧即菩\n"+
		"提心之前行‧修治相續之方便‧七支行願及皈依等。故應了知此等即是發心方便。此中下\n"+
		"中法類‧即是發無上菩提心支分之道理‧尊重亦當善為曉喻‧弟子於此應獲定解。每次修\n"+
		"時當念此義‧修菩提心發生支分‧極應愛重。若不爾者‧則此諸道與上士道別別無關。乃至\n"+
		"未至實上士道‧於菩提心未得定解‧而成此心發生障礙‧或於此間失大利義‧故於此事應\n"+
		"殷重修。如是修習中下之道及善修習‧如上士時所說道已‧於相續中‧隨力令生真菩提心。\n"+
		"次為此心極堅固故‧應以不共皈依為先而受願軌。由願儀軌正受持已‧於諸學處應勵力\n"+
		"學。次應多修欲學之心‧謂欲學習六度四攝菩薩行等。若由至心起欲學已‧定受行心清淨\n"+
		"律儀。次應捨命莫令根本罪犯染著。餘中下纏及諸惡作‧亦應勵力莫令有染‧設若有犯‧亦\n"+
		"應由於如所宣說‧出犯門中‧善為淨治。次應總學六到彼岸‧特為令心於善所緣‧堪能隨欲\n"+
		"而安住故‧應善學習止體靜慮。道炬論說‧為發通故‧修奢摩他者‧僅是一例‧覺於餘處亦\n"+
		"說為發毘缽舍那‧故為生觀亦應修止。\n"+
		"　　次為斷執二我縛故‧以見決定無我空義。次應將護無謬修法‧成辦慧體毘缽舍那。如"
		,
		/*===========================第 71 頁===========================*/
		"道炬釋說‧除修止觀‧學習律儀學處以下‧是為戒學。奢摩他者‧是三摩地‧或為心學。毘缽舍\n"+
		"那‧是為慧學。復次奢摩他下是方便分‧福德資糧‧依世俗諦所有之道‧廣大道次。發起三種\n"+
		"殊勝慧者‧是般若分‧智慧資糧‧依勝義諦甚深道次。應於此等次第決定‧數量決定‧智慧方\n"+
		"便僅以一分不成菩提‧發大定解。\n"+
		"　　由如是理‧欲過諸佛功德大海‧佛子鵝王是由雙展‧廣大方便‧圓滿無缺‧世俗諦翅‧善\n"+
		"達二種‧無我真實勝義諦翅‧乃能超過。非是僅取道中一分‧如折翅鳥所能飛越。如入中論\n"+
		"云‧「真俗白廣翅圓滿‧鵝王列眾生鵝前‧承善風力而超過‧諸佛德海第一岸。」\n"+
		"　　如是以諸共道淨相續已‧決定應須趣入密咒。以若入密速能圓滿二資糧故。設若過\n"+
		"此非所能堪‧或由種性功能羸劣‧不樂趣者‧則應唯將此道次第‧漸次增廣。\n"+
		"　　若入密咒者‧則依知識法勝出前者‧依咒所說應當隨行‧以總一切乘‧特密咒中‧珍重\n"+
		"宣說故。次以根源清淨續部‧所出灌頂成熟身心。爾時所得一切三昧耶及律儀‧應寧捨命\n"+
		"如理護持。特若受其根本罪染‧雖可重受‧然相續已壞‧功德難生‧故應勵力‧莫令根本罪犯\n"+
		"染著。又應勵防諸支罪染‧設受染者‧亦應悔除‧防止令淨‧以三昧耶及諸律儀‧是道本故。"
		,
		/*===========================第 72 頁===========================*/
		"　　次於續部‧若是下部有相瑜伽‧若是上部生次瑜伽‧隨其一種善導修學。此堅固已‧若\n"+
		"是下部無相瑜伽‧或是上部滿次瑜伽‧隨於其一應善修學。\n"+
		"　　道炬論說‧如是建立道之正體‧故道次第亦如是導‧大覺師‧於餘論中亦嘗宣說。攝\n"+
		"修大乘道方便論云‧「欲得不思議‧勝無上菩提‧賴修菩提故‧樂修為心要。已得極難得‧圓\n"+
		"滿暇滿身‧後極難獲故‧勤修令不空。」又云‧「如犯從牢獄‧若有能逃時‧與餘事非等‧速從\n"+
		"彼處逃。此大生死海‧若有能度時‧與餘事非等‧應當出有宅。」又云‧「皈依增上戒‧及住願\n"+
		"根本‧應受菩薩律‧漸隨力如理‧修行六度等‧菩薩一切行。」又云‧「方便慧心要‧修止觀瑜\n"+
		"伽。」定資糧品亦云‧「先固悲力生‧正等菩提心‧不著有報樂‧背棄諸攝持。圓滿信等財‧敬\n"+
		"師等於佛‧具師教律儀‧善勤於修習。瓶密諸灌頂‧由尊重恩得‧行者身語心‧清淨成就器。由\n"+
		"圓滿定支‧所生資糧故‧速當得成就‧是住密咒規。」\n"+
		"　　第二所為義者‧若中下士諸法品類‧悉是上士前加行者‧作為上士道次足矣‧何須別\n"+
		"立共中下士道次名耶。別分三士而引導者‧有二大義‧一為摧伏增上我慢‧謂尚未起共同\n"+
		"中下士夫之心‧即便自許我是大士。二為廣益上中下心‧廣饒益之理者‧謂上二士夫‧亦須"
		,
		/*===========================第 73 頁===========================*/
		"希求得增上生及其解脫。故於所導上中二類補特伽羅‧教令修習此二意樂‧無有過失‧起\n"+
		"功能故。若是下品補特伽羅‧雖令修上‧既不能發上品意樂‧又棄下品俱無成故。\n"+
		"　　復次為具上善根者‧開示共道‧令其修習‧此諸功德‧或先已生‧若先未生‧速當生起。若\n"+
		"生下下‧可導上上‧故於自道非為迂緩。須以次第引導心者‧陀羅尼自在王請問經中‧以黠\n"+
		"慧寶師漸磨摩尼法喻合說‧恐文太繁‧故不多錄。\n"+
		"　　龍猛依怙亦云‧「先增上生法‧決定勝後起‧以得增上生‧漸得決定勝。」此說增上生\n"+
		"道及決定勝道‧次第引導。聖者無著亦云‧「又諸菩薩為令漸次集善品故‧於諸有情‧先審\n"+
		"觀察。知劣慧者‧為說淺法‧隨轉粗近教授教誡。知中慧者‧為說中法‧隨轉處中教授教誡。知\n"+
		"廣慧者‧為說深法‧隨轉幽微教授教誡。是名菩薩於諸有情次第利行。」聖天亦於攝行炬\n"+
		"論‧成立先須修習到彼岸乘意樂‧次趣密咒漸次道理。攝此義云‧「諸初業有情‧轉趣於勝\n"+
		"義‧正等覺說此‧方便如梯級。」四百論中‧亦說道次極為決定‧「先遮止非福‧中間破除我‧\n"+
		"後斷一切見‧若知為善巧。」此說道有決定次第。敬母善巧阿闍黎亦云‧「如淨衣染色‧先\n"+
		"以施等語‧善法動其心‧次令修諸法。」月稱大阿闍黎‧亦引此教為所根據‧成立道之次第"
		,
		/*===========================第 74 頁===========================*/
		"決定。現見於道引導次第‧諸修行者‧極應珍貴‧故於此理‧應當獲得堅固定解。\n"+
		"<b><s>　第二正取心要分三‧<n>一</n>於共下士道次修心‧<n>二</n>於共中士道次修心‧<n>三</n>於上士夫道次修心。　初中\n"+
		"　分三‧<n>一</n>正修下士意樂‧<n>二</n>發此意樂之量‧<n>三</n>除遣此中邪執。　初中分二‧<n>一</n>發生希求後世之心‧<n>二</n>依\n"+
		"　止後世安樂方便。　初中分二‧<n>一</n>思惟此世不能久住憶念必死‧<n>二</n>思惟後世當生何趣二趣苦\n"+
		"　樂。　初中分四‧<n>一</n>未修念死所有過患‧<n>二</n>修習勝利‧<n>三</n>當發何等念死之心‧<n>四</n>修念死理。　　今初</s></b>\n"+
		"　　如是於其有暇身時‧取心藏中有四顛倒‧於諸無常執為常倒‧即是第一損害之門。其\n"+
		"中有二‧謂粗及細‧於其粗劣死無常中‧分別不死是損害門。此復僅念今後邊際‧定當有死‧\n"+
		"雖皆共有‧然日日中‧乃至臨終皆起是念‧今日不死‧今亦不死‧其心終執不死方面。若不作\n"+
		"意此執對治‧被如是心之所蓋覆‧便起久住現法之心。於此時中‧謂須如是如是眾事‧數數\n"+
		"思惟‧唯於現法‧除苦引樂‧所有方便‧不生觀察後世‧解脫‧一切智等大義之心‧故不令起趣\n"+
		"法之意。設有時趣聞思修等‧然亦唯為現法利故‧令所修善勢力微弱。復與惡行罪犯相屬\n"+
		"而轉‧故未糅雜惡趣因者‧極為希貴。\n"+
		"　　設能緣慮後世而修‧然不能遮後時漸修延緩懈怠‧遂以睡眠昏沈雜言飲食等事‧散"
		,
		/*===========================第 75 頁===========================*/
		"耗時日‧故不能發廣大精勤‧如理修行。\n"+
		"　　如是由希身命久住所欺誑故‧遂於利養恭敬等上‧起猛利貪。於此障礙‧或疑作礙‧起\n"+
		"猛利瞋。於彼過患蒙昧愚癡。由利等故‧引起猛利我慢嫉等諸大煩惱及隨煩惱如瀑流轉。\n"+
		"復由此故‧於日日中漸令增長‧諸有勝勢‧能引惡趣猛利大苦‧身語意攝十種惡行‧無間隨\n"+
		"近‧謗正法等諸不善業。又令漸棄能治彼等‧善妙宣說甘露正法‧斷增上生及決定勝所有\n"+
		"命根。遭死壞已‧為諸惡業引導‧令赴苦痛粗猛‧炎燒非愛諸惡趣處‧何有過此暴惡之門。四\n"+
		"百論亦云‧「若有三世主‧自死無教者‧彼若安然睡‧豈有暴於此。」入行論亦云‧「須棄一\n"+
		"切走‧我未如是知‧為親非親故‧作種種罪惡。」\n"+
		"　　第二修習之勝利者。謂若真起隨念死心‧譬如決斷今明定死‧則於正法稍知之士‧由\n"+
		"見親屬及財物等不可共往‧多能任運遮彼貪愛‧由施等門樂取堅實。如是若見為求利敬\n"+
		"及名稱等世間法故‧一切劬勞皆如扇揚諸空穀壳‧全無心實‧是欺誑處‧便能遮止諸罪惡\n"+
		"行。由其恆常殷重精進‧修集皈依及淨戒等諸微妙業‧遂於無堅身等諸事取勝堅實。由是\n"+
		"自能昇勝妙位‧亦能於此導諸眾生‧更有何事義大於此。是故經以多喻讚美‧大般涅槃經"
		,
		/*===========================第 76 頁===========================*/
		"云‧「一切耕種之中‧秋實第一‧一切跡中‧象跡第一‧一切想中‧無常死想是為第一‧由是諸\n"+
		"想能除三界一切貪欲‧無明‧我慢。」如是又以是能頓摧一切煩惱惡行大椎‧是能轉趣頓\n"+
		"辦一切勝妙大門‧如是等喻而為讚美。集法句中亦云‧「應達此身如瓦器‧如是知法等陽\n"+
		"燄‧魔花刄劍於此折‧能趣死王無見位。」又云‧「如見衰老及病苦‧並見心離而死亡‧勇士\n"+
		"能斷如牢家‧世庸豈能遠離欲。」總之能修士夫義時‧唯是得此殊勝暇身期中‧我等多是\n"+
		"久住惡趣‧設有少時暫來善趣‧亦多生於無暇之處‧其中難獲修法之時。縱得一次堪修之\n"+
		"身‧然未如理修正法者‧是由遇此且不死心‧故心執取不死方面‧是為一切衰損之門。其能\n"+
		"治此憶念死者‧即是一切圓滿之門。故不應執‧此是無餘深法可修習者之所修持‧及不應\n"+
		"執‧雖是應修然是最初僅應略修‧非是堪為恆所修持。應於初中後三須此之理‧由其至心\n"+
		"發起定解而正修習。\n"+
		"　　第三當發何等念死心者。若由堅著‧諸親屬等增上力故‧恐與彼離起怖畏者‧乃是於\n"+
		"道全未修習畏死之理‧此中非是令發彼心。若爾者何‧謂由惑業增上所受一切之身‧皆定\n"+
		"不能超出於死。故於彼事雖生怖懼‧暫無能遮。為後當來世間義故‧未能滅除諸惡趣因‧未"
		,
		/*===========================第 77 頁===========================*/
		"能成辦增上生因‧決定勝因‧即便沒亡而應恐怖。若於此事思惟怖畏‧則於此等有可修作‧\n"+
		"能令臨終無所怖畏。若未成辦如是諸義‧總之不能脫離生死‧特當墮落諸惡趣故‧深生畏\n"+
		"懼‧臨終悔惱。本生論云‧「雖勵不能住‧何事不可醫‧能作諸怖畏‧其中有何益。如是若觀世\n"+
		"法性‧諸人作罪當憂悔‧又未善作諸妙業‧恐於後法起諸苦‧臨終畏懼而蒙昧。若何能令我\n"+
		"意悔‧我未憶作如是事‧復善修作白淨業‧安住正法誰畏死。」四百論中亦云‧「思念我必\n"+
		"死‧若誰有決定‧此棄怖畏故‧豈畏於死主。」故若數數思惟無常‧念身受用定當速離‧則能\n"+
		"遮遣‧希望不離彼等愛著。由離此等所引憂惱增上力故‧怖畏死沒皆不得生。\n"+
		"<b><s>　第四如何修念死者。謂應由於三種根本‧九種因相‧三種決斷門中修習。此中有三‧<n>一</n>思決定\n"+
		"　死‧<n>二</n>思惟死無定期‧<n>三</n>思惟死時除法而外‧餘皆無益。</s></b>\n"+
		"　　初中分三。思惟死主決定當來‧此復無緣能令卻退者。謂任受生何等之身‧定皆有死‧\n"+
		"無常集云‧「若佛若獨覺‧若諸佛聲聞‧尚須捨此身‧何況諸庸夫。」任住何境‧其死定至者‧\n"+
		"即彼中云‧「住於何處死不入‧如是方所定非有‧空中非有海中無‧亦非可住諸山間。」前\n"+
		"後時中諸有情類‧終為死摧等無差別‧即如彼云‧「盡其已生及當生‧悉捨此身而他往‧智"
		,
		/*===========================第 78 頁===========================*/
		"者達此悉滅壞‧當住正法決定行。」於其死主逃不能脫‧非以咒等而能退止‧如教授勝光\n"+
		"大王經云‧「譬如若有四大山王‧堅硬隱固成就堅實‧不壞不裂無諸隕損‧至極堅強純一\n"+
		"實密。觸天磨地從四方來‧研磨一切草木本幹及諸枝葉‧並研一切有情有命諸有生者‧非\n"+
		"是速走易得逃脫‧或以力退‧或以財退‧或以諸物及咒藥等易於退卻。大王‧如是此四極大\n"+
		"怖畏來時‧亦非於此速走能逃‧或以力退‧或以財退‧或以諸物及咒藥等易於退卻。何等為\n"+
		"四‧謂老病死衰。大王‧老壞強壯‧病壞無疾‧衰壞一切圓滿豐饒‧死壞命根。從此等中‧非是速\n"+
		"走易得逃脫‧或以力退或以財退‧或以諸物及咒藥等易於靜息。」迦摩巴云‧「現須畏死‧\n"+
		"臨終則須無所恐懼。我等反此‧現在無畏‧至臨終時‧用爪抓胸。」\n"+
		"　　思惟壽無可添‧無間有減者。如入胎經云‧「若於現在善能守護‧長至百年或暫存\n"+
		"活。」極久邊際僅有爾許‧縱能至彼‧然其中間壽盡極速。謂月盡其年‧日盡其月‧其日亦為\n"+
		"晝夜盡銷。此等復為上午等時而漸銷盡‧故其壽命總量短少。此復現見多已先盡‧所餘壽\n"+
		"量‧雖剎那許亦無可添‧然其損減‧則遍晝夜無間有故。入行論云‧「晝夜無暫停‧此壽恆損\n"+
		"減‧亦無餘可添‧我何能不死。」此復應從眾多喻門‧而正思惟。謂如織布‧雖織一次僅去一"
		,
		/*===========================第 79 頁===========================*/
		"縷‧然能速疾完畢所織。為宰殺故‧如牽所殺羊等步步移時‧漸近於死。又如江河猛急奔流‧\n"+
		"或如險岩垂注瀑布‧如是壽量‧亦當速盡。又如牧童持杖驅逐‧令諸畜類‧無自主力而赴其\n"+
		"所‧其老病等‧亦令無自在引至死前。此諸道理‧應由多門而勤修習。如集法句云‧「譬如舒\n"+
		"經織‧隨所入緯線‧速窮緯邊際‧諸人命亦爾。如諸定被殺‧隨其步步行‧速至殺者前‧諸人命\n"+
		"亦爾。猶如瀑流水‧流去無能返‧如是人壽去‧亦定不回還。艱勞及短促‧此復有諸苦‧唯速疾\n"+
		"壞滅‧如以杖畫水。如牧執杖驅‧諸畜還其處‧如是以老病‧催人到死前。」如傳說大覺行\n"+
		"至水岸‧謂「水淅淅流‧此於修無常極為便利。」說已而修。大遊戲經亦以多喻宣說‧「三\n"+
		"有無常如秋雲‧眾生生死等觀戲‧眾生壽行如空電‧猶崖瀑布速疾行。」又如說云‧「若有\n"+
		"略能向內思者‧一切外物‧無一不為顯示無常。」故於眾事皆應例思‧若數數思能引定解‧\n"+
		"若略思惟‧便言不生‧實無利益。如迦摩巴云‧「說思已未生‧汝何時思‧晝日散逸‧夜則昏睡‧\n"+
		"莫說妄語。」非但壽邊為死所壞‧而趣他世‧即於中間行住臥三‧隨作何事‧全無不減壽量\n"+
		"之時。首從入胎‧即無剎那而能安住‧唯是趣向他世而行‧故於中間生存之際‧悉被老病使\n"+
		"者所牽‧唯為死故導令前行。故不應計於存活際‧不趣後世安住歡喜‧譬如從諸高峰墮時‧"
		,
		/*===========================第 80 頁===========================*/
		"未至地前空墜之際‧不應歡樂。此亦如四百頌釋引經說云‧「人中勇識如初夜‧安住世間\n"+
		"胎胞中‧彼從此後日日中‧全無暫息趣死前。」破四倒論亦云‧「如從險峰墮地壞‧豈於此\n"+
		"空受安樂‧從生為死常奔馳‧有情於中豈得樂。」此等是顯決定速死。\n"+
		"　　思於生時亦無閒暇修行妙法‧決定死者。謂縱能至如前所說‧爾許長邊‧然亦不應執\n"+
		"為有暇。謂無義中先已耗去眾多壽量‧於所餘存‧亦由睡眠分半度遷‧又因散亂徒銷非一‧\n"+
		"少壯遷謝至衰耄時‧身心力退‧雖欲行法‧然亦無有勤修之力‧故能修法時實為少許。入胎\n"+
		"經云‧「此中半數為睡覆蓋‧十年頑稚‧念年衰老‧愁嘆苦憂及諸恚惱亦能斷滅‧從身所生\n"+
		"多百疾病‧其類非一亦能斷滅。」破四倒論亦云‧「此諸人壽極久僅百歲‧此復初頑後老\n"+
		"徒銷耗‧睡病等摧令無可修時‧住樂人中眾生壽餘幾。」伽喀巴亦云‧「六十年中‧除去身\n"+
		"腹睡眠疾病‧餘能修法‧尚無五載。」\n"+
		"　　如是現法一切圓滿‧於臨死時唯成念境‧如醒覺後‧念一夢中所受安樂。若死怨敵定\n"+
		"當到來‧無能遮止‧何故愛著現法欺誑。如是思已‧多起誓願‧決斷必須修行正法。如本生論\n"+
		"所說而思‧「嗟呼世間惑‧匪堅不可喜‧此姑姆達會‧亦當成念境。眾生住於如是性‧眾生無"
		,
		/*===========================第 81 頁===========================*/
		"畏極希有‧死主自斷一切道‧全無怖懼歡樂行。現有老病死作害‧大勢怨敵無能遮‧定赴他\n"+
		"世苦惱處‧誰有心知思愛此。」迦尼迦書中亦云‧「無悲愍死主‧無義殺士夫‧現前來殺害‧\n"+
		"智誰放逸行。故此極勇暴‧猛箭無錯謬‧乃至未射放‧當勤修自利。」\n"+
		"　　第二思惟死無定期者。謂今日已後‧百年以前‧其死已定。然此中間‧何日而來‧亦無定\n"+
		"期‧即如今日‧謂死不死‧俱不決定。然心應執死亡方面‧須發今日定死之心。以念今日決定\n"+
		"不死‧或多分不死‧其心則執不死方面‧便專籌備久住現法‧不能籌備後世之事。於此中間\n"+
		"為死所執‧須帶憂悔而沒亡故。若日日中籌備死事‧則多成辦他世義利。縱不即死‧造作此\n"+
		"事亦為善哉。若即死者‧則此尤其是所必須。譬如自有能作猛利損害大敵‧從此時期至彼\n"+
		"時期‧知其必至‧然未了知何日到來‧須日日中作其防慎。\n"+
		"　　若日日中‧能起是念‧今日必死‧下至能念多分是死‧則能修作‧所當趣赴後世義利‧不\n"+
		"更籌備住現世間。若未生起如此意樂‧於現世間見能久住‧便籌備此‧而不修作後世義利。\n"+
		"譬如若念久住一處‧則計設備住彼所須‧若念不住當他往者‧則當備作所趣之事。故日日\n"+
		"中‧定須發起必死之心。"
		,
		/*===========================第 82 頁===========================*/
		"　　此中分三。思贍部洲壽無定者。總之俱盧壽量決定‧諸餘處者‧各各於自能住壽量雖\n"+
		"無決定‧然亦多數能得定限。贍部洲壽極無定準‧劫初壽數‧經無量年‧今後須以滿十歲為\n"+
		"壽長際‧即於現在老幼中年‧於何時死‧皆無定故。如是亦如俱舍論云‧「此中壽無定‧末十\n"+
		"初無量。」集法句云‧「上日見多人‧下日有不見‧下日多見者‧上日有不見。」又云‧「若眾\n"+
		"多男女‧強壯亦歿亡‧何能保此人‧尚幼能定活。一類胎中死‧如是有產地‧又有始能爬‧亦有\n"+
		"能行走。有老有幼稚‧亦有中年人‧漸次當趣沒‧猶如墮熟果。」應當作意所見所聞‧若諸尊\n"+
		"重或友伴等‧壽未究竟‧忽由內外死緣‧未滿心願而死。念我亦定是如是法‧應數思惟‧應令\n"+
		"發生必死之心。\n"+
		"　　思惟死緣極多‧活緣少者。謂於此命有多違害。謂諸有心及諸無心‧若諸魔屬‧人非人\n"+
		"等眾多違害及旁生類損此身命‧亦有多種。彼等如何違害之理‧如是內中所有諸病‧及外\n"+
		"大種違損之理‧皆應詳思。復次自身由四大種成‧彼等亦復互相違害‧諸大種界若不平等‧\n"+
		"有所增減能發諸病‧而奪命根‧此諸違害‧是與自體‧俱生而有‧故於身命無可安保。如是亦\n"+
		"如大涅槃經云‧「言死想者‧謂此命根‧恆有眾多怨敵圍繞‧剎那剎那漸令衰退‧全無一事"
		,
		/*===========================第 83 頁===========================*/
		"能使增長。」寶鬘論亦云‧「安住死緣中‧如燈處風內。」親友書亦云‧「若其壽命多損害‧\n"+
		"較風激泡尤無常‧出息入息能從睡‧有暇醒覺最希奇。」四百論亦云‧「無能諸大種‧生起\n"+
		"說名身‧於諸違云樂‧一切非應理。」現是五濁極濃厚時‧修集能感長壽久住大勢妙業‧極\n"+
		"其稀寡。飲食等藥‧勢力微劣‧故皆少有能治病力。諸所受用安然消後‧能長身中諸大種分\n"+
		"勢用虧減‧故難消化‧縱能消已亦無大益。資糧寡集‧惡行尤重。念誦等事‧勢力微劣‧故延壽\n"+
		"等‧極屬難事。又諸活緣‧亦無不能為死緣者。為不死故‧求諸飲食房舍伴等‧此復由其受用\n"+
		"飲食‧太多太少及不相宜‧房舍倒塌‧親友欺侮‧是等門中而成死緣。故實不見有諸活緣‧非\n"+
		"死緣者。\n"+
		"　　復次存活即是趣向於死沒故。活緣雖多‧然無可憑。寶鬘論云‧「死緣極眾多‧活緣唯\n"+
		"少許‧此等亦成死‧故當常修法。」\n"+
		"　　思惟其身極微弱‧故死無定期者。身如水沫‧至極微劣‧無須大損‧即如名曰芒刺所傷‧\n"+
		"且能壞命。故由一切死緣違害‧是極易事。親友書云‧「七日燃燒諸有身‧大地須彌及大海‧\n"+
		"尚無灰塵得餘留‧況諸至極微弱人。」如是思後‧不見死主何時決定壞其身命‧莫謂有暇‧"
		,
		/*===========================第 84 頁===========================*/
		"應多立誓‧決從現在而修正法。如迦尼迦書云‧「死主悉無親‧忽爾而降臨‧莫想明後行‧應\n"+
		"速修正法。此明後作此‧是說非賢人‧汝當何日無‧其明日定有。」瑜伽自在吉祥勝逝友慶\n"+
		"喜亦云‧「國主所借身‧無病衰樂住‧爾時取堅實‧病死衰無畏‧病老衰等時‧雖念有何益。」\n"+
		"三根本中極重要者‧厥由思惟死無定期‧能變其心‧故應勵修。\n"+
		"　　第三思惟死時除法而外‧餘皆無益之三者。如是若見須往他世‧爾時親友極大憐愛\n"+
		"而相圍繞‧然無一人是可隨去。盡其所有悅意寶聚‧然無塵許可得持往。俱生骨肉尚須棄\n"+
		"捨‧況諸餘法。是故現法一切圓滿‧皆棄捨我。我亦決定棄捨彼等而赴他世。復應思惟‧今日\n"+
		"或死。又應思惟‧爾時唯法是依是怙‧是示究竟所有道理。迦尼迦書云‧「能生諸異熟‧先業\n"+
		"棄汝已‧與新業相係‧死主引去時‧當知除善惡‧餘眾生皆返‧無一隨汝去‧故應修妙行。」吉\n"+
		"祥勝逝友亦云‧「天王任何富‧死赴他世時‧如敵劫於野‧獨無子無妃‧無衣無知友‧無國無\n"+
		"王位‧雖有無量軍‧無見無所聞‧下至無一人‧顧戀而隨往‧總爾時尚無‧名諱況餘事。」\n"+
		"　　如是思惟有暇義大而實難得。及雖難得‧然極易壞‧念其死亡。若不勤修後世以往畢\n"+
		"竟安樂‧僅於命存引樂除苦者‧則諸旁生有大勢力‧尤過於人‧故須超勝彼等之行。若不爾"
		,
		/*===========================第 85 頁===========================*/
		"者‧雖得善趣‧仍同未得。如入行論云‧「畜亦不難辦‧為是小利故‧業逼者壞此‧難得妙暇\n"+
		"滿。」以是此心縱覺難生‧然是道基‧故應勵力。博朵瓦云‧「除我光榮者‧即是修習無常。由\n"+
		"已了知‧定當除去親屬資具等‧現世一切光榮‧獨自無伴而往他世‧除法而外皆無所為‧不\n"+
		"住現法始得生起‧乃至心中未能生此‧是乃遮阻一切法道。」鐸巴亦云‧「若能兼修積集\n"+
		"資糧‧淨治罪障‧啟禱本尊及諸尊長‧並發刻勤殷重思惟‧雖覺百年亦不能生‧然諸無常不\n"+
		"安住故‧略覺艱難即得生起。」於迦瑪巴請求另易所緣境時‧重述前法。請其後者‧則云後\n"+
		"者全未能至。\n"+
		"　　如是自心若能堪任‧應如前說而正修習。若不堪者‧則隨其所稱‧取三根本九種因相‧\n"+
		"觀現法中所有諸事‧猶如臨殺飾以莊嚴‧應當乃至意未厭離‧數數修習。若經論中何處有\n"+
		"說‧親近知識暇滿無常諸法品類‧皆應了知‧是彼彼時所有行持‧取而修習‧乃能速得諸佛\n"+
		"密意。餘處亦當如是了知。\n"+
		"　　第二思惟後世當生何趣‧二趣苦樂者。如是決定速死沒故‧於現法中無暇久居‧然死\n"+
		"而後亦非斷無‧仍須受生。此復唯除二趣之外無餘生處‧謂生善趣或是惡趣。於彼中生‧非"
		,
		/*===========================第 86 頁===========================*/
		"自自在‧以是諸業他自在故‧如黑白業牽引而生。如是我若生惡趣者‧當為何等‧故應思惟\n"+
		"諸惡趣苦。如龍猛依怙云‧「日日恆應念‧極寒熱地獄‧亦應念飢渴‧憔悴諸餓鬼。應觀念極\n"+
		"多‧愚苦諸旁生‧斷彼因行善。贍部洲人身‧難得今得時‧勵斷惡趣因。」此中所修生死總苦‧\n"+
		"惡趣別苦‧至極切要。謂若自思墮苦海理‧意生厭離‧能息傲慢。由見苦是不善果故‧於諸惡\n"+
		"罪極生羞恥。不樂眾苦故‧而樂安樂‧由見安樂是善果故‧於修善法深生歡喜。由量自心而\n"+
		"悲愍他。由厭生死希求解脫‧由畏眾苦‧發起猛利真皈依等‧故是能攝眾多修要大嗢柁南。\n"+
		"如是亦如入行論云‧「無苦無出離‧故心汝堅忍。」又云‧「復次苦功德‧厭離除憍傲‧悲愍\n"+
		"生死者‧羞惡樂善行。」又云‧「我由畏怖故‧將自奉普賢。」此諸苦德‧入行論中雖依自身\n"+
		"已有之苦增上而說‧然其當受眾苦亦爾。\n"+
		"<b><s>　以是因緣‧思惡趣苦。其中分三‧<n>一</n>思惟地獄所有眾苦‧<n>二</n>旁生所有眾苦‧<n>三</n>餓鬼所有眾苦。　初\n"+
		"　中分四‧<n>一</n>大有情地獄‧<n>二</n>近邊地獄‧<n>三</n>寒冷地獄‧<n>四</n>獨一地獄。　　今初</s></b>\n"+
		"　　謂從此過三萬二千踰繕那‧下有等活地獄。從此漸隔四千四千踰繕那下‧而有餘七。\n"+
		"如是八中‧初等活者。謂彼有情‧多共聚集‧業增上故‧種種苦具次第而起‧互相殘害‧悶絕躃"
		,
		/*===========================第 87 頁===========================*/
		"地。次虛空中‧發如是聲‧汝諸有情可還等活。次復欻起‧如前殘害‧由是當受無量眾苦。二黑\n"+
		"繩者。其中所生諸有情類‧謂多當受如是眾苦‧諸守獄卒‧以黑繩拼‧或為四方‧或為八方‧或\n"+
		"為種種非一紋畫‧如其所拼‧如是以刀‧或斫或割。三眾合者。謂彼有情‧或時輾轉而共集會‧\n"+
		"爾時獄卒驅逐令入‧如二羺頭鐵山之間‧從此無間兩山合迫‧爾時從其一切門中‧血流涌\n"+
		"注。如是如諸羊馬象獅及如虎頭‧合迫亦爾。又集會時‧驅逐令入極大鐵槽‧壓迫全身‧如壓\n"+
		"甘蔗。又集會時‧有大鐵山從上而墮‧於鐵地基若斫若剖‧若擣若裂。如是等時‧血流涌注。四\n"+
		"號叫者。謂彼有情‧尋求宅舍‧即便趣入大鐵室中‧始纔入已‧火便熾起‧由是燃燒。五大號叫\n"+
		"者。多與前同‧其差別者‧謂其鐵室層匝有二。六燒熱者。謂彼有情為諸獄卒‧置於眾多踰繕\n"+
		"那量‧極熱燒燃‧大鐵𨫼中‧輾轉燒煿‧猶如炙魚。熾燃鐵丳‧從下貫入‧徹頂而出‧從口二眼‧二\n"+
		"鼻二耳‧一切毛孔‧猛燄熾生。又置熾燃大鐵地上‧或仰或覆‧以極熾燃炎熱鐵椎‧或打或築。\n"+
		"七極熱者。謂以三尖大熱鐵丳‧從下貫入‧左右二鋒‧徹左右髆‧中從頂出。由是因緣從口等\n"+
		"門‧猛燄熾生。又以熾燃炎熱鐵鍱遍裹其身。又復倒擲‧熾燃涌沸彌滿灰水大鐵鑊中‧其湯\n"+
		"涌沸‧上下漂轉。若時銷爛皮肉血脈‧唯餘骨𩩓爾時漉出‧置鐵地上。待其皮肉血脈生已‧還"
		,
		/*===========================第 88 頁===========================*/
		"擲鑊中‧餘如燒熱。八無間者。謂自東方多百非一踰繕那地‧猛火熾然‧即從其中騰燄而來‧\n"+
		"由此漸壞‧彼諸有情‧皮肉筋骨‧直徹其髓‧遍身一切猛燄熾然‧燒如脂燭。所餘三方‧悉皆如\n"+
		"是。四方火來‧於彼合雜‧所受苦痛‧無有間隙‧唯因號哭叫苦聲音‧知是有情。又於盛滿熾然\n"+
		"鐵炭大鐵箕中‧而為揃簸。又命登下熱鐵地上‧諸大鐵山。又從口中拔出其舌‧以百鐵釘‧釘\n"+
		"而張之‧令無皺襵‧如張牛皮。又置鐵地令其仰臥‧以大鐵鉗‧鉗口令開‧熾然鐵丸‧置其口中。\n"+
		"又以烊銅而灌其口‧燒口及喉‧徹諸腑臟‧從下流出。所餘諸苦‧如極燒熱。此但略說粗顯苦\n"+
		"具‧非餘種種眾多苦具而不可得‧如是所住住處之量及諸苦等‧是如本地分中所說錄出。\n"+
		"　　此諸大苦‧要經幾時而領受者‧如親友書云‧「如是諸苦極粗暴‧雖受經百俱胝年‧乃\n"+
		"至不善未盡出‧爾時與命終不離。」謂其乃至能受業力未盡以來‧爾時定須受彼諸苦。此\n"+
		"復人間五十歲‧是四天王眾天一日一夜‧以此三十為一月‧十二月為一歲‧此五百歲是四\n"+
		"天王眾天壽量。總此一切為一日夜‧三十日夜為一月‧此十二月為一歲‧此五百歲‧是為等\n"+
		"活地獄壽量。如是人間百歲‧二百‧四百‧八百‧千六百歲‧如其次第是三十三‧乃至他化自在\n"+
		"諸天‧一日一夜。其壽量者‧謂各自天千歲‧二千‧四千‧八千‧萬六千歲。如此次第‧是從黑繩‧乃"
		,
		/*===========================第 89 頁===========================*/
		"至燒熱一日一夜。以各自歲‧從千乃至一萬六千。俱舍論云‧「人中五十歲‧是欲界諸天‧下\n"+
		"者一日夜‧上者俱倍增。」又云‧「等活等六次‧日夜與欲天‧壽等故彼壽‧數與欲天同‧極熱\n"+
		"半無間中劫。」本地分中亦同是義。\n"+
		"　　近邊者。謂彼八種大那落迦‧一一各有四牆四門‧其外皆有鐵城圍繞‧其城亦復各有\n"+
		"四門‧一一門外‧有餘四。四有情地獄。謂煨坑。屍糞臭泥‧或穢糞泥‧惡臭如屍。利刀道等。無極\n"+
		"大河。其中初者‧謂有煻煨‧沒齊膝許‧彼諸有情‧為求舍宅‧遊行至此‧下足之時‧皮肉及血‧並\n"+
		"皆銷爛‧舉足之時‧皮等還生。第二者‧謂即與此無間相鄰有穢糞坑‧臭如死屍‧彼諸有情‧為\n"+
		"求舍宅‧遊行至此‧顛陷其中‧首足俱沒。其糞泥內‧多有諸蟲‧名曰利㭰穿皮入肉‧斷筋破骨‧\n"+
		"取髓而食。第三者‧謂與此泥無間相鄰‧有多利刀‧仰刃為路‧彼諸有情‧為求舍宅‧遊行至此。\n"+
		"下足之時‧皮肉筋血‧悉皆刺截‧舉足之時‧復生如故。與此無間‧有劍葉林‧彼諸有情‧為求舍\n"+
		"宅‧遊行至此。遂趣其陰‧纔坐其下‧眾多葉劍‧從樹而落‧斫截其身‧一切支節。是諸有情‧便即\n"+
		"躃地‧來諸釐狗‧摣掣脊𦛗‧而噉食之。從此無間‧有鐵設拉末梨林‧彼諸有情‧為求舍宅‧遊行\n"+
		"至此‧遂登其上‧當登之時‧諸刺向下‧欲下之時‧復迴向上‧由是貫刺一切支節。次有大烏名"
		,
		/*===========================第 90 頁===========================*/
		"曰鐵㭰‧上彼頭頂‧或上其膊‧探啄眼睛而噉食之。是等同是刀劍苦害‧故合為一。第四者‧設\n"+
		"拉末梨‧無間相鄰‧有廣大河‧名曰無極‧沸熱灰水‧彌滿其中。彼諸有情‧為求舍宅‧墮中煎煮‧\n"+
		"上下漂沒‧如以豆等置大鑊中‧以水彌滿‧猛火煎煮。其河兩岸有諸獄卒‧手執杖索‧及以大\n"+
		"網行列而住‧遮不令出。或以索羂‧或以網漉‧仰置熾然大鐵地上‧問何所欲‧彼若答曰‧「我\n"+
		"等今者竟無覺知‧然甚飢渴。」便以極熱燒燃鐵丸置其口中‧及以烊銅而灌其口。此等皆\n"+
		"如本地分說‧其中復說近邊‧獨一‧二中壽量‧無有決定。然其能感如是苦業‧乃至未盡‧爾時\n"+
		"即當於如是處‧恆受諸苦。\n"+
		"　　八寒地獄者。謂從八大有情地獄‧橫去一萬踰繕那外‧是有彼處。即從此下三萬二千\n"+
		"踰繕那處有寒皰獄‧次下各隔二千二千踰繕那處‧有餘七焉。其中皰者‧謂遭廣大寒觸所\n"+
		"觸‧一切身分悉皆卷縮‧猶如瘡皰。皰裂之中‧所有差別‧謂瘡卷皺‧如泡潰爛。𠿒哳詀。郝郝凡‧\n"+
		"虎虎凡者‧是以叫苦聲音差別‧而立其名。裂如青蓮者‧謂遭廣大寒觸所觸‧其色青瘀裂五\n"+
		"或六。裂如紅蓮所有差別‧謂過青已‧變為紅赤‧皮膚分裂‧或十或多。裂如大紅蓮所有差別‧\n"+
		"謂其皮膚‧變極紅赤‧分裂百數‧或更繁多。如是次第‧處所量齊‧及諸苦等‧皆是依於本地分"
		,
		/*===========================第 91 頁===========================*/
		"說。本生論云‧「斷無見者於後世‧當住寒風黑暗中‧由此能銷諸骨節‧誰欲自利而趣彼。」\n"+
		"此說住於黑暗之中。弟子書中亦云‧「無比嚴寒侵骨力‧遍身慄戰而縮屈‧百皰起裂生諸\n"+
		"蟲‧嚼抓脂髓水淋滴。寒迫齒戰毛髮豎‧眼耳喉等悉寒逼‧身心中間極蒙蔽‧住寒地獄苦最\n"+
		"極。」\n"+
		"　　受如是苦經幾時者‧謂乃至未盡如是惡業。此又如本地分云‧「生寒地獄有情壽量‧\n"+
		"當知望於諸大有情地獄有情‧次第相望各近其半。」俱舍釋中引經說云‧「諸比丘‧譬如\n"+
		"此間摩羯陀國‧納八十斛胡蔴大篅‧以諸胡蔴高盛充滿。次若有人經越百歲‧取一胡蔴。諸\n"+
		"比丘‧由是漸次容八十斛胡蔴大篅速當永盡。然我不說生寒皰中諸有情壽而能永盡。諸\n"+
		"比丘‧如二十皰‧如是乃為一皰裂量。廣說乃至‧又諸比丘‧如其二十裂如紅蓮‧如是裂如大\n"+
		"紅蓮量‧其一亦爾。」謂乃至爾許壽量受苦。\n"+
		"　　獨一地獄者。謂於寒熱地獄近邊‧本地分說人間亦有。事阿笈摩亦說住於近大海岸‧\n"+
		"猶如僧護因緣中說。俱舍釋亦云‧「如是十六有情地獄‧是由一切有情共業增上而成。獨\n"+
		"一地獄‧或由眾多或二或一別業而成。此等形相差別非一。處所無定‧若河若山‧若曠野處‧"
		,
		/*===========================第 92 頁===========================*/
		"若所餘處‧若於地下‧悉皆有故。」如是能感於彼等中受生之因‧如下當說‧極近易為‧於日\n"+
		"日中亦集多種。先已集者現有無量‧是故不應安穩而住‧應思此等深生畏怖‧與彼中間‧唯\n"+
		"除隔絕悠悠之息而無餘故。如是亦如入行論云‧「已作地獄業‧何故安穩住。」親友書亦\n"+
		"云‧「諸作惡者唯出息‧未斷之時而間隔‧聞諸地獄無量苦‧如金剛性無所畏。見畫地獄及\n"+
		"聽聞‧憶念讀誦造形相‧尚能引發諸恐怖‧況諸正受猛異熟。」生死苦中‧諸惡趣苦‧極難忍\n"+
		"受‧其中復以地獄諸苦極難堪忍。於一日中‧以三百矛‧無間猛刺‧所有痛苦‧於地獄中‧微苦\n"+
		"少分‧亦莫能比。諸地獄中‧又以無間苦為至極。親友書云‧「如於一切安樂中‧永盡諸愛為\n"+
		"樂主‧如是一切眾苦中‧無間獄苦極粗猛。此間日以三百矛‧極猛貫刺所生苦‧比於地獄輕\n"+
		"微苦‧非喻非能及少分。」能感如是眾苦之因‧唯是自內三門惡行。如是知已‧應盡士夫力\n"+
		"用策勵‧輕微惡行‧莫令染著。即前書云‧「此諸不善果種子‧即身語意諸惡行‧汝應盡力而\n"+
		"策勵‧縱其塵許莫令侵。」\n"+
		"　　思惟旁生苦者。謂旁生中諸羸劣者‧為諸強力之所殺害。又為人天資生之具‧自無自\n"+
		"在‧為他驅馳‧遭其傷殺撻打損惱。本地分說‧與諸人天共同依止‧無別處所。俱舍釋云‧「旁"
		,
		/*===========================第 93 頁===========================*/
		"生謂諸水陸空行。其處根本是謂大海‧餘者皆從大海散出。」親友書亦云‧「旁生趣中遭\n"+
		"殺害‧繫縛打等種種苦‧諸離寂滅淨善者‧互相吞噉極暴惡。有因真珠及毛骨‧由肉皮故而\n"+
		"死亡‧無自在故由他驅‧足手鞭鉤及棒打。」其中初頌顯示總苦‧其第二頌顯示別苦。言打\n"+
		"等中‧等攝驅馳及穿鼻等‧此是依於由人非人作殺害等。互吞噉者‧是約旁生眾同分中‧所\n"+
		"為損害。寂滅淨善者‧謂能證得涅槃善法。遠離此者‧顯極愚蒙‧不堪道器。從足踢使‧至以棒\n"+
		"打‧而為驅使‧五事如次‧謂馬‧水牛‧驢‧象‧牛等。此等是如親友書釋中所說。其餘尚有生於黑\n"+
		"暗及以水中‧老死於彼‧負重疲勞‧耕耘剪毛‧強逼驅使。又以非一‧殺害方便‧苦惱而殺。又受\n"+
		"飢渴‧寒暑逼惱。又由獵士‧多方惱害。應於此等‧常懸畏懼‧思惟眾多苦惱道理‧厭患出離。\n"+
		"　　其壽量者‧俱舍論云‧「旁生長經劫。」謂壽長者‧能達劫量‧短則無定。\n"+
		"<b>菩提道次第廣論卷三終</b>"
		,
		/*===========================第 94 頁===========================*/
		"<b>菩提道次第廣論卷四</b>\n"+
		"　　思惟餓鬼苦者。謂諸習近上品慳者‧生餓鬼中。彼復常與餓渴相應‧皮及血肉悉皆枯\n"+
		"槁‧猶如火炭‧散髮覆面‧口極乾焦‧舌常舐略。此中有三‧於諸飲食有外障者‧謂彼若趣泉海\n"+
		"池沼‧即於其處‧為餘有情持劍槍矛‧遮其泉等不令趣近‧及見其水變為膿血‧自不樂飲。於\n"+
		"諸飲食有內障者‧謂有其口細如針孔‧口或如炬‧或有頸癭‧或腹廣大‧縱得飲食無他障礙‧\n"+
		"然自不能若食若飲。於諸飲食自有障者‧謂有餓鬼名猛燄鬘‧所有一切若飲若食‧悉皆燃\n"+
		"燒。有名食穢‧食糞飲溺‧及有唯能飲食不淨‧生熟臭穢‧有損可厭。或有唯能割食自肉‧不能\n"+
		"受用淨妙飲食。\n"+
		"　　是等處所‧如俱舍釋云‧「諸餓鬼王名為琰魔‧諸鬼本處琰魔王國‧於此贍部洲下過\n"+
		"五百踰繕那而有‧從此輾轉散居餘處。」親友書亦云‧「於餓鬼中須依近‧欲乏所生相續\n"+
		"苦‧無治飢渴寒熱勞‧怖畏所生極暴苦。或有口細如針孔‧腹等山量為飢逼‧下劣捐棄不淨\n"+
		"物‧尚不具足尋求力。有存皮骨裸形體‧如枯枝葉多羅樹‧有於夜分口熾燃‧受用口中燒燃"
		,
		/*===========================第 95 頁===========================*/
		"食。有下種類諸不淨‧膿糞血等亦無得‧面互相衝有受用‧頸癭成熟所生膿。諸餓鬼中於春\n"+
		"季‧月炎冬季日亦寒‧令樹無果諸餓鬼‧略視江河亦當乾。」其中初頌顯示總苦‧所餘諸頌\n"+
		"顯示別苦。勞為食故‧遍處馳求。畏謂由見執劍杵索諸士夫故‧而起畏怖。下劣捐棄‧謂隨意\n"+
		"棄。夜分者‧謂至夜間其口燒燃。口中燒燃者‧謂隨所食皆燒其口。受用謂食。眼如惡毒之所\n"+
		"燃燒‧甘涼泉河‧悉當枯竭。又於一類顯似猛燄‧火炭充滿。又於一類顯為膿河‧種種穢蟲彌\n"+
		"滿流注‧是釋中說。弟子書亦云‧「猛渴遙見無垢河‧欲飲馳趣彼即變‧雜髮青污及爛膿‧臭\n"+
		"泥血糞充滿水。風揚浪灑山清涼‧檀樹青蔭末拉耶‧彼趣猛燄遍燒林‧無量株杌亂雜倒。若\n"+
		"奔畏浪高翻滾‧泡沫充溢大水藏‧彼於此見熱沙霧‧紅風猛亂大曠野。此住其中望雲雨‧雲\n"+
		"降鐵箭具炭煙‧流飛熾炎金剛石‧金色電閃降於身。熱逼雪紛亦炎熱‧寒迫雖火亦令寒‧猛\n"+
		"業成熟所愚蒙‧於此種種皆顛倒。針口無量由旬腹‧苦者雖飲大海水‧未至寬廣咽喉內‧口\n"+
		"毒滴水悉乾銷。」\n"+
		"　　其壽量者。本地分及俱舍論說‧鬼以人間一月為一日‧乘此自年能至五百。親友書云‧\n"+
		"「常無間息受眾苦‧由其惡行堅業索‧繫縛一類有情壽‧五千及萬終不死。」其釋說為一"
		,
		/*===========================第 96 頁===========================*/
		"類餓鬼壽量五千‧或有一類壽量萬歲。本地分說‧三惡趣中身量無定‧由其不善增上力故‧大\n"+
		"小非一。若思如是惡趣眾苦‧應作是念‧現在探手煻煨之中住一晝夜‧或於嚴冬極寒冰窟‧裸\n"+
		"而無衣‧住爾許時‧或數日中不用飲食‧或蚊虻等‧哳咬其身‧尚且難忍‧何況寒熱諸那落迦‧餓\n"+
		"鬼旁生互相吞噉‧是等眾苦‧我何能忍。度現在心‧乃至未能轉變心意‧起大怖畏‧應勤修習。若\n"+
		"雖知解‧或未修習‧或少修習‧悉皆無益。如事阿笈摩說‧慶喜妹家二甥出家‧教其讀誦‧彼讀數\n"+
		"日‧懈怠不讀‧付與目犍連子‧仍如前行。慶喜囑曰‧「應令此二意發厭離。」目犍連子引至晝\n"+
		"日所經處所‧化為有情大那落迦‧彼等聞其斫截等聲‧遂往觀視‧觀見斫截所有眾苦‧又見彼\n"+
		"處有二大鑊‧涌沸騰然。問云‧「此中全無入者耶。」報云‧「阿難陀有二甥‧既出家已‧懈怠廢\n"+
		"時‧死後當生此中。」彼二慌恐‧作如是念‧「設若知者‧現或置入。」次返目犍連子處‧詳白所\n"+
		"見。目犍連子告云‧「二求寂‧若此過患‧若餘過患‧悉是由其懈怠所生‧當發精進。」彼二遂發\n"+
		"精進‧若未食前‧憶念地獄‧則不飲食‧若於食後而憶念者‧即便嘔吐。又引至餘晝經行處‧於餘\n"+
		"一處‧化為諸天。彼由聞其琵琶等聲‧遂往觀視‧見有天宮‧天女充滿而無天子‧問其無有天子\n"+
		"因緣‧答云‧「阿難陀有二甥‧既出家已‧發勤精進‧彼二死後‧當生此中。」彼二歡喜‧還白目犍"
		,
		/*===========================第 97 頁===========================*/
		"連子。教曰‧「二求寂‧若此勝利‧若餘勝利‧悉從勤發精進而生‧應發精進。」次發精進受聖教\n"+
		"時‧見如前引‧真實相應經中宣說‧從諸善趣而生惡趣。問云‧「聖者‧我等若從人天之中‧死後\n"+
		"復生三惡趣耶。」告云‧「二賢首‧乃至未能斷諸煩惱‧爾時於其五趣生死‧如轤轆理‧應須輪\n"+
		"轉。」彼二厭離‧作是白云‧「今後不行諸煩惱行‧惟願為說如是正法。」目犍連子為說法已‧\n"+
		"證阿羅漢。是故能滅懈怠‧能發精進‧勤修正道‧策發其意‧令希解脫及證解脫。其根本因者‧謂\n"+
		"讚修苦。縱有大師現住世間‧於此教授‧更無過上而可宣說。即於此中‧發生下中士夫意樂‧次\n"+
		"第極顯。淨修心量‧亦是乃至未起如是意樂以來‧應須恆常勵力修習。內鄔蘇巴亦云‧「應觀\n"+
		"能生彼中之因‧先作未作‧現作未作‧為念不念當來應作。若先已作‧或現正作‧或念後時而當\n"+
		"作者‧則當生彼。若生彼中‧爾時我當何所作耶‧我能忍乎。作是念已‧作意思惟‧必須令其腦漿\n"+
		"炎熱‧起坐慞慌‧無寧方便‧隨力令發畏怖之心。」此是切要。現得善身‧若如是思‧能淨先作‧未\n"+
		"來減少。先所作善‧由猛欲樂‧發願令轉增長繁多。諸當新作堪能趣入‧則日日中能使暇身具\n"+
		"足義利。若於現在不思彼等‧墮惡趣時‧雖求從彼畏怖之中‧救護依處‧然不能得。爾時於其應\n"+
		"不應作‧無慧力故‧不能取捨。如入行論云‧「若時能行善‧然我未作善‧惡趣苦蒙蔽‧爾時我何"
		,
		/*===========================第 98 頁===========================*/
		"為。」又云‧「誰從此大畏‧能善救護我‧睜其恐懼眼‧四方覓皈依。見四方無依‧次乃遍迷悶‧\n"+
		"彼處非有依‧爾時我何為。故自今皈依‧諸佛眾生怙‧勤救眾生事‧大力除諸畏。」此僅粗分‧\n"+
		"廣如念住經說。定須觀閱‧數數觀閱‧於所觀閱‧應當思惟。\n"+
		"<b><s>　第二習近後世安樂方便分二‧<n>一</n>趣入聖教最勝之門淨修皈依‧<n>二</n>一切善樂所有根本發深忍\n"+
		"　信。　初中分四‧<n>一</n>由依何事為皈依因‧<n>二</n>由依彼故所皈之境‧<n>三</n>由何道理而正皈依‧<n>四</n>既皈依已\n"+
		"　所學次第。　　今初</s></b>\n"+
		"　　因雖多種‧然於此中是如前說‧於現法中速死不住‧死歿之後‧於所生處亦無自在‧是\n"+
		"為諸業他自在轉。其業亦如入行論云‧「如黑暗依陰雲中‧剎那電閃極明顯‧如是佛力百\n"+
		"道中‧世間褔慧略發起。由是其善唯羸劣‧恆作重罪極強猛。」諸白淨業勢力微劣‧諸黑惡\n"+
		"業至極強力‧故墮惡趣‧由思此理‧起大畏怖‧次令發生求依之心。猶如陳那菩薩云‧「安住\n"+
		"無邊底‧生死大海中‧貪等極暴惡‧大鯨嚼其身‧今當皈依誰。」總為二事。由惡趣等自生怖\n"+
		"畏。深信三寶‧有從彼中救護堪能。故若此二唯有虛言‧則其皈依亦同於彼‧若此二因‧堅固\n"+
		"猛利‧則其皈依亦能變意‧故應勵力勤修二因。"
		,
		/*===========================第 99 頁===========================*/
		"<b><s>　第二由依彼故所皈之境分二‧<n>一</n>正明其境‧<n>二</n>應皈依此之因相。　　今初</s></b>\n"+
		"　　如百五十頌云‧「若誰一切過‧畢竟皆永無‧若是一切種‧一切德依處。設是有心者‧即\n"+
		"應皈依此‧讚此恭敬此‧應住其聖教。」謂若有一‧能辨是依非依慧者‧理應皈依‧無欺皈處\n"+
		"佛薄伽梵。由此亦表法及僧寶。如皈依七十頌云‧「佛法及僧伽‧是求脫者依。」\n"+
		"　　應皈之因相分四‧初者‧謂自即是極調善性‧已能證得無畏位故‧若未得此‧則如倒者\n"+
		"依於倒者‧不能從其一切畏中救護他故。第二者‧謂於一切種‧度所化機‧善方便故‧此若無\n"+
		"者‧縱往皈依‧亦不能辦所求事故。第三者‧謂具大悲故‧此若無者‧雖趣皈依‧不救護故。第四\n"+
		"者‧謂以一切財而興供養‧未將為喜‧要以正行而修供養‧乃生喜故‧此若無者‧則定顧視先\n"+
		"有恩惠‧不與一切作皈處故。總之自正解脫一切怖畏‧善巧於畏度他方便‧普於一切無其\n"+
		"親疏‧大悲遍轉‧普利一切有恩無恩‧是應皈處。此亦唯佛方有‧非自在天等‧故佛即是所皈\n"+
		"依處。由如是故‧佛所說法‧佛弟子眾皆可皈依。由是若於攝分所說此諸理上‧能引定解‧專\n"+
		"心依仰‧必無不救‧故應至心發起定解。由能救自二種因中‧外支或因‧無所缺少‧大師已成‧\n"+
		"然是內支‧未能實心持為皈依‧而苦惱故。是故應知‧雖未請求‧由大悲引‧而作助伴‧復無懈怠‧"
		,
		/*===========================第 100 頁===========================*/
		"無比勝妙真皈依處‧現前安住為自作怙‧故應皈此。讚應讚云‧「自宣我是汝‧無怙者助伴‧\n"+
		"由大悲抱持‧一切諸眾生。大師具大悲‧有愍願哀愍‧勤此無懈怠‧有誰與尊等。汝是諸有情‧\n"+
		"依怙總勝親‧不求尊為依‧故眾生沈溺。若正受何法‧下者亦獲利‧能利他諸法‧除尊非餘知。\n"+
		"一切外支力‧尊已正成辦‧由內力未全‧愚夫而受苦。」\n"+
		"<b><s>　第三由何道理而皈依者。攝決擇中略說四事‧<n>一</n>知功德‧<n>二</n>知差別‧<n>三</n>自誓受‧<n>四</n>不言有餘而正皈\n"+
		"　依。　初知功德而皈依者‧須能憶念皈處功德‧其中有三‧<n>一</n>佛功德‧<n>二</n>法功德‧<n>三</n>僧功德。　　今初\n"+
		"　分四</s></b>\n"+
		"　　身功德者。謂正思念諸佛相好‧此亦應如喻讚所說而憶念之。如云‧「相莊嚴尊身‧殊\n"+
		"妙眼甘露‧如無雲秋空‧以星聚莊嚴。能仁具金色‧法衣端嚴覆‧等同金山頂‧為霞雲縛纏。尊\n"+
		"怙無嚴飾‧面輪極光滿‧離雲滿月輪‧亦莫能及此。尊口妙蓮花‧與蓮日開放‧蜂見疑蓮華‧當\n"+
		"如懸索轉。尊面具金色‧潔白齒端嚴‧如淨秋月光‧照入金山隙。應供尊右手‧為輪相殊飾‧由\n"+
		"以手安慰‧生死所怖人。能仁遊行時‧雙足如妙蓮‧印畫此地上‧蓮華何能嚴。」\n"+
		"　　語功德者。謂隨世界‧所有有情‧同於一時‧各各申一異類請問‧能由剎那心相應慧‧悉"
		,
		/*===========================第 101 頁===========================*/
		"皆攝持‧以一言音答一切問‧彼等亦能各隨自音‧而生悟解。應思惟此希有道理‧如諦者品\n"+
		"云‧「若諸有情於一時‧發多定語而請問‧一剎那心遍證知‧由一音酬各各問。由是應知勝\n"+
		"導師‧宣說梵音於世間‧此能善轉正法輪‧盡諸人天苦邊際。」又如百五十頌云‧「觀尊面\n"+
		"可愛‧從彼聞此等‧極和美言音‧如月注甘露。尊語能靜息‧貪塵如雨雲‧拔除瞋毒蛇‧等同妙\n"+
		"翅鳥。摧壞極無知‧翳障如日光‧由摧我慢山‧故亦等金剛。見義故無欺‧無過故隨順‧善綴故\n"+
		"易解‧尊語具善說。且初聞尊語‧能奪聞者意‧次若正思惟‧亦除諸貪癡。慶慰諸匱乏‧亦放逸\n"+
		"者皈‧令樂者厭離‧尊語相稱轉。能生智者喜‧能增中者慧‧能摧下者翳‧此語利眾生。」應如\n"+
		"是念。\n"+
		"　　意功德分二。智功德者‧謂於如所有性‧盡所有性‧一切所知‧如觀掌中菴摩洛迦‧智無\n"+
		"礙轉‧能仁智遍一切所知。除佛餘者‧所知寬廣‧智量狹小‧悉不能遍。如讚應讚云‧「唯尊智\n"+
		"能遍‧一切所知事‧除尊餘一切‧唯所知寬廣。」又云‧「世尊墮時法‧一切種生本‧如掌中酸\n"+
		"果‧是尊意行境。諸法動非動‧若一若種種‧如風行於空‧尊意無所礙。」應如是念。悲功德者‧\n"+
		"如諸有情為煩惱縛‧無所自在‧能仁亦為大悲繫縛無所自在。是故若見諸苦眾生‧常起大"
		,
		/*===========================第 102 頁===========================*/
		"悲恆無間斷。如百五十頌云‧「此一切眾生‧惑縛無差別‧尊為解眾生‧煩惱長悲縛。為應先\n"+
		"禮尊‧為先禮大悲‧尊知生死過‧令如此久住。」諦者品亦云‧「若見癡黑暗‧常覆眾生心‧陷\n"+
		"入生死獄‧勝仙發悲心。」又云‧「若見欲蔽意‧大愛常耽境‧墮愛貪大海‧勝者發大悲。見煩\n"+
		"惑眾生‧多病憂逼惱‧為除眾苦故‧十力生大悲。能仁常起悲‧終無不起時‧住眾生意樂‧故佛\n"+
		"無過失。」應隨憶念。\n"+
		"　　業功德者。謂身語意業‧由其任運無間二相‧而正饒益一切有情。此復由於所化之別‧\n"+
		"堪引化者‧能仁無不令其所化會遇圓滿‧遠離衰損‧定作一切所應作事。如百五十頌云‧\n"+
		"「尊說摧煩惱‧顯示魔諂動‧說生死苦性‧亦示無畏所。思利大悲者‧凡能利有情‧此事尊未\n"+
		"行‧豈有此餘事。」讚應讚云‧「尊未度眾生‧何有是衰損‧未令世間會‧豈有此盛事。」應憶\n"+
		"念之。\n"+
		"　　此是略說念佛道理‧若由種種門中憶念‧亦由多門能發淨信。若能數數憶念思惟‧則\n"+
		"勢猛利常恆相續。餘二寶德‧亦復如是。\n"+
		"　　由如是修‧若善了解‧則諸經論多是開示三皈功德‧此等皆能現為教授。"
		,
		/*===========================第 103 頁===========================*/
		"　　念觀察修皆是分別‧於修行時而棄捨者‧是遮此等集聚資糧‧淨治罪障非一門徑‧故\n"+
		"於暇身‧攝取無量堅實心藏‧應當了知為大障礙。此等若作常時修持‧心隨修轉‧故於初時\n"+
		"修心稍難‧後時於彼能任運轉。又若能念‧願我當得‧如所隨念‧如是佛者‧是發菩提心‧一切\n"+
		"晝夜恆得見佛‧於臨終時任生何苦‧然隨念佛終不退失。三摩地王經云‧「教汝應悟解‧如\n"+
		"人多觀察‧由住彼觀察‧心能如是趣。如是念能仁‧佛身無量智‧常能修隨念‧心趣注於此。此\n"+
		"行住坐時‧欣樂善士智‧欲我成無上‧勝世願菩提。」又云‧「清淨身語意‧常讚佛勝德‧如是\n"+
		"修心續‧晝夜見世依。若時病不安‧受其至死苦‧不退失念佛‧苦受莫能奪。」博朵瓦云‧「若\n"+
		"數數思‧漸能深信‧漸淨相續‧能得加持。由於此上獲得定解‧故能由其誠心皈依‧若於所學\n"+
		"能正習學‧則一切事悉成佛法。吾等對於諸佛妙智‧尚不計為準洽占卜。」此復說云‧「譬\n"+
		"如有一準利卜士說云‧我知汝於今年無諸災患‧則心安泰。彼若說云‧今歲有災‧應行此事‧\n"+
		"彼事莫為‧則勵力為。若未能辦‧心則不安‧起是念云‧彼作是說‧我未能辦。若佛制云‧此此應\n"+
		"斷‧此此應行。豈置心耶‧若未能辦豈憂慮耶。反作是言‧諸教法中‧雖如彼說‧然由現在‧若時\n"+
		"若處‧不能實行‧須如是行。輕棄佛語‧唯住自知。」若不觀察‧隨心愛樂‧唯亂於言。若非爾者‧"
		,
		/*===========================第 104 頁===========================*/
		"內返其意‧詳細觀察‧極為諦實。故當數數思佛功德‧勵力引發至心定解。此若生者‧則於佛\n"+
		"所從生之法及修法眾‧亦能發起如是定解‧是則皈依至於扼要。此若無者‧即能轉變心意\n"+
		"皈依‧且無生處‧況諸餘道。\n"+
		"　　法功德者。謂由敬佛而為因緣‧應作是念‧佛具無邊功德者‧是由證修滅道二諦‧除過\n"+
		"引德‧以為自性‧教證二法‧而得生起。如正攝法經云‧「諸佛世尊‧所有無邊無際功德‧從法\n"+
		"生起‧受行法分‧法所化現‧法為其主‧從法出生‧正法行境‧依於正法‧法所成辦。」\n"+
		"　　僧功德中。正謂諸聖補特伽羅‧此亦由念正法功德‧由其如理修行門中‧而為憶念。正\n"+
		"攝法經云‧「於諸僧伽‧應如是念‧謂說正法‧受行正法‧思惟正法‧是正法田‧受持正法‧依止\n"+
		"於法‧供養於法‧作法事業‧法為行境‧法行圓滿‧自性正直‧自性清淨‧法性哀愍‧成就悲愍‧常\n"+
		"以遠離為所行境‧恆趣向法‧常白淨行。」\n"+
		"　　由知差別而皈依者。如攝分說‧由知三寶內互差別而正皈依。此中分六‧相差別者‧現\n"+
		"正等菩提是佛寶相。即彼證果‧是法寶相。由他教授‧而正修行是僧寶相。業差別者‧如其次\n"+
		"第‧善轉教業‧斷煩惱苦所緣為業‧勇猛增長業。信解差別者‧如其次第‧應樹親近承事信解‧"
		,
		/*===========================第 105 頁===========================*/
		"應樹希求證得信解‧應樹和合同一法性共住信解。修行差別者‧如其次第‧應修供養承事\n"+
		"正行‧應修瑜伽方便正行‧應修共受財法正行。隨念差別者‧謂應別念三寶功德‧如云‧「謂\n"+
		"是世尊等。」生福差別者‧謂依補特伽羅及法增上‧生最勝福‧佛及僧二是依初義。此復依\n"+
		"一補特伽羅‧及依眾多補特伽羅生長福德‧以於僧伽定有四故。\n"+
		"　　由自誓受而皈依者。謂由誓受依佛為師‧依般涅槃為正修法‧皈依僧伽為修助伴‧由\n"+
		"如是門而正皈依‧如毘奈耶廣釋中說。\n"+
		"　　由不言餘而皈依者。謂由了知內外大師及其教法‧諸學法者‧所有勝劣‧唯於三寶執\n"+
		"為皈處‧不執與此相違師等‧是所應皈。\n"+
		"　　此二所有差別之中‧師差別者。謂佛圓滿無邊功德‧所餘大師與此相違。殊勝讚云‧\n"+
		"「我捨諸餘師‧我皈依世尊‧此何故為尊‧無過具功德。」又云‧「於餘外道教‧如如善思惟‧\n"+
		"如是如是我‧心信於依怙。如是非遍智‧宗過壞其心‧心壞者不見‧無過大師尊。」教差別者。\n"+
		"謂佛聖教‧由安穩道得安樂果‧息生死流‧淨諸煩惱‧終不欺罔樂解脫者‧唯一善妙‧清淨罪\n"+
		"惡‧外道教法與此相違。如殊勝讚云‧「何故由尊教‧安樂得安樂‧故於說法師‧尊教此眾"
		,
		/*===========================第 106 頁===========================*/
		"生。」讚應讚亦云‧「謂應趣應遮‧清淨及雜染‧此是雄尊語‧與餘言差別。此純顯真如‧彼唯\n"+
		"欺罔法‧尊語與餘言‧除此須何殊。此專一妙善‧彼唯障礙法‧尊語與餘言‧除此有何別。由彼\n"+
		"染極染‧由此能清淨‧此即依怙語‧與餘言差別。」僧伽差別由此能知。\n"+
		"<b><s>　第四既皈依已‧所學次第分二‧<n>一</n>攝分中出‧<n>二</n>教授中出。　　今初</s></b>\n"+
		"　　初中有二四聚。初四聚中‧親近善士者‧謂如前說‧善知識者‧乃是一切功德依處‧觀見\n"+
		"是已而正親近‧由皈依佛即是皈依示道大師‧隨順此之正行‧即是親近示道師故。聽聞正\n"+
		"法‧及如理作意者。隨其所應‧謂當聽聞若佛所說‧若佛弟子所說‧法教諸契經等。及若作意\n"+
		"何種所緣‧能息煩惱‧即應作意。由皈依法‧於教證法應當現證‧此即是彼隨順行故。法隨法\n"+
		"行者‧謂應隨順般涅槃法‧而修正行。由皈依僧‧於趣涅槃補特伽羅應執為伴。其隨順行‧謂\n"+
		"應與諸趣解脫者‧共同學故。\n"+
		"　　第二四聚中‧諸根不掉者‧謂根於境放散之後‧意亦隨逐‧於境掉動‧深見過患‧令意厭\n"+
		"捨。受學學處者‧謂隨力受學佛制學處。悲愍有情者‧謂佛聖教‧由悲差別‧故皈依此‧於諸有\n"+
		"情‧亦應悲愍‧斷除損害。應時時間‧於三寶所勤修供養者‧謂應日日供養三寶。"
		,
		/*===========================第 107 頁===========================*/
		"<b><s>　第二教授中出分二‧<n>一</n>別學‧<n>二</n>共學。初中分二‧<n>一</n>遮止應學‧<n>二</n>修行應學。　今初</s></b>\n"+
		"　　如涅槃經云‧「若皈依三寶‧是謂正近事‧終不應皈依‧諸餘天神等。皈依正法者‧應離\n"+
		"殺害心。皈依於僧伽‧不共外道住。」此說有三‧謂不皈餘天‧於諸有情捨離損害‧與諸外道\n"+
		"不應共住。其中初者謂於世間‧若大自在遍入天等‧尚不執為畢竟皈處‧況諸鬼趣山神龍\n"+
		"等。此是不可不信三寶‧皈心彼等。若於彼等‧請其助伴‧現前如法‧所作事業‧則無不可。如求\n"+
		"施主為活命伴‧依諸醫師為治病伴。第二謂於人及畜等‧若打若縛‧若禁穿鼻‧實不能負強\n"+
		"令負等‧意樂加行‧損害有情‧悉應遠離。第三謂與不信三寶‧為可歸宿‧而毀謗者‧不應共住。\n"+
		"　　三種修行應學者。謂於佛像‧若塑若畫‧隨好隨醜‧不應譏毀‧置塵險處‧及押當等‧不敬輕\n"+
		"毀‧皆當斷除‧應當執為是可敬田‧猶如大師。親友書云‧「隨工巧拙木造等‧智者應供善逝\n"+
		"像。」分辨阿笈摩說‧劫毘羅摩納婆‧由於學無學僧眾‧說十八種異類惡語。謂云‧「汝等象頭‧\n"+
		"豈能了知是法非法。」等‧感有十八異類頭形摩羯陀魚。自迦葉大師時‧乃至釋迦法王住旁\n"+
		"生中。雜事中說‧拘留孫大師般涅槃後‧端妙大王令建大塔‧有一工人‧曾經二次作是譏云‧\n"+
		"「今令樹其如是大塔‧不知何日乃得完竣。」後善成已‧深生憂悔‧將其工價造一金鈴‧"
		,
		/*===========================第 108 頁===========================*/
		"掛於塔上‧其後感生容顏醜惡‧身形倭小‧聲音和美‧名曰善和。故於佛像不應說言‧此如此\n"+
		"類‧於他所造諸佛像等‧若因善妙‧若量廣大‧不應譏毀及遮止等。大瑜伽師奉曼殊像於覺\n"+
		"前‧請觀視云‧「此善醜何似‧若善妙者‧可將絨巴迦格瓦所供之四錢金授與購取。」覺\n"+
		"答云‧「至尊妙音之身‧無所不善‧師工中等。」說已置頂‧於一切像‧悉如是行。雖於正法\n"+
		"四句以上‧應離不敬。又應斷除一切不敬‧謂抵押經卷‧貿為貨物‧置禿土地‧灰塵險處‧鞋襪\n"+
		"並持‧及跨越等。應起恭敬‧等如法寶。傳說慬哦瓦善知識‧凡見有持經典來者‧合掌起立‧後\n"+
		"不能起‧殷勤合掌。又說覺至哦日時‧有一咒師不從聞法‧大依怙尊見一記錄‧以齒污穢\n"+
		"沾其經書‧深生不忍‧說云‧「可愍‧不可不可。」咒師生信‧遂從聞法。霞惹瓦亦云‧「我等於\n"+
		"法任何玩耍‧無所不作‧然不敬法及法師者‧是壞慧因。現在愚蒙‧如此已足‧莫更作集愚癡\n"+
		"之因‧若愚過此‧更有何能。」\n"+
		"　　若於僧伽‧或出家眾‧持沙門相及於其相不罵不毀‧又一切種不應分黨‧視如怨敵‧云\n"+
		"汝等我等‧應當敬重‧猶如僧寶。勸發增上意樂會云‧「希樂功德住林藪‧不應觀察他過失‧\n"+
		"不應起心作是念‧我是超勝我第一。此憍是諸放逸本‧永不應輕劣比丘‧一劫不能得解脫‧"
		,
		/*===========================第 109 頁===========================*/
		"此是此教正次第。」敦巴仁波卿與大瑜伽師‧見碎黃布在行路中‧皆不輕越‧抖置淨處‧如\n"+
		"是行持‧應隨修學。自能如何恭敬三寶‧則諸眾生亦能如是恭敬自故‧如三摩地王經云‧\n"+
		"「作集如何業‧當得如是果。」\n"+
		"　　共學分六‧初者隨念三寶功德差別‧數數皈依者。謂數思惟如前所說‧內外差別‧及三\n"+
		"寶中‧互相差別‧並其功德。\n"+
		"　　第二隨念大恩恆勤供養‧嚼噉之先亦當供養者。如三摩地王經云‧「由佛福德獲飲\n"+
		"食‧愚夫不知報佛恩。」此是以獲飲食為喻‧隨自所有一切樂善‧悉應了知是三寶恩‧由報\n"+
		"恩德意樂供養。此中復二‧謂供養事及供養意樂。初中有十‧供養身者‧謂親供養真佛色身。\n"+
		"供養塔者‧謂供為佛所建塔等。現前供養者‧謂前二事‧現自根前而設供養。不現前供養者‧\n"+
		"謂佛佛塔非現在前‧普為一切佛佛塔故而設供養。又若於佛般涅槃後為供佛故‧造像及\n"+
		"塔‧若一數等‧亦非現供。若供此二隨一之時‧作如是念而供養者‧謂此一法性‧即是一切法\n"+
		"性‧是故現前供養此二‧亦即供養其餘三世一切諸佛‧及供十方無邊佛塔。此是俱供現不\n"+
		"現前。論說初者獲廣大福‧第二較前獲大大福‧第三較前獲最大福。故於一佛‧或佛像等‧修"
		,
		/*===========================第 110 頁===========================*/
		"供養時‧應憶法性無所差別‧先當遣意供養一切‧極為切要。自作供養者‧謂非由於懈怠懶\n"+
		"惰放逸增上‧而令他作‧唯自手作。教他供養者‧謂念自己略有少物‧然諸有情貧苦薄福‧無\n"+
		"力供養‧若教此供‧當獲安樂‧由悲愍心‧唯教他供。又亦勸他共供養者‧謂自他俱共同供養。\n"+
		"此三福果‧大小如前。財敬供養者‧謂供種種衣服飲食臥具坐具病緣醫藥‧供身什物‧薰香\n"+
		"末香塗香華鬘伎樂及諸燈燭‧敬問禮拜‧奉迎合掌‧唱種種讚‧五支遍禮‧右旋圍繞‧又供田\n"+
		"等無盡奉施‧又供摩尼耳環臂釧‧諸莊嚴具‧下至供養諸小鳴鈴‧散諸珍奇‧纏寶縷線‧供養\n"+
		"諸佛‧或佛塔廟。廣大供養者‧謂以如是利養恭敬常時供養。此復有七‧謂所供物‧眾多微妙‧\n"+
		"現非現前‧自作教他‧至心歡喜‧猛利勝解‧而為供養‧復將此善迴向無上正等菩提。非染污\n"+
		"供養者‧謂不由輕蔑放逸懈怠而教他供‧自手供養‧殷重供養‧不散漫心而設供養‧不以貪\n"+
		"等雜染供養‧不於信佛國王等所為得利敬而為供養‧以隨順物而設供養。隨順物者‧謂諸\n"+
		"淨物‧遠離不淨‧雌黃所塗‧酥所灌洗‧局啒羅薰‧遏迦花等及諸所餘非清淨物。\n"+
		"　　又若如是財物供養‧自無所集無從他求‧應於一切世界之中‧所有如來諸供養具‧以\n"+
		"歡喜俱及於廣大勝解俱心‧周遍思惟‧一切隨喜少用功力‧而修無量廣大供養‧攝集菩提"
		,
		/*===========================第 111 頁===========================*/
		"廣大資糧‧恆常於此以真善心‧起歡喜心‧當勤修學。又如寶雲經及建立三三昧耶經所說‧\n"+
		"無主攝持諸華果樹及珍寶等‧亦當供養。正行供養者‧謂於下至搆牛乳頃‧精勤修習四無\n"+
		"量心‧四種法集‧隨念三寶‧波羅蜜多‧及能勝解甚深空性‧無分別住‧於淨尸羅‧起防護心‧於\n"+
		"菩提分‧六度四攝‧精勤修學。若能由此十種供養供養三寶‧應知是名圓滿供養。由如是等‧\n"+
		"興供養時‧有六意樂‧能於三寶隨一之所‧少分思惟‧而生無量廣大果利。一者無上大功德\n"+
		"田‧二者無上有大恩德‧三者一切有情中尊‧四者猶如鄔曇妙華極難值遇‧五者三千大千\n"+
		"世界獨一出現‧六者一切世出世間圓滿根本‧作是思惟而設供養。此等是如菩薩地說而\n"+
		"正摘錄。恆常時中‧於如是等隨應而行‧若遇佳節及大時會‧當隨力能修妙供養。\n"+
		"　　復次恆須受飲食故‧爾時若能首先供養無間缺者‧少用功力‧而能圓滿眾多資糧‧故\n"+
		"隨受用淨水以上‧應以先首至心供養。此復非以糕之瘀處‧菜葉黃處‧是須擇其妙者而供。\n"+
		"又供茶時‧現一切人‧如洒揚塵‧唯彈少許‧不成供養‧是霞惹瓦語錄中出。譬如有一極肥沃\n"+
		"田‧至下種時而不下種‧任其荒蕪‧如是廢止‧實生不忍。如是能生若現若後一切善樂‧最勝\n"+
		"福田‧於其四季一切時中‧常恆無間‧堪種一切善樂種子。復應於此如經說云‧「當以信犁‧"
		,
		/*===========================第 112 頁===========================*/
		"耕耘福田。」若未能作‧至極堪惜。故如讚應讚云‧「如尊之福田‧三世間非有‧施處尊第一‧\n"+
		"是淨令座淨。猶如虛空界‧橫豎無邊際‧於尊為利害‧異熟無盡際。」於最勝田‧尚不見如庸\n"+
		"俗之田‧此是我等無賢善相‧故一切時‧當勤精進供養三寶。若如是行‧由於勝田種善根力‧\n"+
		"於諸道次‧慧力增長。故於聽聞不能持文‧思惟不能解義‧修習相續不生‧慧力至極微劣之\n"+
		"時‧依福田力‧是要教授。如是亦如吉祥敬母云‧「作詩大善根‧我慧依尊故‧如夏季江河‧雖\n"+
		"小極增長。」又如說云‧「供養亦復不賴其物‧是在自信。」若有信心‧用曼陀羅及諸淨水‧\n"+
		"並無主攝諸供具等‧皆可供養‧無餘財物‧應如是行。如現實有而不能捨‧作是念云‧「我無\n"+
		"福德極貧窮‧諸餘供財我悉無。」等同博朵瓦云‧「於一穢螺盃中‧略擲少許香草‧念云‧『栴\n"+
		"檀冰片妙香水。』是諸生盲欺明眼者。」又如樸穹瓦云‧「我於最初供養香草‧其氣辛辣。\n"+
		"次有四合長香供養‧其氣甘美。現在供養‧若沈水香‧嘟嚕迦等‧其氣香馥。」若於微供輕而\n"+
		"弗供‧則永生中終是唯爾。若縱微少‧發起殷重‧漸得上妙‧應如此師行持修學。傳說此師每\n"+
		"配一次‧須用二十二兩金之香。若諸已得資具自在大菩薩眾‧尚化其身為多俱胝‧於一一\n"+
		"身‧復各化現百千等手‧往一切剎‧經無量劫‧供養諸佛。諸由少許相似功德‧便生喜足‧云我"
		,
		/*===========================第 113 頁===========================*/
		"不於此上希菩提者‧是於正法極少知解‧造次亂言。以是應如寶雲經中所說而行。如云‧「應\n"+
		"當聽聞諸契經中‧所有如是廣大供養‧廣大承事‧由其最勝真實善心‧增上意樂‧迴向諸佛\n"+
		"及諸菩薩。」\n"+
		"　　第三隨念悲故‧亦應安立於諸眾生於是道理者。謂由悲愍‧隨能安立諸餘有情令受\n"+
		"皈依。\n"+
		"　　第四隨作何事‧有何所須‧皆當供養啟白三寶‧棄捨世間諸餘方便者。謂隨作為何種\n"+
		"所作‧隨見何等緊要重事‧應依三寶及興隨順三寶供養‧於一切種‧不應依止不順三寶邪\n"+
		"道等儀‧一切時中應當至心皈憑三寶。\n"+
		"　　第五由知勝利‧晝三夜三‧勤修皈依分二‧一攝分所出勝利‧二教授所出勝利。初中有\n"+
		"二四聚。初四聚中‧一獲廣大福者‧如無死鼓音陀羅尼云‧「佛世尊難思‧正法亦難思‧聖\n"+
		"僧不思議‧諸信不思議‧異熟亦難思。」攝波羅蜜多論亦云‧「皈依福有色‧三界器猶狹‧\n"+
		"如大海水藏‧非握能測量。」二獲大歡喜者‧如念集中云‧「若諸日夜中‧能隨念諸佛‧正\n"+
		"皈依佛者‧此是人所得。」於餘二寶亦如是說。我今獲得依止如是三寶歸宿‧是為善得‧"
		,
		/*===========================第 114 頁===========================*/
		"作意思惟‧增長歡喜。三獲三摩地‧四獲大清淨者‧謂由等持及以慧學而得解脫。\n"+
		"　　第二四聚中‧一具大守護者‧至下當說。二於一切種邪勝解障‧皆得輕微或永滅盡者‧\n"+
		"謂由信解皈依惡師惡法惡友增上力故‧造諸惡業‧皆得輕微‧當得清淨。三得墮入正行正\n"+
		"至善士數中。四為其大師同梵行者‧及於聖教淨信諸天愛念歡喜者‧謂得趣入善士數中‧\n"+
		"為大師等之所喜樂。諸天如何歡喜者‧謂彼歡喜唱如是言‧我等由其成就皈依‧從彼處沒\n"+
		"來生此間。是諸人等‧今既成就多住皈依‧亦當來我眾同分中。\n"+
		"　　教授所出勝利分八。一得入內道佛弟子者‧總有多種建立內外差別道理‧然共稱許\n"+
		"覺與寂靜論師‧以有皈依而為判別‧謂得皈依‧乃至未捨。是故最初入佛弟子者‧須由至\n"+
		"心於三寶所受為大師等‧此若無者‧任作何善‧皆不能入佛弟子數。二成一切律儀所依處\n"+
		"者‧俱舍釋云‧「受皈依者‧是受一切律儀之門。」皈依七十論亦云‧「近事皈三寶‧此是八\n"+
		"律本。」此中意趣‧謂由皈依而能堅固涅槃意樂‧從此意樂律儀發生。三先集業障輕微滅\n"+
		"盡者‧集學論中‧顯示皈依能淨罪時‧說云‧「此中應以生豬因緣‧而為譬喻。」謂有天子當\n"+
		"生豬中‧由皈依故‧即未生彼‧是由皈依能淨當生惡趣因故。「若有皈依佛‧彼不往惡趣‧捨"
		,
		/*===========================第 115 頁===========================*/
		"棄人身已‧彼當得天身。」於法及僧亦如是說。故先集罪‧有者輕微‧有者罄盡。四積廣大福\n"+
		"者‧如前所說。五不墮惡趣‧由前應知。六人與非人不能為難者‧如經云‧「諸遭怖畏人‧多皈\n"+
		"依山林‧及皈諸園囿‧皈所供樹木。其皈非尊勝‧其皈非第一‧雖依其依處‧不能脫眾苦。若時\n"+
		"有皈依‧佛法及僧伽‧由知苦苦集‧正超越諸苦。八支聖道樂‧當趣般涅槃‧以智慧觀見‧諸四\n"+
		"聖諦理。此皈為尊勝‧此皈是第一‧由皈此皈處‧能解脫眾苦。」此中應以成就風索外道等\n"+
		"緣‧而為譬喻。七隨一切想悉當成辦者‧隨行何等如法所作‧若先供養皈依三寶‧祈禱成辦‧\n"+
		"則易成就。八速能成佛者‧如師子請問經云‧「由信斷無暇。」謂由獲得殊勝閒暇‧遇皈依\n"+
		"處‧學殊勝道‧由此不久當得成佛。如是憶念諸勝利故‧於日日中‧晝三夜三‧勤修皈依。\n"+
		"　　第六下至戲笑乃至命緣‧應當守護不捨三寶者。身命受用‧定當捨離‧若為此故‧棄捨\n"+
		"三寶‧則一切生輾轉受苦‧故任至何事‧不捨皈依。作是念已‧數起誓願‧雖為戲笑亦不應說\n"+
		"捨皈依語。諸先覺等說一學處謂隨往何方‧於彼如來應學皈依‧未見根據。\n"+
		"　　如是六種共同學處‧是如道炬釋論中說。各別學處初三種者‧契經中說。後三種者‧出\n"+
		"於皈依六支論中。如彼說云‧「應於形像頌‧及諸碎黃布‧信解為大師‧親口說諸法‧不謗應"
		,
		/*===========================第 116 頁===========================*/
		"頂戴‧淨未淨諸人‧應觀為善士。」攝決擇中所說此等‧迦摩跋云‧「此諸學處‧內鄔蘇巴‧想\n"+
		"亦宣說‧我二同從阿蘭若師所聞。」此語出於此師所傳壟跋嚩道次第中。\n"+
		"　　若有違犯此諸學處‧當成虧損及棄捨之理者。有說違犯六種成捨‧謂初三種各別學\n"+
		"處及恆修皈依‧為命不捨‧供養三寶。有說由其九種成捨‧謂加違後三種各別學處。其餘僅\n"+
		"是虧損之因。然作是思‧若與為命亦不棄捨有違犯者‧實捨皈依。如是雖未棄捨三寶‧然俱\n"+
		"愛執三寶異品大師等三‧亦違不言有餘大師‧心未誠皈‧故亦成捨。若未犯此‧僅違學處‧非\n"+
		"是捨因。\n"+
		"　　是故皈依‧是於佛教‧能入大門。若有皈依‧非唯虛言‧則是依止最殊勝力‧內外障緣不\n"+
		"能違害。功德差別‧易生難退‧倍轉增長。故如前說‧由於怖畏及由憶念功德等門‧受持皈依‧\n"+
		"勵力不違皈依學處‧是極扼要。\n"+
		"　　設作是念‧如是念死及思死後當生惡趣‧而起怖畏‧能從其中救拔皈處‧是為三寶。若\n"+
		"皈三寶不違學處‧然其皈處‧如何救拔‧如集法句云‧「能斷有箭道‧我教示爾等‧如來是大\n"+
		"師‧爾等應須行。」佛是皈依大師‧僧是皈依正行助伴‧故正皈依是為法寶。若能得此‧解脫"
		,
		/*===========================第 117 頁===========================*/
		"畏故。最下法寶‧亦是由其初修業時‧遠一分過‧修一分德‧斷證二事‧倍轉勝進而為安立‧非\n"+
		"離此外‧忽從他來。\n"+
		"　　故於此時‧是須善巧善不善業及果差別‧如理取捨而修正行‧是為修法。若不久思二\n"+
		"業及果‧如理取捨‧則不能遮諸惡趣因‧縱畏惡趣‧然亦不能脫此畏故。是故救拔果位惡趣‧\n"+
		"須於因時‧糾治其意隨不善轉‧此復依賴於諸業果得深忍信。\n"+
		"<b><s>　第二引發一切善樂根本深忍信中分三‧<n>一</n>思總業果‧<n>二</n>思別業果‧<n>三</n>思已正行進止之理。　初中\n"+
		"　分二‧<n>一</n>正明思總之理‧<n>二</n>分別思惟。　　今初</s></b>\n"+
		"　　初中有四。業決定理者。謂諸異生及諸聖者‧隨有適悅行相樂受‧下至生於有情地獄‧\n"+
		"由起涼風‧所發樂受‧一切皆是從先造集善業所起。從不善業發生安樂‧無有是處。所有逼\n"+
		"迫行相苦受‧下至羅漢相續之苦‧一切皆是從先造集不善而起。從諸善業發生諸苦‧無有\n"+
		"是處。寶鬘論云‧「諸苦從不善‧如是諸惡趣‧從善諸善趣‧一切生安樂。」故諸苦樂非無因\n"+
		"生‧亦非自性‧自在天等不順因生‧是為從總善不善業生總苦樂。諸苦安樂種種差別‧亦從\n"+
		"二業種種差別‧無少紊亂‧各別而起。若於業果‧或決定相‧或無欺罔‧獲定解者‧是為一切內"
		,
		/*===========================第 118 頁===========================*/
		"佛弟子所有正見‧讚為一切白法根本。\n"+
		"　　業增長廣大者。謂雖從其微少善業‧亦能感發極大樂果‧雖從微少諸不善業‧亦能感\n"+
		"發極大苦果‧故如內身因果增長‧諸外因果無能等者。此亦如集法句云‧「雖造微少惡‧他\n"+
		"世大怖畏‧當作大苦惱‧猶如入腹毒。雖造微少福‧他世引大樂‧亦作諸大義‧如諸穀豐熟。」\n"+
		"從輕微業起廣大果‧此復當由說宿因緣發定解者‧如阿笈摩說‧牧人喜歡‧及彼手杖所穿\n"+
		"田蛙‧五百水鵝‧五百魚龜‧五百餓鬼‧五百田夫及五百牛‧所有因緣。並賢愚經說金天‧金寶‧\n"+
		"牛護因緣‧當從阿笈摩及賢愚經‧百業經等‧求發定解。\n"+
		"　　復次尸羅‧軌則‧淨命‧正見四中‧後未虧損‧前三未能圓滿清淨‧少虧損者‧說生龍中。海\n"+
		"龍王請問經云‧「世尊‧我於劫初‧住大海內‧時有拘留孫如來出現世間‧爾時大海之中‧諸\n"+
		"龍‧龍子‧龍女悉皆減少‧我亦減少眷屬。世尊現大海中‧諸龍‧龍子‧龍女‧悉皆如是無有限量‧\n"+
		"不能得知數量邊際。世尊‧有何因緣而乃如此。世尊告曰‧龍王‧若於善說法毘奈耶而出家\n"+
		"已‧未能清淨圓滿尸羅‧虧損軌則‧虧損淨命‧虧損尸羅‧未能圓滿。然見正直‧此等不生有情\n"+
		"地獄‧死沒已後‧當生龍中。」此復說於拘留孫大師教法之中‧在家出家有九十八俱胝。金"
		,
		/*===========================第 119 頁===========================*/
		"仙大師教法之中‧有六十四俱胝。迦葉大師教法之中‧有八十俱胝。吾等大師教法之中‧有\n"+
		"九十九俱胝。由其虧損軌則‧淨命‧尸羅增上‧於龍趣中已生當生。吾等大師‧般涅槃後‧諸行\n"+
		"惡行‧毀犯尸羅‧四眾弟子‧亦生龍中。然亦宣說‧彼等加行‧雖不清淨‧由於聖教尚未退失深\n"+
		"忍意樂‧增上力故‧從龍死歿‧當生人天。除諸趣入於大乘者‧一切悉當於此賢劫諸佛教中‧\n"+
		"而般涅槃。是故微細黑白諸業‧如影隨形‧皆能發生廣大苦樂‧當生堅固決定解已‧雖微善\n"+
		"業應勵力修‧微少惡罪‧應勵力斷。如集法句云‧「如鳥在虛空‧其影隨俱行‧作妙行惡行‧隨\n"+
		"彼眾生轉。如諸少路糧‧入路苦惱行‧如是無善業‧有情往惡趣。如多有路糧‧入路安樂行‧如\n"+
		"是作善業‧有情往善趣。」又云‧「雖有極少惡‧勿輕念無損‧如集諸水滴‧漸當滿大器。」又\n"+
		"云‧「莫思作輕惡‧不隨自後來‧如落諸水滴‧能充滿大器。如是集少惡‧愚夫當極滿‧莫思作\n"+
		"少善‧不隨自後來。如落諸水滴‧能充滿大瓶‧由略集諸善‧堅勇極充滿。」本生論亦云‧「由\n"+
		"修善不善諸業‧諸人即成慣習性‧如是雖不特策勵‧他世現行猶如夢。若未修施尸羅等‧隨\n"+
		"具種色少壯德‧極大勢力多富財‧後世悉不獲安樂。種等雖卑不著惡‧具足施戒等功德‧如\n"+
		"夏江河能滿海‧後世安樂定增廣。應善定解善非善‧諸業他世生苦樂‧斷惡勵力修善業‧無"
		,
		/*===========================第 120 頁===========================*/
		"信豈能如欲行。」\n"+
		"　　所未造業不會遇者。謂若未集能感苦樂正因之業‧則定不受業苦樂果。諸能受用大\n"+
		"師所集‧無數資糧所有妙果‧雖不必集彼一切因‧然亦定須集其一分。\n"+
		"　　已造之業不失壞者。謂諸已作善不善業‧定能出生愛非愛果。如超勝讚云‧「梵志說\n"+
		"善惡‧能換如取捨‧尊說作不失‧未作無所遇。」三摩地王經亦云‧「此復作已非不觸‧餘所\n"+
		"作者亦無受。」毘奈耶阿笈摩亦云‧「假使經百劫‧諸業無失亡‧若得緣會時‧有情自受\n"+
		"果。」\n"+
		"<b><s>　第二分別思惟分二‧<n>一</n>顯十業道而為上首‧<n>二</n>決擇業果。　　今初</s></b>\n"+
		"　　如是了知苦樂因果‧各各決定及業增大‧未作不會‧作已無失。彼當先於何等業果所\n"+
		"有道理發起定解而取捨耶‧總能轉趣妙行惡行三門決定‧三門一切善不善行‧雖十業道\n"+
		"不能盡攝。然諸粗顯‧善不善法罪惡根本諸極大者‧世尊攝其扼要而說十黑業道。若斷此\n"+
		"等‧則諸極大義利扼要亦攝為十‧見此故說十白業道。俱舍論云‧「攝其中粗顯‧善不善如\n"+
		"應‧說為十業道。」辨阿笈摩亦云‧「應護諸言善護意‧身不應作諸不善‧如是善淨三業道‧"
		,
		/*===========================第 121 頁===========================*/
		"當得大仙所說道。」由善了知十黑業道及諸果已‧於其等起亦當防護‧使其三門全無彼\n"+
		"雜。習近十種善業道者‧即是成辦一切三乘及其士夫二種義利所有根本‧不容缺少‧故佛\n"+
		"由其眾多門中數數稱讚。海龍王請問經云‧「諸善法者‧是諸人天眾生圓滿根本依處‧聲\n"+
		"聞獨覺菩提根本依處‧無上正等菩提根本依處。何等名為根本依處‧謂十善業。」又云‧\n"+
		"「龍王‧譬如一切聚落‧都城‧市埠‧方邑‧國土‧王宮‧一切草木‧藥物‧樹林‧一切事業邊際‧一切\n"+
		"種子集聚‧生一切穀‧若耕若耘‧及諸大種‧皆依地住‧地是彼等所依處所。龍王‧如是此諸十\n"+
		"善業道‧是生人天‧得學無學諸沙門果‧獨覺菩提‧及諸菩薩一切妙行‧一切佛法所依止\n"+
		"處。」是故十地經中‧稱讚遠離十不善戒所有義理。入中論中亦總攝云‧「若諸異生諸語\n"+
		"生‧若諸自力證菩提‧及諸勝子決定勝‧增上生因戒非餘。」\n"+
		"　　如是不能於一尸羅‧數修防護而善守護‧反自說云‧我是大乘者‧極應呵責。地藏經云‧\n"+
		"「由如是等十善業道而能成佛‧若有乃至命存以來‧下至不護一善業道‧然作是言‧我是\n"+
		"大乘‧我求無上正等菩提。此數取趣至極詭詐‧說大妄語‧是於一切佛世尊前欺罔世間‧說\n"+
		"斷滅語。此由愚蒙‧而至命終‧顛倒墮落。」顛倒墮落者‧於一切中‧應知即是惡趣異名。"
		,
		/*===========================第 122 頁===========================*/
		"<b><s>　決擇業果分三‧<n>一</n>顯示黑業果‧<n>二</n>白業果‧<n>三</n>業餘差別。　初中分三‧<n>一</n>正顯示黑業道‧<n>二</n>輕重差別‧<n>三</n>\n"+
		"　此等之果。　　今初</s></b>\n"+
		"　　云何殺生。攝分於此說為‧事‧想‧欲樂‧煩惱‧究竟五相。然將中三攝入意樂‧更加加行攝\n"+
		"為四相‧謂事‧意樂‧加行‧究竟‧易於解釋‧意趣無違。其中殺生事者‧謂具命有情。此復若是殺\n"+
		"者自殺‧有加行罪‧無究竟罪。瑜伽師地論於此意趣‧說他有情。意樂分三‧想有四種‧謂如於\n"+
		"有情事作有情想及非情想‧於非有情作非情想及有情想‧初及第三是不錯想‧二四錯誤。\n"+
		"此中等起若有差別‧譬如念云‧唯殺天授‧若起加行誤殺祠授‧無根本罪‧故於此中須無錯\n"+
		"想。若其等起於總事轉‧念加行時‧任有誰來悉當殺害‧是則不須無錯誤想。如是道理‧於餘\n"+
		"九中‧如其所應‧皆當了知。煩惱者‧謂三毒隨一。等起者‧謂樂殺害。加行中能加行者‧謂若自\n"+
		"作或教他作‧二中誰作‧等無差別。加行體者‧謂用器杖‧或用諸毒‧或用明咒‧隨以一種起加\n"+
		"行等。究竟者‧謂即由其加行因緣‧彼爾時死‧或餘時死。此復如俱舍云‧「前等死無本‧已生\n"+
		"餘身故。」此中亦爾。\n"+
		"　　不與取。事者‧謂隨一種他所攝物。意樂分三‧想與煩惱俱如前說。等起者‧謂雖未許令"
		,
		/*===========================第 123 頁===========================*/
		"離彼欲。加行中能加行者如前。加行體者‧謂若力劫‧若闇竊盜‧任何悉同。此復若於債及寄\n"+
		"存‧以諸矯詐欺惑方便‧不與而取‧或為自義‧或為他義‧或為令他耗損等故‧所作悉同成不\n"+
		"與取。究竟者‧攝分中說‧「移離本處。」於此義中‧雖多異說‧然從物處‧移於餘處‧唯是一例‧\n"+
		"猶如田等無處可移‧然亦皆須安立究竟‧是故應以發起得心。此復若是教劫教盜‧彼生即\n"+
		"可‧譬如遣使往殺他人‧自雖不知‧然他何時死‧其教殺者‧即生本罪\n"+
		"<b>菩提到次第廣論卷四終</b>"
		,
		/*===========================第 124 頁===========================*/
		"<b>菩提到次第廣論卷五</b>\n"+
		"　　欲邪行。事者‧略有四種‧謂所不應行‧非支‧非處‧及以非時。此中初者‧謂行不應行所有\n"+
		"婦女及一切男‧非男非女。此之初者‧攝分中云‧若於母等‧母等所護‧如經廣說名不應行。如\n"+
		"馬鳴阿闍黎說此義云‧「言非應行者‧他攝具法幢‧種護至王護‧他已娶娼妓‧諸親及繫屬‧\n"+
		"此是不應行。」他所攝者‧謂他妻妾。具法幢者‧謂出家女。種姓護者‧謂未適嫁‧父母等親‧或\n"+
		"大公姑‧或守門者‧或雖無此‧自己守護。若王若敕而守護者‧謂於其人制治罰律。於他已給\n"+
		"價金娼妓‧說為邪行‧顯自給價‧非欲邪行‧大依怙尊‧亦作是說。男者俱通自他。非支分者‧謂\n"+
		"除產門所有餘分。馬鳴阿闍黎云‧「云何名非支‧口‧便道‧嬰童‧腿逼‧及手動。」大依怙云‧「言\n"+
		"非支者‧謂口‧穢道及童男女前後孔戶‧並其自手。」此說亦同。非處所者‧謂諸尊重所集會\n"+
		"處‧若塔廟處‧若大眾前‧若於其境有妨害處‧謂地高下及堅硬等。馬鳴阿闍黎云‧「此中處\n"+
		"境者‧在法塔像等‧菩薩居處等‧親教及軌範‧並在父母前‧非境不應行。」大依怙師亦如是\n"+
		"說。非其時者‧謂穢下降‧胎滿孕婦‧若飲兒乳‧若受齋戒‧若有疾病‧匪宜習故‧若過量行。量謂"
		,
		/*===========================第 125 頁===========================*/
		"極至經於五返。馬鳴阿闍黎云‧「此中非時者‧穢下及孕婦‧有兒非欲解‧及其苦憂等‧住八\n"+
		"支非時。」大依怙尊亦復同此‧稍差別者‧謂晝日時‧亦名非時。非支等三‧雖於自妻‧尚成邪\n"+
		"行‧況於他所‧意樂分三‧想者‧攝分中說‧「於彼彼想‧是須無誤。」毘奈耶中‧「於不淨行他\n"+
		"勝處時‧說想若錯不錯皆同。」俱舍釋說‧「作自妻想而趣他妻‧不成業道‧若於他妻作餘\n"+
		"妻想而趣行者‧有二家計‧謂成不成。」煩惱者‧三毒隨一。等起者‧謂樂欲行諸不淨行。加行\n"+
		"者‧攝分中說‧「教他邪行‧教者亦生欲邪行罪。」俱舍釋說‧「如此則無根本業道。」前或\n"+
		"意說非根本罪‧然須觀察。究竟者‧謂兩兩交會。\n"+
		"　　妄語。事者‧謂見聞覺知四‧及此相違四。能解之境‧謂他領義。意樂分三‧想者‧謂於所見\n"+
		"變想不見‧及於未見變想見等。煩惱者‧謂三毒。等起者‧謂覆藏想‧樂說之欲。加行者‧謂或言\n"+
		"說或默忍受或現身相。此復所求或為自利或為利他‧隨為何故說悉同犯。此中說於妄語‧\n"+
		"離間及粗惡語‧雖教他說其三亦成。俱舍本釋於語四業‧皆說教他亦成業道。毘奈耶中「說\n"+
		"起此等究竟犯時‧要須自說。」究竟者‧謂他領解。俱舍釋說若他未解‧僅成綺語。離間粗語‧\n"+
		"亦皆同此。"
		,
		/*===========================第 126 頁===========================*/
		"　　離間語。事者‧謂諸有情‧或和不和。意樂分三‧想及煩惱如前。等起者‧和順有情樂乖離\n"+
		"欲‧不和有情樂不合欲。加行者‧隨以實語若非實語‧隨說所說‧若美不美‧隨其所求‧為自為\n"+
		"他而有陳說。究竟者‧攝分中云‧「究竟者‧謂所破領解。」謂他了解所說離言。\n"+
		"　　粗惡語。事者‧謂諸有情能引恚惱。意樂中想‧煩惱如前。等起者‧謂樂粗言欲。加行者‧謂\n"+
		"以若實若非實語‧或依種過‧或依身過‧或依業過‧或依戒過‧或依現行所有過失‧說非愛語。\n"+
		"究竟者‧攝分中說‧「究竟者‧謂呵罵彼。」俱舍釋說‧須所說境‧解所說義。\n"+
		"　　綺語。事者‧謂能引發無利之義。意樂中三‧想者‧雖僅說為於彼彼想‧然於此中‧是即於\n"+
		"其所欲說義‧彼想而說‧此中不須能解境故。煩惱者‧謂三毒隨一。等起者‧謂樂宣說無屬亂\n"+
		"語。加行者‧謂發勤勇宣說綺語。究竟者‧謂纔說綺語。此復七事相應‧謂若宣說鬥訟競諍。若\n"+
		"於外論或梵志咒‧以愛樂心受持諷頌。若苦逼語如傷嘆等。若戲笑遊樂受欲等語。若樂處\n"+
		"眾宣說王論‧臣論‧國論‧盜賊論等。若說醉語及顛狂語。若邪命語。語無係屬‧無法相應‧非義\n"+
		"相應者‧謂前後語無所連續‧若說雜染‧若歌笑等‧若觀舞時而發言詞。前三語過‧是否綺語‧\n"+
		"雖有二家‧然此所說‧順於前家。"
		,
		/*===========================第 127 頁===========================*/
		"　　貪欲。事者‧謂屬他財產。意樂分三‧想者‧謂於彼事作彼事想。煩惱者‧謂三毒隨一。等起\n"+
		"者‧謂欲令屬我。加行者‧謂於所思義‧正發進趣。究竟者‧說「於彼事‧定期屬己。」謂念其財\n"+
		"等願成我有。此中貪心圓滿‧須具五相‧一有耽著心‧謂於自財所。二有貪婪心‧謂樂積財物。\n"+
		"三有饕餮心‧謂於屬他資財等事‧計為華好深生愛味。四有謀略心‧謂作是念‧凡彼所有何\n"+
		"當屬我。五有覆蔽心‧謂由貪欲不覺羞恥‧不知過患及與出離。若此五心‧隨缺一種‧貪欲心\n"+
		"相即非圓滿。瑜伽師地論中‧於十不善‧俱說加行。又非圓滿貪欲之理者‧謂作是念‧云何當\n"+
		"能令其家主‧成我僕使‧如我所欲。又於其妻子等及飲食等‧諸資身具‧亦如是思。又作是念\n"+
		"云何當能令他知我‧少欲遠離‧勇猛精進‧具足多聞‧成施性等。又作是念‧云何當能令諸國\n"+
		"王及諸商主‧四眾弟子‧供事於我‧得衣食等。又作是念‧起如是欲‧云何令我當生天上‧天妙\n"+
		"五欲以為遊戲‧當生猛利‧遍入世界‧乃至願生他化自在。又於父母妻子僕‧等同梵行者‧所\n"+
		"有資具‧發欲得者‧亦是貪欲。\n"+
		"　　瞋恚心中。事想煩惱‧如粗惡語。等起者‧樂打等欲‧云何令其遭殺遭縛‧若由他緣‧或自\n"+
		"任運耗失財產。加行者‧即於所思而起加行。究竟者‧謂於打等‧期心決定或已斷決。此亦有"
		,
		/*===========================第 128 頁===========================*/
		"五‧全則圓滿‧缺則非圓。謂具五心‧一有憎惡心‧謂於能損害相‧隨法分別故。二有不堪耐心‧\n"+
		"謂於不饒益不堪忍故。三有怨恨心‧謂於不饒益數數非理思惟隨念故。四有謀略心‧謂作\n"+
		"是念何當捶撻‧何當殺害。五有覆蔽心‧謂於瞋恚不覺羞恥‧不知過患‧及與出離。僅成損害\n"+
		"心者‧謂作是念彼於我所‧已作正作‧諸無義事‧故我於彼當作無義。盡其所有幾許思惟‧爾\n"+
		"許一切皆損害心。如是願他現法喪失親屬資財及善法等‧及願後法往惡趣中‧亦是損心。\n"+
		"　　邪見。事者‧謂實有義。意樂分三‧想者‧謂於所謗義‧作諦實想。煩惱者‧謂三毒隨一。等起\n"+
		"者‧謂樂誹謗欲。加行者‧即於所思策發加行‧此復有四‧謂謗因‧果‧作用‧有事。誹謗因者‧謂云\n"+
		"無有妙惡行等。誹謗果者‧謂云無有彼二異熟。誹謗作用分三‧誹謗殖種‧持種作用者‧謂云\n"+
		"無有若父若母。誹謗往來作用者‧謂云無有前世後世。誹謗受生作用者‧謂云無有化生有\n"+
		"情。謗實有事者‧謂云無有阿羅漢等。究竟者‧謂誹謗決定。此亦由於五相圓滿‧謂具五心‧一\n"+
		"有愚昧心‧謂不如實了所知故。二有暴酷心‧謂樂作惡故。三有越流行心‧謂於諸法不如正\n"+
		"理善觀察故。四有失壞心‧謂謗無布施愛養祠祀妙行等故。五有覆蔽心‧謂由邪見不覺羞\n"+
		"恥‧不知過患及與出離故。此五若缺‧則不圓滿。雖其邪見復有所餘‧然唯說此名邪見者‧由"
		,
		/*===========================第 129 頁===========================*/
		"此能斷一切善根‧隨順諸惡‧隨意所行‧是為一切邪見之中極重者故。其中殺生粗語瞋心‧\n"+
		"由三毒起‧由瞋究竟。不與而取邪行貪欲‧由三毒起‧唯貪究竟。妄言離間及諸綺語發起‧究\n"+
		"竟‧俱由三毒。邪見由其三毒發起‧唯癡究竟。此等之中‧思唯是業而非業道‧身語所有七支\n"+
		"是業亦是業道‧思行處故。貪欲等三‧業道非業。\n"+
		"<b><s>　第二顯示輕重分二‧<n>一</n>十業道輕重‧<n>二</n>兼略顯示具力業門。</s></b>\n"+
		"　　初中有五‧例如殺生‧由意樂故重者‧謂猛利三毒所作。由加行故重者‧謂或已殺生‧或\n"+
		"正或當‧具歡喜心具踴躍心‧或有自作或復勸他‧於彼所作稱揚讚歎‧見同行者意便欣慶。\n"+
		"由其長時思量積蓄怨恨心已‧方有所作‧無間所作‧殷重所作‧或於一時頓殺多生。或令發\n"+
		"起猛利痛苦而行殺害。或令怖畏‧作不應作而後殺害。若於孤苦貧窮哀慼悲泣等者而行\n"+
		"殺害。由無治故重者‧謂不能日日‧乃至極少時持一學處‧或亦不能‧半月‧八日‧十四‧十五‧受\n"+
		"持齋戒。於時時間‧惠施修福‧問訊禮拜‧迎送合掌和敬業等。又亦不能‧於時時間‧獲得增上\n"+
		"慚愧惡作。又不能證世間離欲‧或法現觀。由邪執故重者‧謂由依於作邪祠祀‧所有邪見‧執\n"+
		"為正法‧而行殺戮。又作是心‧畜等乃是世主所化為資具故‧雖殺無罪‧諸如是等‧依止邪見"
		,
		/*===========================第 130 頁===========================*/
		"而行殺害。由事故重者‧謂若殺害大身旁生‧人或人相‧父母兄弟‧尊長委信‧有學菩薩‧羅漢\n"+
		"獨覺‧及知如來不能殺害‧而以惡心出其身血。違此五因‧為輕殺生。餘九除事‧如其殺生‧輕\n"+
		"重應知。由其事故重不與取者‧謂若劫盜眾多‧上妙及委信者。劫盜孤貧‧出家之眾及此法\n"+
		"眾。若入聚落而行劫盜‧若劫有學‧羅漢‧獨覺‧僧伽‧佛塔‧所有財物。由其事故重邪行者‧謂行\n"+
		"不應行中‧若母‧母親‧委信他妻‧或比丘尼‧或正學女‧或勤策女。非支行中謂於面門。非時行\n"+
		"中謂受齋戒‧或胎圓滿‧或有重病。非處行中謂塔近邊‧若僧伽藍。由其事故重妄語者‧謂為\n"+
		"誑惑多取他財而說妄語‧若於父母乃至於佛‧若於善賢‧若於知友而說妄語‧若能起重殺\n"+
		"生等三而說妄語。為破僧故而說妄語‧於一切中‧此為最重。由其事故重離間語者‧謂破壞\n"+
		"他長時親愛‧及善知識父母男女‧若能破僧‧若能引發身三重業‧所有離間語。由其事故重\n"+
		"粗惡語者‧謂於父母等及餘尊長‧說粗惡語‧若以非真非實妄語說粗惡語‧現前毀罵‧訶責\n"+
		"於他。由其事故重綺語者‧妄語等三‧所有綺語‧輕重如前。若諸依於鬥訟諍競所有綺語‧若\n"+
		"以染心‧於外典籍‧而讀誦等。若於父母親屬尊重‧調弄輕笑‧現作語言‧不近道理。由其事故\n"+
		"重貪欲者‧謂若貪欲僧伽‧佛塔所有財寶‧及於己德起增上慢‧乃於王等及諸聰叡同梵行"
		,
		/*===========================第 131 頁===========================*/
		"所起增上欲‧貪求利敬。由其事故重瞋恚者‧謂於父母親屬尊長‧無過貧苦諸可哀愍‧諸誠\n"+
		"心悔所作過者‧起損害心。由其事故重邪見者‧謂能轉趣謗一切事‧較餘邪見此為最重。又\n"+
		"謂世間無阿羅漢‧正至正行‧此見亦爾。與上相違是輕應知。\n"+
		"　　本地分中說有六相‧成極尤重。加行故者‧謂由猛利三毒‧或由猛利無彼三毒‧發起諸\n"+
		"業。串習故者‧謂於長夜親近修習‧若多修習善惡二業。自性故者‧謂屬身語七支‧前前重於\n"+
		"後後‧屬意三支‧後後重於前前。事故者‧謂於佛法僧諸尊重所‧為損為益。所治一類故者‧謂\n"+
		"乃至壽存‧一向受行諸不善業‧未曾一次受行善法。所治損害故者‧謂永斷除諸不善品‧令\n"+
		"諸善業離欲清淨。親友書中亦云‧「無間‧貪著‧無對治‧從德‧尊事所起業‧是五重大善不善‧\n"+
		"其中應勤修善行。」其三寶等為具德事‧其父母等為有恩事‧開二成五。\n"+
		"　　第二兼略開示具力業門分四。由福田門故力大者。謂於三寶‧尊重‧似尊‧父母等所‧於\n"+
		"此雖無猛利意樂‧略作損益‧能得大福及大罪故。此復猶如念住經云‧「從佛法僧‧雖取少\n"+
		"許亦成重大。若不與取佛法僧物‧仍以彼等同類奉還。盜佛法者‧即得清淨‧盜僧伽者‧乃至\n"+
		"未受不得清淨‧福田重故。若盜食物‧當墮有情大那落迦‧若非食物‧則當生於諸獄間隙‧無"
		,
		/*===========================第 132 頁===========================*/
		"間近邊極黑暗處。」日藏經中特說犯戒‧受用僧物少許‧或葉或華或果‧當生有情大那落\n"+
		"迦。設經長夜而得脫離‧復當生於曠野尸林‧無手乏足諸旁生類‧及無手足盲餓鬼中‧經歷\n"+
		"多年恆受苦等極大過患。又說已施僧眾比丘‧雖諸華等‧自不應用‧不應轉與諸居家者‧諸\n"+
		"居家者‧不應受用‧罪亦極重。即前經云‧「寧以諸利劍‧割斷自支體‧已施僧伽物‧不與在家\n"+
		"者。寧食熱鐵丸‧火燄即熾猛‧不應於僧中‧受用僧伽業。寧取食猛火‧量等須迷盧‧不以居家\n"+
		"身‧受用僧財物。寧破一切體‧貫諸大丳上‧不以居家身‧受用僧財物。寧入諸舍宅‧火炭遍充\n"+
		"滿‧不以居家身‧夜宿僧房舍。」又僧伽中‧若諸菩薩補特伽羅‧是極大力善不善田。能入發\n"+
		"生信力契印經說‧「設如有一由忿恚故‧禁閉十方一切有情於黑暗獄。若有忿恚背菩薩\n"+
		"住‧云不瞻視此暴惡者‧較前生罪極無數量。又較劫奪南贍部洲‧一切有情一切財物‧若有\n"+
		"輕毀隨一菩薩‧亦如前說。又較焚毀殑伽沙數諸佛塔廟‧若於勝解大乘菩薩‧起損害心‧發\n"+
		"生瞋恚‧說諸惡稱‧亦如前說。」能入定不定契印經說‧「若剜十方有情眼目‧由慈心故令\n"+
		"眼還生‧及將前說一切有情‧放出牢獄‧悉皆安立轉輪王樂或梵天樂。如次若於諸能勝解\n"+
		"大乘菩薩‧淨信瞻視及由淨信樂欲瞻視‧稱揚讚歎‧較前生福極無數量。」極善寂靜決定"
		,
		/*===========================第 133 頁===========================*/
		"神變經中亦說‧「較諸殺害南贍部洲一切有情‧或盡劫奪一切財產‧若於菩薩所修善行‧\n"+
		"下至摶食施諸旁生‧而作障難‧能生無量罪。」故於是處‧極應防慎。\n"+
		"　　由所依門故力大者。謂如鐵丸小亦沈水‧即彼成器雖大上浮‧說智不智所作罪惡‧而\n"+
		"有輕重。此因相者‧涅槃經說‧諸愚癡者‧如蠅粘涕不能脫離‧雖於小罪不能脫離。由無悔心\n"+
		"不能善行。由覆藏過‧雖先有善為惡染污。故應現受異熟之因‧變為極重那落迦因。又如少\n"+
		"水投鹽一掬‧則難飲用‧或如欠他一文金錢‧不能還償‧漸被逼縛受諸苦惱。又說五相‧雖是\n"+
		"當感現輕異熟‧能令熟於那落迦中‧謂重愚癡‧善根微薄‧惡業尤重‧不起追悔‧先無善行。故\n"+
		"說輕微是指智者‧能悔前失‧防護後過‧不藏諸惡‧勤修善法‧諸惡對治‧若不修此妄矜為智‧\n"+
		"由輕蔑門‧知而故行‧是為尤重。寶蘊經亦說‧「三千所有一切有情‧皆入大乘‧具輪王位‧各\n"+
		"以燈燭器等大海‧炷如須彌‧供養佛塔‧其福不及出家菩薩‧於小燈燭塗以油脂‧持供塔前‧\n"+
		"所得福德百分之一。」此中意樂‧謂菩提心及其福田俱無差別‧然所供物‧殊異極大‧是所\n"+
		"依力極為明顯。\n"+
		"　　由是道理‧則無律儀與有律儀‧同是有中‧具一具二具三之身‧修行道時‧顯然後後較"
		,
		/*===========================第 134 頁===========================*/
		"於前前‧進趣優勝。如諸在家修施等時‧受持齋戒律儀而修‧與無律儀所修善根‧勢力大小‧\n"+
		"亦極明顯。制罰犯戒經說‧較諸世人‧具十不善‧經百歲中‧恆無間缺所集眾惡。若有比丘毀\n"+
		"犯尸羅‧仙幢覆身‧經一日夜‧受用信施‧不善極多。亦是由其所依門中‧罪惡力大。分辨阿笈\n"+
		"摩亦云‧「寧吞熱鐵丸‧猛燄極可畏‧不以犯戒身‧受用國人食。」通說犯戒及緩學處。敦巴\n"+
		"仁波卿云‧「較依正法所起罪惡‧十種不善‧是極少惡。」現見實爾。\n"+
		"　　由事物門故力大者。施有情中正法布施‧供養佛中正行供養‧較諸財施財物供養‧最\n"+
		"為超勝‧此是一例‧餘皆應知。\n"+
		"　　由意樂門故力大者。寶蘊經說‧較三千界一切有情‧各建佛塔‧量等須彌。於此諸塔‧復\n"+
		"經微塵沙數之劫‧以一切種可供養事‧承事供養。若諸菩薩不離一切智心‧僅散一華‧其福\n"+
		"極多。如是由其攀緣所得‧若有勝劣‧及緣自他利益事等意樂差別。此復由其強盛微弱‧恆\n"+
		"促等門‧應當了知。又於惡行‧若煩惱心‧猛利恆長‧其力則大‧其中復以瞋力為大。入行論云‧\n"+
		"「千劫所集施‧供養善逝等‧此一切善行‧一恚能摧壞。」此復若瞋同梵行者‧及瞋菩薩較\n"+
		"前尤重。三摩地王經云‧「若互相瞋恚‧非戒聞能救‧非定非蘭若‧施供佛能救。」入行論中"
		,
		/*===========================第 135 頁===========================*/
		"亦云‧「如此勝子施主所‧設若有發暴惡心‧能仁說如惡心數‧當住地獄經爾劫。」\n"+
		"　　第三其果分三。異熟果者。謂十業道‧一一皆依事及三毒上中下品‧有三三等。本地分\n"+
		"說‧此中上品殺生等十‧一一能感生那落迦‧中十一一感生餓鬼‧下十一一能感旁生‧十地\n"+
		"經說‧中下二果與此相違。\n"+
		"　　等流果者。謂出惡趣‧次生人中‧如其次第‧壽量短促‧資財匱乏‧妻不貞良‧多遭誹謗‧親\n"+
		"友乖離‧聞違意聲‧言不威肅‧貪瞋癡三‧上品猛利。諦者品及十地經中‧於其一一說二二果‧\n"+
		"謂「設生人中‧壽量短促多諸疾病‧資財匱乏與他共財。眷屬不調或非可信‧妻有匹偶。多\n"+
		"遭誹謗受他欺誑。眷屬不和‧眷屬鄙惡。聞違意聲‧語成鬥端。語不尊嚴‧或非堪受無定辯才。\n"+
		"貪欲重大不知喜足‧尋求無利或不求利。損害於他‧或遭他害。見解惡鄙‧諂誑為性。」諸先\n"+
		"尊長說縱生人中‧愛樂殺生等事‧是造作等流果。前所說者‧是領受等流果。\n"+
		"　　諸主上果或增上果者‧謂由殺生‧能感外器世間所有飲食及藥果等皆少光澤‧勢力‧\n"+
		"異熟及與威德‧並皆微劣‧難於消變‧生長疾病。由此因緣‧無量有情‧未盡壽量‧而便中夭。不\n"+
		"與取者‧謂眾果尠少‧果不滋長‧果多變壞‧果不貞實‧多無雨澤‧雨多淋澇‧果多乾枯及全無"
		,
		/*===========================第 136 頁===========================*/
		"果。欲邪行者‧謂多便穢‧泥糞不淨‧臭惡迫迮‧不可愛樂。虛妄語者‧謂農作行船‧事業邊際‧不\n"+
		"甚滋息‧不相諧偶‧多相欺惑‧饒諸怖畏‧恐懼因緣。離間語者‧謂其地處丘坑間隔險阻難行‧\n"+
		"饒諸怖畏恐懼因緣。粗惡語者‧謂其地所多諸株杌‧刺石礫瓦‧枯槁無潤‧無有池沼‧河流泉\n"+
		"湧‧乾地鹵田‧丘陵坑險‧饒諸怖畏恐懼因緣。諸綺語者‧謂諸果樹不結果實‧非時結實‧時不\n"+
		"結實‧未熟似熟‧根不堅牢‧勢不久停‧園林池沼‧可樂極少‧饒諸怖畏‧恐懼因緣。貪欲心者‧謂\n"+
		"一切盛事‧經歷一一年時月日‧漸漸衰微唯減無增。瞋恚心者‧謂多疫癘‧災橫擾惱‧怨敵驚\n"+
		"怖‧獅子虎等‧蟒蛇蝮蠍‧蚰蜒百足‧毒暴藥叉諸惡賊等。諸邪見者‧謂器世間‧所有第一勝妙\n"+
		"生源悉皆隱沒‧諸不淨物乍似清淨‧諸苦惱物乍似安樂‧非安居所‧非救護所‧非皈依所。\n"+
		"<b><s>　思惟白業果分二‧<n>一</n>白業‧<n>二</n>果。　　今初</s></b>\n"+
		"　　本地分說‧於殺生不與取欲邪行‧起過患欲解起勝善心‧若於彼起靜息方便‧及於彼\n"+
		"靜息究竟中‧所有身業。語四意三‧亦皆如是。其差別者‧謂云語業及云意業‧事及意樂‧加行\n"+
		"究竟‧如應配合。例如遠離殺生業道事者‧謂他有情。意樂者‧謂見過患‧起遠離欲。加行者‧謂\n"+
		"起諸行靜息殺害。究竟者‧謂正靜息圓滿身業‧以此道理‧餘亦應知。"
		,
		/*===========================第 137 頁===========================*/
		"　　果中有三‧異熟者‧謂由軟中上品善業‧感生人中‧欲界天中‧上二界天。諸等流果‧及增\n"+
		"上果‧違於不善‧如理應知。十地經說‧以此十種‧怖畏生死‧離諸悲心‧由隨順他言教修習‧辦\n"+
		"聲聞果。又諸無悲‧不依止他‧欲自覺悟‧善修緣起‧辦獨勝果。若心廣大‧具足悲心‧善權方便‧\n"+
		"廣發宏願‧終不棄捨一切有情‧於極廣大諸佛智慧‧緣慮修習‧成辦菩薩一切諸地波羅蜜\n"+
		"多。由善修習此一切種‧則能成辦一切佛法。如是二聚十種業道‧及彼諸果‧凡餘教典‧未明\n"+
		"說者‧一切皆是如本地分‧攝決擇分意趣而說。\n"+
		"　　第三顯示業餘差別中‧引滿差別者。引樂趣業是諸善法‧引惡趣業是諸不善。諸能滿\n"+
		"者‧則無決定。於樂趣中‧亦有斷支‧關節殘根‧顏貌醜陋‧短壽多疾‧匱乏財等‧是不善作。於諸\n"+
		"旁生及餓鬼中‧亦有富樂極圓滿者‧是善所作。由如是故‧共成四句‧謂於能引善所引中‧有\n"+
		"由能滿善所圓滿及由不善圓滿二類。於諸能引不善引中‧有由能滿不善圓滿及由善法\n"+
		"圓滿二類。集論云‧「應知善不善業‧是能牽引及能圓滿‧於善惡趣受生之業‧能牽引者謂\n"+
		"能引異熟‧能圓滿者謂既生已‧能令領納愛與非愛。」俱舍論云‧「由一引一生‧能滿則眾\n"+
		"多。」謂由一業能引一生‧非能引多‧亦非眾多共引一生。諸能滿中‧則有眾多。集論則說‧頗"
		,
		/*===========================第 138 頁===========================*/
		"有諸業‧唯由一業牽引一生。又有諸業‧唯由一業牽引多生。頗有諸業‧由眾多業牽引一生。\n"+
		"亦有諸業‧由眾多業牽引多生。釋中說云‧「有由一剎那業‧唯能長養一世異熟種子。及由\n"+
		"彼業而能長養多世異熟種子。有由多剎那業‧唯能數數長養一世種子。及由眾多互相觀\n"+
		"待‧而能數數長養輾轉多生種子。」\n"+
		"　　定不定受業者‧如本地分云‧「順定受業者‧謂故思已‧若作若增長業。順不定受業者‧\n"+
		"謂故思已‧作而不增長業。」作與增長所有差別者‧即前論云‧「云何作業‧謂若思業或思\n"+
		"惟已身語所起。」又云‧「增長業者‧除十種業‧謂一夢所作‧二無知所作‧三無故思所作‧四\n"+
		"不利不數所作‧五狂亂所作‧六失念所作‧七非樂欲所作‧八自性無記‧九悔所損害‧十對治\n"+
		"所損。除此十種業所餘諸業。不增長業者‧謂即所說十種。」攝決擇分亦說四句‧一作殺生\n"+
		"而非增長‧謂無識別所作‧夢中所作‧非故思作‧自無樂欲他逼令作‧若有暫作‧續即發起猛\n"+
		"利追悔及厭患心‧懇責厭離‧正受律儀‧令彼薄弱‧未與異熟‧便起世間所有離欲‧損彼種子\n"+
		"及起出世永斷之道‧害彼種子。二增長而非作者‧為害生故‧於長夜中‧數隨尋伺‧然未殺生。\n"+
		"三作而增長者‧謂除前二句一切殺生。四非作非增長者‧謂除前三。從不與取乃至綺語‧隨"
		,
		/*===========================第 139 頁===========================*/
		"其所應如殺應知。於意三中‧無第二句‧於初句中‧亦無不思而作‧他逼令作。\n"+
		"　　決定受中‧依受果時分三。其中現法受者‧謂即彼果現法成熟。本地分說此復有八‧若\n"+
		"由增上顧戀意樂‧顧戀其身‧財物諸有‧造作不善‧於現法受。若由增上不顧意樂‧不顧彼等‧\n"+
		"作諸善法。如是若於諸有情所‧增上損惱增上慈悲。又於三寶尊重等所增上憎害‧及於此\n"+
		"所‧增上淨信‧勝解意樂。又於父母諸尊重等恩造之所‧由增上品‧酷暴背恩‧所有意樂‧所作\n"+
		"不善‧於現法受。若由增上報恩意樂所作善法‧於現法受。順生受者‧謂於二世當受其果。順\n"+
		"後受者‧謂於三世以後成熟。\n"+
		"　　於相續中‧現有眾多善不善業成熟理者‧謂諸重業即先成熟。輕重若等‧於臨終時何\n"+
		"者現前‧彼即先熟。若此亦等‧則何增上多串習者。若此復等‧則先所作‧彼即先熟。如俱舍釋\n"+
		"所引頌云‧「諸業於生死‧隨重近串習‧隨先作其中‧即前前成熟。」\n"+
		"<b><s>　第二思惟別者。謂由遠離十種不善‧雖定能獲善妙所依‧然若成一圓具德相‧能修種智‧勝所\n"+
		"　依者‧修道進程‧非餘能比‧故應成辦如此所依。此中分三‧<n>一</n>異熟功德‧<n>二</n>異熟果報‧<n>三</n>異熟因緣。</s></b>\n"+
		"　　初中分八。一壽量圓滿者‧謂宿能引牽引長壽‧如其所引‧長壽久住。二形色圓滿者‧謂"
		,
		/*===========================第 140 頁===========================*/
		"由形色顯色善故‧顏容殊妙‧根無闕故‧眾所樂見‧橫豎稱故‧形量端嚴。三族姓圓滿者‧謂生\n"+
		"世間‧恭敬稱揚‧諸高貴種。四自在圓滿者‧謂大財位‧有親友等廣大朋翼‧具大僚屬。五信言\n"+
		"圓滿者‧謂諸有情信奉言教‧由其身語於他無欺‧堪為信委‧於其一切諍訟斷證‧堪為量故。\n"+
		"六大勢名稱者‧有大名稱‧有大美譽‧謂於惠施‧具足勇健精進等德‧由此因緣‧為諸大眾所\n"+
		"供養處。七丈夫性者‧謂成就男根。八大力具足者‧謂由宿業力‧為性少病‧或全無病‧於現法\n"+
		"緣‧起大勇悍。此復第一謂住樂趣‧第二謂身‧生為第三‧財位僚屬為四‧第五謂為世間量則‧\n"+
		"第六謂彼所有名稱‧七謂一切功德之器‧第八謂於諸所應作勢力具足。\n"+
		"　　異熟果報分八。初者依自他利‧能於長時‧積集增長‧無量善根。第二者謂諸大眾暫見\n"+
		"歡喜‧咸共皈仰‧凡所發言‧無不聽用。第三者謂所勸教‧無違敬用。第四者謂以布施攝諸有\n"+
		"情‧令其成熟。第五者謂以愛語利行同事‧攝諸有情‧速令成熟。第六者謂由營助一切事業‧\n"+
		"施布恩德‧為報恩故‧速受勸教。第七者謂為一切勝功德器‧欲樂勤勇‧堪為一切事業之器‧\n"+
		"智慧廣博‧堪為思擇所知之器。又於大眾都無所畏。又與一切有情同行‧言論受用‧或住屏\n"+
		"處皆無嫌礙。第八者謂於自他利‧皆無厭倦‧勇猛堅固‧能得慧力‧速發神通。"
		,
		/*===========================第 141 頁===========================*/
		"　　異熟因分八‧初者謂於有情‧不加傷害‧及正依止不害意樂。又云‧「善放將殺生‧如是\n"+
		"利其命‧遮止害眾生‧則當得長壽。承事諸病人‧善施諸醫藥‧不以磈杖等‧害眾生無病。」第\n"+
		"二者謂能惠施燈等光明‧鮮淨衣物‧又云‧「由依止無瞋‧施莊嚴妙色‧說無嫉妬果‧當感妙\n"+
		"同分。」第三者謂摧伏慢心‧於尊長等‧勤禮拜等‧於他恭敬‧猶如僕使。第四者謂於乞求衣\n"+
		"食等物‧悉皆施惠‧設未來乞亦行利益。又於苦惱及功德田‧乏資具所‧應往供施。第五者謂\n"+
		"修遠離語四不善。第六者謂發宏願‧於自身中攝持當來種種功德‧供養三寶‧供養父母‧聲\n"+
		"聞獨覺‧親教軌範‧及諸尊長。第七者謂樂丈夫所有功德‧厭婦女身‧深見過患。樂女身者‧遮\n"+
		"止欲樂‧將失男根‧令得脫免。第八者謂他不能作‧自當代作‧若共能辦‧則當伴助‧惠施飲食。\n"+
		"如是八因‧若具三緣‧能感最勝諸異熟果。於其三緣‧心清淨中待自有二‧謂修彼因所有眾\n"+
		"善‧將用迴向無上菩提不希異熟。由純厚意‧修行諸因勢力猛利。待他有二‧謂見同法者‧上\n"+
		"中下座‧遠離嫉妬‧比較輕毀‧勤修隨喜。設若不能如此而行‧亦應日日‧多次觀擇所應行事。\n"+
		"加行清淨中‧觀待自者‧謂於長時無間殷重‧觀待他者‧謂未受行讚美令受。已受行者‧讚美\n"+
		"令喜‧恆無間作不棄捨作。田清淨者‧謂由彼二意樂加行‧能與眾多微妙果故‧等同妙田。此"
		,
		/*===========================第 142 頁===========================*/
		"等是如菩薩地說‧以釋補滿而為宣說。\n"+
		"<b><s>　第三思已進止道理中分二‧<n>一</n>總示‧<n>二</n>特以四力淨修道理。　　今初</s></b>\n"+
		"　　如入行論云‧「苦從不善生‧如何定脫此‧我晝夜恆時‧理應思惟此。」又云‧「能仁說\n"+
		"勝解‧一切善品本‧又此之根本‧恆修異熟果。」謂既了知黑白業果‧非唯了知即便止住‧應\n"+
		"數修習‧以此是為極不現事‧極難獲得決定解故。此復如三摩地王經云‧「設月星處皆墮\n"+
		"落‧具山聚落地壞散‧虛空界可變餘相‧然尊不說非諦語。」於如來語‧應修深忍‧若未於此\n"+
		"獲得真實決定信解‧任於何法‧悉不能得‧勝者所愛‧決定信解。如有一類‧說於空性‧已獲決\n"+
		"定‧然於業果無決定信‧不慎重者‧是乃顛倒了解空性。解空性者‧謂即見為緣起之義‧是於\n"+
		"業果發生定解為助伴故。即彼經云‧「一切諸法如水月‧等於幻泡陽燄電‧雖諸死已往他\n"+
		"世‧有情意生不可得。然作諸業終不失‧如其黑白成熟果‧如此理趣門賢妙‧微細難見佛行\n"+
		"境。」是故應於緣起二業‧及諸因果發生定解‧一切晝夜觀察三門‧斷截惡趣。若不先善因\n"+
		"果差別‧縱少知法‧然將三門放逸轉者‧唯是開啟諸惡趣門。海問經云‧「龍王‧諸菩薩由一\n"+
		"種法‧能斷生諸險惡惡趣‧顛倒墮落。一法云何‧謂於諸善法觀察思擇‧作如是念‧我今若何"
		,
		/*===========================第 143 頁===========================*/
		"度諸晝夜。」若能如是觀相續者‧諸先覺云‧此因果時‧校對正法‧全不符順‧於此乃是我等\n"+
		"錯誤‧全無解脫。校對業果‧是觀順否‧若以法校自相續時‧全無符順‧而能至心了知如是‧是\n"+
		"為智者。集法句云‧「若愚自知愚‧是名為智者。」若校法時‧與法乖反‧猶如負屍‧自妄希為\n"+
		"法者‧智者‧淨者‧極頂‧是為下愚。集法句云‧「若愚思為智‧說彼為愚癡。」故其極下‧亦莫思\n"+
		"為於法已解。又博朵瓦則引此本生論文觀察相續‧如云‧「虛空與地中隔遠‧大海彼此岸\n"+
		"亦遠‧東西二山中尤遠‧凡與正法遠於彼。」此說我等凡庸與法‧二者中間‧如彼諸喻‧極相\n"+
		"隔遠。此頌是月菩薩從持善說婆羅門前‧供千兩金‧所受之法。朵壟巴亦云‧「若有觀慧而\n"+
		"正觀察‧如於險坡放擲線團‧與法漸遠。」\n"+
		"　　如是思已‧遮止惡行之理者。如諦者品云‧「大王汝莫為殺生‧一切眾生極愛命‧由是\n"+
		"欲護長壽命‧意中永莫思殺生。」謂十不善及如前說‧諸餘罪惡‧發起意樂‧亦莫現行。應修\n"+
		"應習‧應多修習‧靜息之心。若未如是遮止惡行‧雖非所欲‧然須受苦‧任赴何處‧不能脫故。是\n"+
		"故現前似少安樂‧然果熟時‧雖非所欲‧淚流覆面‧而須忍受‧如是之業是非應作。若受果時\n"+
		"能感受用無罪喜樂‧如是之業是所應行。集法句云‧「若汝怖畏苦‧汝不愛樂苦‧於現或不"
		,
		/*===========================第 144 頁===========================*/
		"現‧莫作諸惡業。設已作惡業‧或當作亦然‧汝雖急起逃‧然不能脫苦。任其居何處‧無業不能\n"+
		"至‧非空非海內‧亦非入山中。」又云‧「諸少慧愚稚‧於自如怨敵‧現行諸惡業‧能感辛楚果。\n"+
		"作何能逼惱‧淚覆面泣哭‧別別受異熟‧莫作此業善。作何無逼惱‧歡喜意欣悅‧別別受異熟‧\n"+
		"作此業善哉。自欲安樂故‧掉舉作惡業‧此惡業異熟‧當哭泣領受。」又云‧「惡業雖現前‧非\n"+
		"定如刀割‧然眾生惡業‧於他世現起。由其諸惡業‧各受辛異熟‧是故諸眾生‧於他世了知。如\n"+
		"從鐵起銹‧銹起食其鐵‧如是未觀作‧自業感惡趣。」康壟巴謂樸窮瓦云‧「善知識說唯有\n"+
		"業果是極緊要‧現今講說聽聞修習‧皆非貴重‧我念唯此極難修持。」樸窮瓦亦云‧「實\n"+
		"爾。」又敦巴云‧「覺瓦心莫寬大‧此緣起微細。」樸窮瓦云‧「我至老時‧依附賢愚。」霞\n"+
		"惹瓦云‧「隨有何過‧佛不報怨‧是方所惡‧宅舍所感‧皆說是由作如此業‧於此中生。」\n"+
		"　　第二特以四力淨修道理者。如是勵力‧雖欲令其惡行不染‧然由放逸‧煩惱盛等增上\n"+
		"力故‧設有所犯‧亦定不可不思放置‧須勵力修大悲大師所說‧還出方便。此復墮罪還出之\n"+
		"理‧應如三種律儀別說。諸惡還出者‧應由四力。開示四法經云‧「慈氏若諸菩薩摩訶薩‧成\n"+
		"就四法‧則能映覆諸惡已作增長。何等為四‧謂能破壞現行‧對治現行‧遮止罪惡及依止"
		,
		/*===========================第 145 頁===========================*/
		"力。」作已增長業者‧是順定受‧若能映此‧況不定業。\n"+
		"　　此中初力者‧謂於往昔無始所作諸不善業‧多起追悔‧欲生此者‧須多修習感異熟等\n"+
		"三果道理。修持之時‧應由勝金光明懺及三十五佛懺二種悔除。第二力中分六‧依止甚深\n"+
		"經者‧謂受持讀誦般若波羅蜜多等契經文句。勝解空性者‧謂趣入無我光明法性‧深極忍\n"+
		"可本來清淨。依念誦者‧謂如儀軌念誦百字咒等‧諸殊勝陀羅尼。妙臂請問經云‧「如春林\n"+
		"火猛燄熾‧無勵遍燒諸草木‧戒風吹燃念誦火‧大精進燄燒諸惡。猶如日光炙雪山‧不耐赫\n"+
		"熾而消溶‧若以戒日念誦光‧炙照惡雪亦當盡。如黑暗中燃燈光‧能遣黑闇罄無餘‧千生增\n"+
		"長諸惡闇‧以念誦燈能速除。」此復乃至見淨罪相‧應當念誦。相者‧準提陀羅尼說‧「若於\n"+
		"夢中夢吐惡食‧飲酪乳等‧及吐酪等‧見出日月‧遊行虛空‧見火熾燃‧及諸水牛‧制伏黑人‧見\n"+
		"比丘僧比丘尼僧‧見出乳樹象及牛王山獅子座及微妙宮‧聽聞說法。」依形象者‧謂於佛\n"+
		"所獲得信心‧造立形像。依供養者‧謂於佛所及佛塔廟‧供養種種微妙供養。依名號者‧謂聽\n"+
		"聞受持諸佛名號‧諸大佛子所有名號。此等唯是集學論中已宣說者‧餘尚眾多。第三力者‧\n"+
		"謂正靜息十種不善。日藏經說‧由此能摧所作一切自作‧教他‧見作隨喜‧殺生等門‧三門業"
		,
		/*===========================第 146 頁===========================*/
		"障‧諸煩惱障及正法障。毘奈耶廣釋中說‧「若無誠意防護之心‧所行悔罪‧唯有空言。」阿\n"+
		"笈摩中是故於此密意問云‧「後防護否。」故防護心後不更作‧至為切要。能生此心‧復賴\n"+
		"初力。第四力者‧謂修皈依及菩提心。此中總之‧勝者為初發業‧雖說種種淨惡之門‧然具四\n"+
		"力‧即是圓滿一切對治。\n"+
		"　　惡淨之理者。謂諸能感於惡趣中極大苦因‧或令變為感微苦困‧或生惡趣‧然不領受\n"+
		"諸惡趣苦‧或於現身稍受頭痛‧即得清淨。如是諸應長時受者‧或為短期‧或全不受。此復是\n"+
		"由淨修之人力之大小‧四力對治‧圓不圓具‧勢猛不猛‧及時相續恆促等門‧故無定準。諸契\n"+
		"經中及毘奈耶皆說‧「諸業縱百劫不亡。」意謂未修四力對治‧若如所說而以四力對治\n"+
		"淨修‧雖順定受‧亦說能淨。八千頌大疏中云‧「謂若凡是近對治品‧可損減法‧彼由成就有\n"+
		"力對治‧能畢竟盡如金穢等。正法障等一切皆是如所說法‧由此正理‧則妄執心‧所作墮處\n"+
		"可無餘盡。諸經說云‧『諸業雖百劫』等者‧應知是說‧若不修習能對治品。若不爾者‧則違\n"+
		"正理及違多經。說順定受‧應知亦是如此所說。說不定者‧雖不修習能對治品。然亦應知不\n"+
		"定感果。」如是由悔及防護等‧傷損能感異熟功能者‧雖遇餘緣‧亦定不能感發異熟。如是"
		,
		/*===========================第 147 頁===========================*/
		"由生邪見瞋恚‧摧壞善根‧亦復同爾。分別熾燃論云‧「若時善法‧由生邪見‧瞋恚虧損。或諸\n"+
		"不善‧若由厭訶‧防護悔除‧是等對治‧傷損其力。彼等雖得眾緣會合‧然由傷損若善不善種\n"+
		"子功能‧豈能有果從彼感發。由無緣合‧時亦遷謝‧豈非從其根本拔除。如經說云‧『受持正\n"+
		"法‧雖其所有順定受惡‧亦當變為於現法受。』又如說云‧『復次諸往惡趣業‧此唯能感頭\n"+
		"痛許。』設作是云‧『若尚有果‧唯頭痛者‧豈是從其根本拔耶。』諸惡業果‧無餘圓滿‧謂當\n"+
		"感受那落迦苦‧若尚不受那落迦中諸輕微苦‧豈非即從根本拔除。於此略起頭痛等故‧豈\n"+
		"是本來原無果報。」雖未獲得真能對治壞煩惱種‧然由違緣令傷損故‧縱遇眾緣亦不感\n"+
		"果‧內外因果‧多是如是。故雖勤修眾多善法‧若不防護瞋恚心等壞善之因‧則如前說。故須\n"+
		"勵力防護瞋等‧精勤修習不善還出。\n"+
		"　　若能盡淨有力之業‧云何經說唯除先業所有異熟。謂感盲等異熟之時‧現在對治難\n"+
		"以淨除。若在因位‧尚未感果‧則易遮止。密意於此‧故如上說‧無有過失。分別熾燃論云‧「設\n"+
		"作是云‧若諸惡罪至極永盡‧云何說除先業異熟耶。意謂已受生盲‧一目缺足‧顛跛及啞聾\n"+
		"等‧自性因果‧故作是說。何以故‧以諸業果‧若已轉成異熟位體‧非有功能‧令其遍盡。若因位"
		,
		/*===========================第 148 頁===========================*/
		"思‧正造作者‧獲得所餘思差別力‧能令永盡。猶如開示指鬘‧未生怨‧娑嚩迦‧殺父及無憂等。\n"+
		"設作是云‧未生怨王及殺母等‧若已生起所餘善思‧何故其業未得永盡‧生無間耶。是為令\n"+
		"於所有業果‧發信解故‧現示感生諸無間等‧非是未能‧無餘永盡所有諸業。如擊綵球‧隨擊\n"+
		"而躍‧生彼即脫‧雖那洛迦火燄等事‧亦未能觸。由是則成‧最極拔除諸惡根本‧亦非諸業全\n"+
		"無果報。」\n"+
		"　　補特伽羅差別一類‧不決定者。三摩地王經說‧「勇授大王‧殺華月嚴‧遂起追悔‧為建\n"+
		"塔廟‧經九十五俱胝千歲‧廣興供養‧一日三時‧悔除罪惡‧善護尸羅‧然壽沒後‧生無間中‧經\n"+
		"六十二阿庾他俱胝劫‧受盲目等無邊眾苦。」雖則如是‧然其悔罪非為唐捐。若不悔除‧須\n"+
		"受極重恆常大苦‧尤過彼故。\n"+
		"　　又由悔護清淨無餘‧然從最初無罪染之清淨‧及由悔除清淨之二‧有大差殊。猶如菩\n"+
		"薩地中所說‧犯根本罪‧雖可重受菩薩律儀‧而能還出‧然於此生‧決定不能獲得初地。攝研\n"+
		"磨經亦云‧「世尊‧設若有一‧由近惡友增上力故‧造作如此誹謗正法‧世尊爾時如何能脫\n"+
		"此罪。作是請已‧世尊告妙吉祥童子云‧曼殊室利‧設七年中‧一日三時於罪悔罪‧後乃清淨‧"
		,
		/*===========================第 149 頁===========================*/
		"其後至少須經十劫‧始能得忍。」此說諸惡雖已清淨‧然得忍位‧任如何速‧須經十劫。是故\n"+
		"無餘清淨之義‧謂是能感非悅意果‧無餘永淨。起道證等‧極為遙遠‧故應勵力‧令初無犯。是\n"+
		"故聖者‧於微小罪‧雖為命故‧不故知轉。若懺悔淨‧與初無犯二無差別‧是則無須如是行故‧\n"+
		"即如世間‧亦可現見傷手足等‧雖可治療‧然終不如初未傷損。\n"+
		"　　如是勵力‧如集法論云‧「若作諸惡未修福‧誤失正法得非法‧具惡業人死怖畏‧如於\n"+
		"大海散朽船。若已修福未作惡‧行諸善士妙法軌‧此則終無死亡怖‧如乘固船登彼岸。」莫\n"+
		"依前作‧應如後行。此復若說眾多應理言辭而放逸轉‧義利微劣。若有僅知微少法義‧然隨\n"+
		"所知正行取捨‧義利殊大。集法句云‧「若人宣多如理語‧放逸而不如是行‧譬如牧人數他\n"+
		"畜‧彼非能得沙門分。設雖少說如理語‧然能正行法隨法‧及能遠離貪瞋癡‧此等能得沙門\n"+
		"分。比丘樂防慎‧深畏諸放逸‧自導出惡趣‧如象出淤泥。比丘樂防慎‧深畏諸放逸‧能抖一切\n"+
		"惡‧如風吹樹葉。」如是親友書亦云‧「若希善趣諸解脫‧願多修習於正見‧若人邪見雖妙\n"+
		"行‧一切皆具苦異熟。」此於緣起二業因果‧正觀見者‧乃是能成一切諸乘‧及辦一切士夫\n"+
		"義利‧必不容少根本依處。故應多閱前文所說‧及念住經‧賢愚因緣‧百業‧百喻‧及毘奈耶‧阿"
		,
		/*===========================第 150 頁===========================*/
		"笈摩中‧諸多因緣‧並諸餘典‧令起猛利恆常定解‧應當持為極扼要義。\n"+
		"　　第二生此意樂之量者。謂先有無偽‧希求現世‧其求後世‧唯虛言辭。即換其位‧令成希\n"+
		"求後世為主‧現在為副‧則為生起。然須令堅固‧故此生已‧仍須勵力善為修習。\n"+
		"　　第三除遣於此邪分別者。謂有一類‧以佛經說‧悉應背棄生死所有一切圓滿‧為錯誤\n"+
		"事‧作是念云‧身受用等諸圓滿事‧增上生者‧皆是生死‧發求此心不應道理。然所求中略有\n"+
		"二類‧謂於現位‧須應希求‧及是究竟所應希求。生死之中身等圓滿‧希解脫者‧於現法中‧亦\n"+
		"須希求‧以由輾轉漸受此身‧後邊乃得決定勝故。非凡所有身及受用‧眷屬圓滿‧增上生事‧\n"+
		"一切皆是生死所攝。以其身等圓滿究竟‧即佛色身‧圓滿佛土‧佛眷屬故。故莊嚴經論於此\n"+
		"密意說云‧「增上生謂受用身‧圓滿眷屬勤圓滿。」此說由前四度‧成辦增上生。又多教典‧\n"+
		"說由此等成色身故。是故修種智者‧經極長時‧修諸極多‧諸極殊勝‧戒施忍等‧亦是希求彼\n"+
		"等妙果‧最極殊勝身等勝生。成辦究竟決定勝者‧謂如入行論云‧「由依人身舟‧度脫大苦\n"+
		"海。」是須依止‧以人所表善趣之身‧度諸有海‧趣妙種智。此復須經多生‧故能辦此身勝因\n"+
		"尸羅‧是道之根本。"
		,
		/*===========================第 151 頁===========================*/
		"　　若善趣身而不圓滿一切德相‧僅能成就一少分德‧雖修諸道進程微少。故定須一最\n"+
		"圓滿者‧此中護求寂等未圓學處‧猶非滿足‧故須勵力‧護比丘等圓滿學處。\n"+
		"　　有作是說‧護持尸羅‧若是為辦諸善趣者‧則近事等亦能獲得‧何須艱難‧義利微少‧諸\n"+
		"比丘等。又餘眾云‧若別解脫所有要義‧是為獲得阿羅漢故。然比丘者‧未滿二十‧則不堪受。\n"+
		"近住之身‧亦有能得阿羅漢者‧應讚其身。難行少義‧比丘何為。應當知此是全未知聖教扼\n"+
		"要‧極大亂言。應以下下律儀為依‧受上上者‧委重護持圓滿學處。已說於共下士道次‧淨修\n"+
		"心訖。\n"+
		"<b>菩提道次第廣論卷五終</b>"
		,
		/*===========================第 152 頁===========================*/
		"<b>菩提道次第廣論卷六</b>\n"+
		"<b><s>敬禮勝尊具大悲者足。</s></b>\n"+
		"　　如是隨念當死及思死後墮惡趣之道理‧能令其心厭捨現世‧於後善趣發生希求。次\n"+
		"由共同皈依及由定解黑白業果‧勵力斷惡修善‧則能獲得善趣妙位。然非以此便生喜足‧\n"+
		"是令發起共下士之意樂及發共中士之意樂‧厭捨生死一切事已‧依此因緣而發大菩提\n"+
		"心引入上士‧故於此中‧須修中士之意樂。所謂雖得人天勝位‧然仍未能出於行苦‧若即於\n"+
		"此執為樂性‧實為顛倒。故於真實全無安樂‧其後定當墮諸惡趣邊際惡故‧譬如有一無間\n"+
		"定當墮於懸險‧現於險崖暫為休息。入行論云‧「數數來善趣‧數受諸安樂‧死後墮惡趣‧常\n"+
		"受極大苦。」弟子書中亦云‧「諸常轉入生死輪‧而於暫憩思為樂‧彼定無主漸百返‧漂流\n"+
		"等非等諸趣。」故於善趣亦當厭患‧猶如惡趣。四百論云‧「諸智畏善趣‧等同奈洛迦‧不畏\n"+
		"三有者‧此中遍皆無。」攝功德寶中亦云‧「諸具貪生死意恆流轉。」弟子書中亦云。「如\n"+
		"如於諸趣中起樂想‧如是如是癡闇極重厚‧如如於諸趣中起苦想‧如是如是癡闇極微薄。"
		,
		/*===========================第 153 頁===========================*/
		"如如修習淨相極增長‧如是如是貪燄極熾燃。如如修習不淨極增長‧如是如是貪燄極殄\n"+
		"息。」此說從無始來‧執著三有盛事為樂‧增益串習諸淨妙相。能治此者‧若修苦性及不淨\n"+
		"相彼等便息‧若不修習便增癡貪‧轉諸有輪‧故修諸有過患為要。\n"+
		"<b><s>　中士道次修心分四‧<n>一</n>正修意樂‧<n>二</n>彼生起之量‧<n>三</n>除遣於此邪執分別‧<n>四</n>決擇能趣解脫道性。\n"+
		"　初中分二‧<n>一</n>明求解脫之心‧<n>二</n>發此之方便。　　今初</s></b>\n"+
		"　　言解脫者‧謂脫諸縛。此復業及煩惱‧謂於生死是能繫縛‧即由此二增上力故。若依界\n"+
		"判‧欲界等三。以趣分別‧謂天趣等或五或六。依生處門‧謂胎等四‧即於其中結蘊相續‧是繫\n"+
		"縛之體性。故從此脫‧即名解脫‧欲求得此‧即是希求解脫之心。又此解脫‧非為惑業諸行生\n"+
		"已息滅‧以諸生法‧於第二時定不安住‧不待修習能治等緣‧則不須勵力‧一切解脫便成過\n"+
		"失‧故若未生對治‧當於未來結生相續。由其發起對治力故‧結生相續即便止息。\n"+
		"　　第二發此之方便者。譬如欲得止息渴苦‧由於渴逼‧見非愛相。如是欲得‧諸取蘊苦寂\n"+
		"滅解脫‧亦由觀見‧取蘊苦性所有過患。故若未修三有過患‧於彼發起欲捨之心‧則於苦滅\n"+
		"不起欲得。四百論云‧「誰於此無厭‧彼豈敬寂靜‧如貪著自家‧難出此三有。」"
		,
		/*===========================第 154 頁===========================*/
		"<b><s>　希求解脫方便分二‧<n>一</n>由於苦集門中思惟‧<n>二</n>由於十二緣起思惟。　初中分二‧<n>一</n>思惟苦諦生死\n"+
		"　過患‧<n>二</n>思惟集諦流轉次第。　初中分二‧<n>一</n>顯示四諦先說苦諦之意趣‧<n>二</n>正修苦諦。　　今初</s></b>\n"+
		"　　集諦為因‧苦諦是彼之果‧故集是先‧果應是後。何故世尊不順彼義之次第而作是說‧\n"+
		"諸比丘此是苦聖諦‧此是集聖諦耶。大師於此違因果次第而宣說者‧以有至大修持扼要‧\n"+
		"故無過失。此復云何‧謂諸所化‧若於生死自先未發無倒希求解脫之心‧根本斷絕‧彼於解\n"+
		"脫云何能導。以諸所化無明闇覆‧於諸苦性生死圓滿‧執為安樂‧顛倒所誑。如四百論云‧\n"+
		"「此大苦海中‧悉無諸邊岸‧愚人沈此中‧云何不生畏。」先須為說此實是苦‧非有安樂‧說\n"+
		"多苦相令起厭離‧是故於初先說苦諦。此後自見墮於苦海‧則於苦海欲求脫離‧便見其苦\n"+
		"必須滅除。此復了知‧未止其因苦終不滅‧便念其因復為何等‧由此始能了知集諦‧是故集\n"+
		"諦於苦後說。次知生死眾苦‧皆由有漏業生‧其業復由煩惱發起‧煩惱根本是為我執‧便知\n"+
		"集諦。若見我執亦能止滅‧誓願現證滅苦之滅‧故於集後宣說滅諦。若爾開示苦諦之後‧即\n"+
		"於解脫發生希求‧苦諦之後應說滅諦。答云‧無過‧爾時雖有欲解脫心‧欣得寂滅眾苦之滅‧\n"+
		"然猶未明眾苦之因‧未見其因定能遮止‧故於解脫‧不能定執為所應得‧定當證滅。如是若"
		,
		/*===========================第 155 頁===========================*/
		"執定當證滅‧定當解脫‧便念何為趣解脫道‧趣向道諦‧是故道諦最後宣說。如是亦如相續\n"+
		"本母云‧「如病應知斷病因‧當得樂住應依藥‧苦因彼滅如是道‧應知應斷應證修。」如是\n"+
		"四諦‧大小乘中皆數宣說‧是為善逝總攝生死流轉‧生死還滅諸扼要處。故修解脫極為切\n"+
		"要‧亦是修行大嗢柁南‧故須如是次第引導學者。若未真實思惟苦諦‧厭捨生死‧則求解脫\n"+
		"亦唯虛言‧隨其所作悉成集諦。若未思集‧善知惑業生死根本‧猶如射箭未見鵠的‧是即斷\n"+
		"截正道扼要‧遂於非脫三有之道妄執為是‧勞而無果。若未能知應斷之苦集‧則亦不明靜\n"+
		"苦之解脫‧故欲求解脫‧亦唯增上慢耳。\n"+
		"<b><s>　第二正修苦分二‧<n>一</n>思惟生死總苦‧<n>二</n>思惟別苦。　初中分三‧<n>一</n>思惟八苦‧<n>二</n>思惟六苦‧<n>三</n>思惟三苦。\n"+
		"　　　今初</s></b>\n"+
		"　　如親友書云‧「仁和應厭於生死‧欲乏死病及老等‧無量眾苦出生處。」應如是修。此\n"+
		"中修習厭生死者‧謂思惟彼是眾苦根源。苦者‧謂已顯說欲乏等四‧等字攝四‧共為八種。此\n"+
		"八種苦‧是薄伽梵於多經中‧明苦諦時數所宣說。\n"+
		"　　修共中士一切所緣法類‧如共下時所說共法‧此亦應取。諸不共之修事‧若有慧力‧如"
		,
		/*===========================第 156 頁===========================*/
		"下所寫皆當善修。若慧劣弱‧可暫捨置所引教文‧唯當修習應時義體。此等雖是思擇而修‧\n"+
		"然除應修諸所緣外‧餘善不善無記等上‧悉不應散。當於所緣遮心掉等‧亦莫令隨昏睡沈\n"+
		"沒增上而轉‧當令其識極為明淨‧漸次修習。入行論云‧「雖長夜修行‧念誦苦行等‧若心散\n"+
		"亂修‧佛說無義利。」此說一切散亂善行‧其果微少。又修信大乘經云‧「善男子由此異門‧\n"+
		"說諸菩薩‧隨其所有信解大乘‧大乘出生‧當知一切‧皆是由其不散亂心‧正思法義之所出\n"+
		"生。」此中不散亂心者‧謂除善所緣‧不向餘散‧法及義者謂文及義。正思惟者‧謂以觀慧觀\n"+
		"察思擇‧由此顯示隨修一切功德之法‧皆須此二。故說引發三乘一切功德‧皆須二事‧一除\n"+
		"善所緣心不餘散‧專一而住真奢摩他或其隨順。二善觀察善所緣境‧如所有性盡所有性‧\n"+
		"毘缽舍那或其隨順。如是亦如解深密經云‧「慈氏‧若諸聲聞‧或諸菩薩‧或諸如來‧所有世\n"+
		"間及出世間一切善法‧當知皆是此奢摩他‧毘缽舍那所得之果。」此中若無真實止觀及\n"+
		"隨順二‧則三乘一切功德‧非定皆是止觀之果。\n"+
		"　　如是八苦之中‧初思惟生苦分五。眾苦所隨故生為苦者‧謂諸有情那洛迦中‧及諸一\n"+
		"向唯苦餓鬼‧並諸胎生卵生‧如是四類‧於初生時‧便有無量猛利苦受‧隨逐而生。粗重所隨"
		,
		/*===========================第 157 頁===========================*/
		"故生為苦者‧謂三界一切諸行‧為煩惱品粗重所隨‧無堪能性‧不自在轉。三界有情諸行生\n"+
		"起‧皆為煩惱品類粗重隨逐。總之由有生住增長‧煩惱種子隨逐流轉‧故無堪能安住善事‧\n"+
		"亦不如欲自在而轉。眾苦所依故生為苦者‧謂於三界既受生已‧由此因緣‧便能增長老病\n"+
		"死等‧無邊眾苦。煩惱所依故生為苦者‧謂於生死既受生已‧便於貪境瞋境癡境發生三毒‧\n"+
		"由此能令身心苦惱不靜‧不安樂住‧謂諸煩惱‧由種種門逼惱身心。不隨所欲離別法性故\n"+
		"生苦者‧謂一切生最後邊際咸不出死‧此非所愛‧此復能令唯受眾苦。故應思惟如是生時‧\n"+
		"眾苦俱生‧粗重俱生‧生復能引衰老病等煩惱死亡‧此亦能令受苦道理。\n"+
		"　　特住胎時受何苦者。如弟子書云‧「極猛臭穢極逼切‧最狹黑闇遍蔽覆‧住胎猶入那\n"+
		"洛迦‧身屈備受極重苦。」此諸文義‧如入胎經云‧「無量不淨‧周遍充滿‧多千蟲類之所依\n"+
		"處‧具足最極臭穢二門‧具足非一骨鏁穴孔‧復有便利清腦腦膜髓等不淨‧生藏之下熟藏\n"+
		"之上‧面向脊骨背對腹皮‧於月月中‧出諸血相以之資養‧母食食時‧以二齒鬘細嚼吞下‧其\n"+
		"所吞食‧下以口穢津涎浸爛‧上為腦膜之所纏裹‧猶如變吐。所有食味‧從母腹中入自臍孔‧\n"+
		"而為資長‧漸成羯羅藍‧頞部陀‧閉尸健南‧手足微動‧體相漸現。手足面等胎衣纏裹‧猶如糞"
		,
		/*===========================第 158 頁===========================*/
		"穢‧生臭變臭猛暴黑闇‧不淨坑中上下遊轉‧以諸苦酸粗鹹辣淡‧猶如火炭。食味所觸‧猶如\n"+
		"蒼蠅‧以不淨汁而為資養。如墜不淨‧臭穢熾然‧淤泥之中命根非堅。又母身內所有火力‧煎\n"+
		"炙遍炙極遍煎炙‧燒熱遍熱極遍燒熱‧燒燃遍燃極遍燒燃‧受諸猛利粗惡難忍‧非所悅意\n"+
		"極大苦受。如如其母轉動‧遍動極遍轉動‧如是如是如被五縛‧亦如投擲煻煨坑中‧受諸猛\n"+
		"利粗惡難忍‧非所悅意‧難以為喻‧極大苦受。」如是其母‧若受飲食太多太少及食太膩太\n"+
		"乾太冷太熱‧鹹淡苦酸及太甘辛‧若行欲行‧若太急走‧若跳若倒‧若住火前‧或蹲居坐‧亦說\n"+
		"於胎起大痛苦。生藏上壓熟藏下刺‧如被五縛插之尖摽。從胎產時及產出時‧所有眾苦‧亦\n"+
		"如弟子書云‧「此漸如硬壓油具‧壓迫其次方得生‧然未爾時即捨命‧唯是受苦業力強。住\n"+
		"不淨中顛倒身‧濕爛裹胎極臭穢‧猛逼切痛如潰瘡‧猶如變吐宿念捨。」此諸文義‧如入胎\n"+
		"經云‧「次彼漸生一切肢節‧從其糞廁腐爛滴墜‧不淨暴惡生臭變臭‧黑闇可怖‧糞尿熏粘‧\n"+
		"臭氣垢穢‧血水常流‧瘡門之中‧由其先業異熟生風‧吹足向上令頭向下‧兩手縮屈被二骨\n"+
		"輪‧逼迫遍迫周遍逼迫‧由諸粗猛難忍非悅‧最大苦受令其身分悉皆青瘀‧猶如初瘡‧難可\n"+
		"觸著‧身一切根悉皆楚痛‧極穢胎垢遍粘其身‧由乾渴故‧令其唇喉及以心臟悉皆枯燥‧住"
		,
		/*===========================第 159 頁===========================*/
		"此迫迮難忍苦處。此由因緣增上‧宿業異熟生風吹促至極艱辛‧始得產出。生已無間‧被外\n"+
		"風觸如割塗灰‧手衣觸時如利劍割‧當受粗猛難忍非悅極大苦受。」又說如牛剝皮‧被蟲\n"+
		"所食‧及如癩人遍身潰爛‧加諸鞭撻極受楚切。又產已無間‧取懷抱等及寒熱觸‧亦當受諸\n"+
		"粗猛難忍‧非悅意苦。八苦之中‧特於此初及於最後‧須慇重修。故如前說‧當以觀慧數數觀\n"+
		"察‧而善修習。\n"+
		"　　思惟老苦分五。盛色衰退者‧謂腰曲如弓‧頭白如艾‧額如砧板‧皺紋充滿‧由如是等‧衰\n"+
		"其容貌令成非愛。氣力衰退者‧謂於坐時‧如袋斷索‧起如拔樹‧語言遲鈍‧行步緩慢等。諸根\n"+
		"衰退者‧謂眼等不能明見色等‧重忘念等‧減念力等。受用境界衰退者‧謂受飲食等‧極難消\n"+
		"化‧又無堪能受諸欲塵。壽量衰退苦者‧謂壽多滅盡‧速趣於死‧應當數數思惟此等。廣大遊\n"+
		"戲經中亦云‧「由老令老壞少壯‧猶如大樹被雷擊‧由老令耄朽屋畏‧能仁快說老出離。諸\n"+
		"男女眾由老枯‧如猛風摧娑羅林‧老奪精進及勇勢‧譬如士夫陷淤泥。老令妙色成醜陋‧老\n"+
		"奪威德奪勢力‧老奪安樂作毀訾‧老奪光澤而令死。」慬哦瓦云‧「死苦雖重‧而時短促‧此\n"+
		"老最重。」迦瑪瓦云‧「老漸漸至‧故稍可忍‧若一時頓至‧實無能忍之方便。」"
		,
		/*===========================第 160 頁===========================*/
		"　　思惟病苦分五。身性變壞者‧謂身肉銷瘦‧皮膚乾枯等。增長憂苦多住憂苦者‧謂身中\n"+
		"水等諸界‧分不平均增減錯亂‧身生逼惱‧心起憂痛而度晝夜。不能受用悅意境界者‧謂若\n"+
		"有云‧諸可意境於病有損‧雖欲享受而不自在‧如是諸威儀道‧亦多不能隨欲。諸非可意境\n"+
		"界受用‧雖非所欲須強受用者‧謂諸非悅飲食藥等‧須強飲用。如是火炙及刀割等諸粗苦\n"+
		"事‧皆須習近。速離命根者‧謂見病難治‧便生痛苦‧當於此等審細思惟。廣大遊戲經云‧「多\n"+
		"百種病及病苦‧如人逐鹿逼眾生‧當觀老病壞眾生‧惟願速說苦出離。譬如冬季大風雪‧草\n"+
		"木林藥奪光榮‧如是病奪眾生榮‧衰損諸根及色力。令盡財穀及大藏‧病常輕蔑諸眾生‧作\n"+
		"諸損惱瞋諸愛‧周遍炎熱如空日。」\n"+
		"　　思惟死苦分五。謂捨離圓滿可愛財位‧捨離圓滿可愛親族‧捨離圓滿可愛朋翼‧捨離\n"+
		"圓滿可愛身體‧死時當受猛利憂苦‧乃至意未厭此諸苦‧當數思惟。前四為苦之理者‧謂見\n"+
		"當離此四圓滿而發憂苦。廣大遊戲經亦云‧「若死若沒死沒時‧永離親愛諸眾生‧不還非\n"+
		"可重會遇‧如樹落葉同逝水。死令王者無自在‧死劫猶如水漂木‧獨去無伴無二人‧自業具\n"+
		"果無自在。死擒多百諸含靈‧如海鯨吞諸眾生‧猶龍金翅象遇獅‧同草木聚遭猛火。」"
		,
		/*===========================第 161 頁===========================*/
		"　　思惟怨憎會苦分五。謂如遇怨敵‧便生憂苦。畏其制罰。怖畏惡名‧遭非讚頌。畏苦惱死。\n"+
		"違正法故‧畏懼死後‧墮諸惡趣。當思此等。\n"+
		"　　思惟愛別離苦分五。謂若捨離最愛親等‧由此令心發生憂慼。語生愁歎。身生擾惱。念\n"+
		"彼功德‧思戀因緣令意熱惱。應受用等有所缺乏。當思此等。\n"+
		"　　思惟所欲求不得苦分五。如愛別離。求不得者‧謂務農業秋實不成‧及營商賈未獲利\n"+
		"等‧由於所欲勵力追求而未得故‧灰心憂苦。\n"+
		"　　思惟宣說五種取蘊總為苦義分五。謂是當成眾苦之器‧及依已成眾苦之器‧是苦苦\n"+
		"器‧是壞苦器‧是行苦器。於此諸苦當數思惟。其中初者‧謂依受此取蘊‧能引來生以後眾苦。\n"+
		"第二謂依已成之蘊‧為老病等之所依止。第三第四‧謂彼二苦粗重隨逐能生彼二。第五謂\n"+
		"初成取蘊‧即便生為行苦自性‧以一切行為宿惑業他自在轉‧是行苦故。於三苦時此當詳\n"+
		"說。若於生死取蘊自性‧未能發起真實厭離‧則其真實求解脫心‧無發生處。於諸有情流轉\n"+
		"生死‧亦無方便能起大悲‧故隨轉趣大小何乘‧然此意樂極為切要。發生此者‧亦隨當從無\n"+
		"垢聖語‧如量解釋‧先正尋求清淨了解。次須長時觀擇修習‧引發其心猛利變動。故薄伽梵"
		,
		/*===========================第 162 頁===========================*/
		"令知苦諦生死過患‧宣說八苦‧所有密意‧如聖無著極善決擇而為宣釋。如博朵瓦云‧「於\n"+
		"六趣中‧隨生何趣‧其後發生病痛死等‧眾苦惱者‧是病者病‧是死者死‧非彼不應‧忽爾而起。\n"+
		"是生死相‧或生死性。住生死時‧必不能越。我等於此‧若起厭離‧須斷其生‧此須斷因。」當於\n"+
		"前說‧生老病死等已生眾苦‧如是思惟。\n"+
		"　　第二思惟六苦者。親友書釋宣說七苦‧其最後者是別過患‧故於此中當思六種。其中\n"+
		"無定過患者‧謂於生死流轉之時‧父母等親‧於他生中轉為怨敵‧諸怨敵等轉成親屬‧如是\n"+
		"父轉為子‧子轉為父。母轉為妻‧妻轉為母等。唯是次第輾轉流轉‧是故全無可憑信處。親友\n"+
		"書云‧「父轉為子母為妻‧怨仇眾生轉為親‧及其返此而死歿‧故於生死全無定。」即現法\n"+
		"中亦復輾轉‧互為親怨。如妙臂經云‧「有時怨敵轉為親‧親愛如是亦為怨‧如是一類為中\n"+
		"庸‧即諸中庸復為怨。如是亦復為親愛‧具慧了知終莫貪‧於親當止愛分別‧於心善法安樂\n"+
		"住。」如是修習‧破於親怨分別黨類而起貪瞋‧觀生死法‧任何全無安心之處‧應起厭離。\n"+
		"　　無飽足過患者。如云‧「一一曾飲諸乳汁‧過於四海於今後‧隨異生性流轉者‧尚須多\n"+
		"飲過於彼。」謂當思惟一一有情‧飲母乳酪昔飲幾許‧今後若不學解脫道‧當飲幾何。此是"
		,
		/*===========================第 163 頁===========================*/
		"略喻‧更當思惟生死之中‧盛事苦事‧無所未經‧令心厭離。\n"+
		"　　若謂受樂令意滿足‧然三有樂‧任受幾多‧非但無飽‧後後轉復增長貪愛‧由此長夜馳\n"+
		"騁生死‧經無量劫‧受諸至極難忍大苦‧然其安樂不及一分。如親友書云‧「如諸癩人為蟲\n"+
		"癢‧為安樂故雖近火‧然不能息應了知‧貪著諸欲亦如是。」攝波羅蜜多論云‧「獲得此安\n"+
		"樂‧猶如一日享‧多累仍不足‧重疾莫過此。」弟子書亦云‧「豈有百返未經趣‧豈有昔未多\n"+
		"受樂‧未得吉祥如白拂‧豈有是事反增貪。豈有昔未多經苦‧眾生無欲能飽滿‧無有情腹未\n"+
		"曾臥‧然何生死不離貪。」應如是思。又如除憂經說而思極能厭離‧如云‧「數於地獄中‧所\n"+
		"飲諸烊銅‧雖大海中水‧非有爾許量。生諸犬豕中‧所食諸不淨‧其量極超過‧須彌山王量。又\n"+
		"於生死中‧由離諸親友‧所泣諸淚滴‧非海能為器。由互相鬥諍‧積所截頭首‧如是高聳量‧出\n"+
		"過梵世間。為蟲極飢虛‧所噉諸土糞‧於大乳海中‧充滿極高盛。」如是又如華嚴經云‧「汝\n"+
		"應憶念為諸欲‧徒耗諸身前邊際‧今求菩提具禁戒‧由禁於此摧諸欲。汝應憶念為諸欲‧徒\n"+
		"耗諸身前邊際‧未能承事恆沙佛‧未從佛聞如是語。」謂盡所得三有盛事‧悉皆欺誑‧領受\n"+
		"無量無義大苦。如前唐捐無量色身‧皆當憶念‧若後仍不策勵勤修‧更當如是‧思惟此理‧令\n"+
		"起厭離。慬哦瓦云‧「覺敦巴從無始來‧曾受何身‧然皆未修大乘正法‧猶如今日‧故須策"
		,
		/*===========================第 164 頁===========================*/
		"勵。」又如桑樸瓦云‧「此生死中須多仰覆‧此於心中實覺不安。」乃至未能起心如此‧須\n"+
		"勤思惟‧縱起亦當恆常修習。\n"+
		"　　數數捨身過患者。如云‧「一一身體諸骨聚‧超過幾多須彌峰。」謂一一有情受身之\n"+
		"骨‧若不爛壞‧多於須彌。\n"+
		"　　數數結生過患者。如云‧「雖將地丸如柏子‧數母邊際未能盡。」昔諸先覺解釋此義‧謂\n"+
		"一有情為母之量‧此非正義。即此釋中引經文云‧「諸比丘‧譬如有人‧從此大地執取諸丸‧量\n"+
		"如柏子‧作是數云‧『此是我母‧此是我母之母。』而下其丸。諸比丘‧此大地泥速可窮盡‧然諸\n"+
		"人母輾轉非爾。」是顯自母及彼母等母輾轉次第‧此論亦說母邊際故。此成厭患因之理者‧\n"+
		"如四百論云‧「若時雖一果‧初因非可見‧見一亦增多‧爾時何不畏。」其釋亦云‧「此顯由諸\n"+
		"難可度量稠林相續‧令極難行生死大野‧常應厭患‧隨順於此‧當如理修。」如此當知。\n"+
		"　　數數高下過患者。如云‧「既成百施世應供‧業增上故復墮地‧既滿轉輪聖王已‧復於\n"+
		"生死為奴婢。天趣天女乳腰柔‧長受安樂妙觸已‧後墮地獄鐵輪中‧當受粗磨割裂觸。長時\n"+
		"安住須彌頂‧安足陷下受安樂‧後遊煻煨屍泥中‧當念眾苦極難忍。天女隨逐受歡喜‧遊戲"
		,
		/*===========================第 165 頁===========================*/
		"端妙歡喜園‧後當住止劍葉林‧獲割耳鼻刖手足。天女殊妙如金蓮‧共同游泳徐流池‧後墮\n"+
		"地獄當趣入‧難忍灰水無極河。雖得天界大欲樂‧及諸梵天離欲樂‧後墮無間為火薪‧忍受\n"+
		"眾苦無間絕。得為日月自身光‧照曜一切諸世間‧後往極黑陰闇處‧自手伸舒亦莫睹。」磨\n"+
		"等三鐵輪者‧如其次第‧謂於眾合‧黑繩‧燒熱三中而有。天女隨逐者‧謂為天女之所依附。天\n"+
		"界欲樂者‧謂忉利以上欲天所有。日月光者‧是如世間共許而說‧未分能依及所依處‧若分\n"+
		"別說‧乃是彼二宮殿之光。此等為喻‧當思一切從高墮下所有道理‧厭患三有‧以其三有一\n"+
		"切盛事‧最後邊際‧衰所攝故。此如調伏阿笈摩云‧「積集皆銷散‧崇高必墮落‧合會終別離‧\n"+
		"有命咸歸死。」\n"+
		"　　無伴過患者。如云‧「若能了知如是過‧願取三福燈光明‧獨自當趣雖日月‧難破無邊\n"+
		"黑闇中。」了知過者‧謂當了知如前所說‧須如是死‧願取福光。三種福者‧謂三門善事‧或施\n"+
		"所生等三種善事。無邊黑闇者‧謂無明黑闇。無伴而趣者‧如入行論云‧「獨生此一身‧俱生\n"+
		"諸骨肉‧壞時尚各散‧何況餘親友。生時獨自生‧死時還獨死‧他不取苦分‧何須作障親。」如\n"+
		"是六苦總攝為三。謂於生死中‧無保信處。受彼安樂‧終無飽期。無始而轉。初中有四‧一於所"
		,
		/*===========================第 166 頁===========================*/
		"得身不可保信者‧謂身數數捨。二作諸前益不可保信者‧謂無決定。三於得盛事不可保信\n"+
		"者‧謂高下變易。四於諸共住不可保信者‧謂無伴而往。第三者謂數數結生‧輾轉受生不見\n"+
		"邊際‧如是總攝亦當思惟。\n"+
		"　　第三修三苦者。謂譬如極熱或瘡或癰‧若於其上灑以冷水‧似為安樂‧於生死中所有\n"+
		"樂受‧若壞滅時‧還起眾苦‧故名壞苦。此復非唯其受‧即此相應‧餘心心所及為所緣諸有漏\n"+
		"境‧皆是壞苦。又如熱癰逼切‧觸熱水等變異觸時‧起極楚痛。如是當知苦受‧隨纔生起‧便能\n"+
		"觸惱或身或心‧故名苦苦‧譬如腎痛。此復如前‧非唯其受。又如熱癰‧俱未觸會二觸之時‧有\n"+
		"漏捨受‧為諸粗重之所隨逐‧故名行苦。此亦如前‧非唯其受‧此由先業煩惱自在而轉‧故名\n"+
		"為苦‧及為能發後煩惱種‧所隨逐故‧名為遍行粗重所隨。如是若起樂受‧貪欲增長。若起苦\n"+
		"受‧瞋恚增長。苦樂俱非隨粗重身‧則於無常執為常等‧愚癡增長。其中貪欲能感當來於五\n"+
		"趣中生等眾苦。瞋於現法起憂慼等‧於後法中感惡趣苦。癡於前二所感二苦隨逐不捨。故\n"+
		"於樂受‧應觀為苦滅除貪欲。於諸苦受‧應作是思‧此蘊即是眾苦因緣‧苦從此生‧猶如毒箭‧\n"+
		"滅除瞋恚。於諸捨受‧應觀無常銷滅為性‧滅除愚癡。不於三受為三毒因‧此如瑜伽師地及"
		,
		/*===========================第 167 頁===========================*/
		"攝決擇意趣而說。如負重擔‧隨其重擔當負幾久‧便有爾許不樂‧取蘊重擔亦爾‧乃至執持\n"+
		"爾時受苦‧以此蘊中有苦煩惱粗重安住‧故為行苦。既有此已‧雖於現在苦受未生‧然其無\n"+
		"間由種種門能起眾苦‧故此行苦‧遍一切苦及是所餘二苦根本‧故應於此多修厭離。\n"+
		"　　又能增貪現前樂受‧多是於苦‧漸息滅位妄起樂覺‧全無不待除苦所顯自性之樂。譬\n"+
		"如太走為苦‧略為住息遂生樂覺。現見此是先生大苦‧漸息滅時樂漸次起‧故非性樂。若太\n"+
		"久坐‧仍復如前‧生眾苦故。若是性樂之因者‧應如苦因‧隨其習近‧其苦漸增‧如是習近行住\n"+
		"坐臥‧飲食日陰等‧亦應隨其幾久習近‧便有爾許安樂漸起‧現見太久唯生苦故。如是亦如\n"+
		"入胎經云‧「難陀‧行住坐臥諸威儀中‧應當了知別別是苦。諸靜慮師‧應觀彼彼威儀自性‧\n"+
		"若行度日‧不住不坐不臥‧彼則於行‧唯別受苦。別別領受猛性‧粗性‧難可忍性‧非悅意性。非\n"+
		"於其行‧起安樂想。」餘三威儀亦如是說。「難陀‧然由彼彼威儀之苦‧暫間斷故‧遂於餘餘\n"+
		"新生眾苦‧妄起樂想。難陀‧生唯苦生‧滅唯苦滅‧生唯行生‧滅唯行滅。」四百論亦云‧「如安\n"+
		"樂增長‧現見反成苦‧如是苦增長‧然非可轉樂。」\n"+
		"　　第二思惟別苦有六‧三惡趣苦已如前說。人苦者‧謂飢渴寒熱‧不可意觸‧追求勞苦‧復"
		,
		/*===========================第 168 頁===========================*/
		"有生老病死等七‧如前當知。又如資糧論云‧「惡趣苦無餘‧人中亦現有‧苦逼等地獄‧貧如\n"+
		"琰魔世。此中旁生苦‧強力於羸弱‧制罰及損害‧相續如暴流。有因貧乏起‧餘從不足生‧追求\n"+
		"難忍苦‧一切謀略殺。」四百論云‧「勝者為意苦‧庸流從身生‧二苦日日中‧能壞此世間。」\n"+
		"　　非天苦者。如親友書云‧「諸非天中意苦重‧由其性瞋天德故‧此等由其趣性障‧具慧\n"+
		"不能見聖諦。」此由不忍‧嫉天富樂‧令意熱惱‧由此因緣‧與天鬥諍‧受割裂等傷身眾苦。此\n"+
		"等雖具智慧‧然由異熟障故‧於彼身中不堪見諦。念住經說此為旁生‧瑜伽師地論說為天\n"+
		"趣。\n"+
		"<b><s>　思惟天苦分二‧<n>一</n>欲天三苦。<n>二</n>上二界粗重苦。　　今初</s></b>\n"+
		"　　初死墮苦中有二‧死歿苦者‧如云‧「諸天趣樂雖極大‧然其死苦大於彼‧如是思已諸\n"+
		"智者‧莫愛有盡天趣樂。」謂較昔受天欲生樂‧將臨歿時‧五死相現‧所起痛苦‧極重於彼。五\n"+
		"死相者‧即如彼云‧「身色變為不可愛‧不樂本座‧華鬘萎‧衣服垢染‧身出汗‧是於先時所不\n"+
		"出。天趣報死五死相‧起於住天界諸天‧等同地上諸人中‧傳報當死諸死相。」墮下處苦者‧\n"+
		"如云‧「從天世間死歿已‧設若全無少餘善‧彼無自在往旁生‧餓鬼地獄隨一處。」悚慄苦"
		,
		/*===========================第 169 頁===========================*/
		"者‧謂由有成就廣大福聚及上妙五欲天子生時‧諸薄福天子‧見已惶怖‧由此因緣受大憂\n"+
		"苦。斫裂殺害苦者‧謂天與非天鬥諍之時‧受斷支節‧破裂其身及殺害苦‧若斷其頭‧即便殞\n"+
		"歿‧傷身斷節‧續還如故。驅擯者‧謂諸具足強力諸天‧纔一發憤‧諸劣天子‧便被驅擯出其自\n"+
		"宮。又如資糧論云‧「所有受欲天‧彼亦無樂心‧遭欲貪熾燃‧內火而燒煮。若諸心散亂‧彼豈\n"+
		"有安樂‧非於無散心‧剎那能自在。散逸擾亂性‧終不能寂滅‧等同有薪火‧遍受大風吹。」又\n"+
		"云‧「如病愈未久‧食所不宜食。」\n"+
		"　　色及無色上界諸天‧雖無此諸苦‧然煩惱隨逐‧有諸障礙‧於死於住悉無自在‧故彼亦\n"+
		"由粗重為苦。又如資糧論云‧「色無色諸天‧超越於苦苦‧以定樂為性‧住劫不傾動。然非畢\n"+
		"竟脫‧從彼仍當墮‧似已得超越‧惡趣苦暴流‧雖勵不久住‧等同空飛鳥‧如童力射箭‧墮落為\n"+
		"邊際。如久然諸燈‧剎那剎那壞‧諸行變壞苦‧仍當極侵惱。」\n"+
		"　　如是思惟五趣六趣‧總別諸苦‧厭患生死意欲出離‧便當觀察其因‧念云如是生死以\n"+
		"何為因。\n"+
		"<b><s>　第二‧由集諦門思惟流轉生死次第分三‧<n>一</n>煩惱發生之理‧<n>二</n>彼集業之理‧<n>三</n>死沒及結生之理。</s></b>"
		,
		/*===========================第 170 頁===========================*/
		"<b><s>　今初</s></b>\n"+
		"　　成辦生死之因‧雖俱須惑業‧然以煩惱而為上首。若無煩惱‧雖有宿業超諸量數‧然如\n"+
		"種子‧若無潤澤及其土等‧定不發芽。如是諸業缺俱有緣‧亦定不能發苦芽故。又若有煩惱‧\n"+
		"縱無宿業‧無間新集‧取後有故。如是亦如釋量論云‧「超度諸有愛‧非餘業能引‧滅盡俱有\n"+
		"故。」又云‧「若有愛‧仍當出生故。」是故開示煩惱對治極為重要。此復賴於先知煩惱‧故\n"+
		"於煩惱‧應當善巧。\n"+
		"<b><s>　此中分四‧<n>一</n>正明煩惱‧<n>二</n>如何生起之次第‧<n>三</n>煩惱之因‧<n>四</n>煩惱過患。　　今初</s></b>\n"+
		"　　煩惱總相者。如集論云‧「若有法生‧即便生起極不靜相。由彼生故令心相續‧極不靜\n"+
		"起‧是煩惱相。」謂若何生‧令心相續‧極不寂靜。\n"+
		"　　各別相中有十煩惱。貪者‧謂緣內外可意淨境‧隨逐耽著‧如油著布難以洗除。此亦耽\n"+
		"戀自所緣境‧與彼所緣難以分離。瞋者‧謂緣諸有情及苦‧苦具‧謂刀杖荊刺等‧發恚惱心‧發\n"+
		"粗猛心‧於彼諸境思作無義。慢者‧謂依止薩迦耶見‧緣內外之高下好惡‧令心高舉‧高相隨\n"+
		"轉。無明者‧謂於四諦‧業果‧三寶自性‧心不明了‧染污無知。疑者‧謂緣諦等三法‧念其有耶無"
		,
		/*===========================第 171 頁===========================*/
		"耶‧是耶非耶。壞聚見者‧謂緣取蘊‧計我我所‧染慧為性‧我我所見。其中壞是無常‧聚是眾多‧\n"+
		"為欲顯此所見之事‧唯是無常‧非一之法‧全無常一補特伽羅‧故為立名曰壞聚見。邊執見\n"+
		"者‧謂緣薩迦耶見所執之我‧計為常恆‧或見斷滅‧無從此沒‧結生當來‧染慧為性。見取者‧謂\n"+
		"緣薩迦耶見‧邊見‧邪見‧三中隨一‧及彼所依見者之蘊‧執為最勝‧染慧為性。戒禁取者‧謂緣\n"+
		"壞戒‧可捨之戒‧及諸行狀軌則‧身語定轉‧所有邪禁及緣彼等所依之蘊‧見為能淨罪惡‧能\n"+
		"解煩惱‧能出生死‧染慧為性。邪見者‧謂謗無前世後世及業果等‧或計自在及勝性等為眾\n"+
		"生因‧染慧為性。此十煩惱‧是如集論‧瑜伽師地‧釋五蘊論‧所出而說。\n"+
		"　　第二如何生起次第者。如許薩迦耶見與無明異者‧譬如盤繩‧略降黑闇‧於繩實體不\n"+
		"能明了‧於彼遂起執蛇之覺。如是障蔽明見蘊體‧由無明闇誤蘊為我‧從此發生諸餘煩惱。\n"+
		"如許彼二為一‧即薩迦耶見為煩惱根本。此復由其薩迦耶見‧執為我已‧遂即分判自他差\n"+
		"別。如是分已‧貪著自黨‧瞋恚他品‧緣我高舉‧執我常斷‧於我見等及彼相屬所有惡行‧執為\n"+
		"第一。如是便於開示無我之大師‧及師所說業果‧四諦‧三寶等法‧邪見謂無‧或復生疑‧為有\n"+
		"為無‧是耶非耶‧如釋量云‧「有我知有他‧執瞋自他分‧與此等係屬‧生一切過失。」"
		,
		/*===========================第 172 頁===========================*/
		"　　第三能生煩惱之因分六。所依者‧謂煩惱之隨眠。所緣者‧謂順生煩惱境界現前。猥雜\n"+
		"者‧謂隨學惡友非善士夫。言教者‧謂聽聞邪法。串習者‧謂增長煩惱昔串習力。作意者‧謂妄\n"+
		"增益愛非愛相‧及於無常妄執常等非理作意。\n"+
		"　　第四過患者。謂煩惱纔生‧先能令心雜染‧倒取所緣‧堅固隨眠‧同類煩惱‧令不間斷。於\n"+
		"自於他於俱損害‧於現於後於俱生罪‧領受苦憂感生等苦。遠離涅槃‧退失善法‧衰損受用‧\n"+
		"赴大眾中‧怯懼無樂及無無畏‧一切方所惡名流布‧大師護法聖者呵責‧臨終憂悔‧死墮惡\n"+
		"趣‧不能獲得自己義利。莊嚴經論云‧「煩惱壞自壞他壞淨戒‧退損失利護法大師呵‧鬥諍\n"+
		"惡名他世生難處‧失得未得意獲大憂苦。」入行論亦云‧「瞋愛等怨敵‧全無手足等‧非勇\n"+
		"智如何‧彼令我如僕‧安住我心中‧歡樂反損我‧於此忍不憤‧忍非處應呵。一切天非天‧設與\n"+
		"我作敵‧彼不能令入‧無間大火中。此大力惑敵‧若遇須彌峰‧且不留灰塵‧能剎那擲我。如我\n"+
		"煩惱敵‧長時無始終‧餘敵皆不能‧至如是久遠。若隨順承事‧悉為作利樂‧若親諸煩惱‧返作\n"+
		"苦損惱。」此說過患‧皆當了知。又如阿蘭若師云‧「斷除煩惱‧須知煩惱過患‧體相‧對治‧生\n"+
		"因。由知過患‧觀為過失‧計為怨敵‧若不知過患‧則不知為怨敵‧故如莊嚴經論及入行論所"
		,
		/*===========================第 173 頁===========================*/
		"說思惟。」又云‧「知煩惱相者‧亦須聽對法‧下至當聽五蘊差別論‧了知根本及隨煩惱。於\n"+
		"心相續‧若貪瞋等‧隨一起時便能認識‧此即是彼‧他今生起‧與煩惱鬥。」須如是知。\n"+
		"<b><s>　第二彼集業之理分二‧<n>一</n>正明所集之業‧<n>二</n>如何集業之理。　初中分二‧<n>一</n>思業‧<n>二</n>思已業。　　今\n"+
		"　初</s></b>\n"+
		"　　如集論云‧「云何為思‧謂令心造作意業‧於善不善及無記中‧役策心為業。」謂令自\n"+
		"相應心‧於境轉動之心所意業。第二者謂彼思發起身語之業‧俱舍論云‧「業謂思彼起‧思\n"+
		"即是意業‧彼起身語業。」於身語業分為二種‧有表‧無表。婆沙師許唯是有色‧世親論師破\n"+
		"之‧許為與身語表俱轉之思‧故二種業俱說為思。總業有三‧謂善‧不善‧無記‧此說初二。善業\n"+
		"有二‧謂有漏‧無漏‧此明有漏。其中復二‧謂聖人相續中有‧及異生相續中有‧此說後者。其不\n"+
		"善業者‧謂非福業。福業者‧謂欲界所攝善業。不動業者‧謂色‧無色地所攝有漏善業。如是亦\n"+
		"如俱舍論云‧「福欲界善業‧不動從上起。」何故名為不動業耶‧謂如欲界中‧應於天身成\n"+
		"熟之業‧有於人畜餓鬼之身‧而得成熟‧果是可動。如是上界‧應於此地成熟之業‧除此地外\n"+
		"不於餘熟‧故名不動。俱舍論云‧「由於彼地中‧業熟不動故。」"
		,
		/*===========================第 174 頁===========================*/
		"　　第二集業之理者。總諸聖者‧於諸善業發生增長。預流一來‧亦有造集不善業者‧然諸\n"+
		"聖者‧定不積集善趣惡趣引生死業。中觀論云‧「生死本為行‧故智者不造‧故愚為造者‧非\n"+
		"智見性故。」世親論師亦云‧「見諦無能引。」是故乃至自隨補特伽羅我執而轉‧爾時容\n"+
		"造能引之業。現證無我真實義已‧雖於生死由業煩惱增上受生‧然不新造能引之業。預流\n"+
		"一來‧亦能不忍斷除我執‧譬諸強力制伏羸劣‧瑜伽師地論作此說故。是故造集能引生死\n"+
		"業者‧謂住大乘加行道上品‧世第一法以下‧一切異生。\n"+
		"　　如是若由染污無明薩迦耶見‧他自在轉‧三門作行殺等不善‧集非福業。若行捨施守\n"+
		"護戒等欲界善法‧是集福業。若修靜慮無色地攝奢摩他等‧是為積集諸不動業。若爾於三\n"+
		"有中一切盛事‧見為過患‧希求解脫欲樂‧發起修眾善業‧又於無我義如理觀察慧相應思\n"+
		"諸善淨業‧是否集諦生死因耶。總資糧道‧加行道者‧雖集庸常能引之業‧然由如斯意樂所\n"+
		"起‧及於無我觀慧相應諸善淨業‧是後有愛能對治品‧與生死本我執行相‧相違而轉‧故非\n"+
		"尋常真能引之集諦。然能隨順引後有集‧故立為集攝。如是亦如攝決擇分云‧「問‧若世間\n"+
		"諸法‧厭患後有‧能背後有‧引出世道‧彼等何故集諦所攝。答‧雖彼自性‧厭背後有‧然能隨順"
		,
		/*===========================第 175 頁===========================*/
		"後有身語意妙行‧是故當知是集諦攝。」此說善思生死過患‧厭離生死意樂所起‧引出世\n"+
		"道諸善淨法‧為隨順集。故當勵力‧引此意樂及無我慧。\n"+
		"　　由是因緣‧若未由多異門‧觀察修習生死過患‧於生死盛事破除貪愛‧獲得對治。又未\n"+
		"如理以正觀慧觀無我義‧又離修習二菩提心。餘諸善行‧唯除少數依福田力‧悉是庸常集\n"+
		"攝‧轉生死輪。\n"+
		"　　又增長業分為二類‧一為樂受義故增長‧二為捨受義故增長。初中復二‧一為受用色\n"+
		"聲等欲塵‧所生諸樂。二於外樂‧厭捨貪著‧為定生樂受‧而增長業。初復有二‧一正緣未死以\n"+
		"前現法樂故‧造非福業。二正緣來世諸欲樂故‧增長福業。正緣定生樂受者‧謂集能生第三\n"+
		"靜慮‧下至初禪諸不動業。若於諸欲捨離貪著‧復由樂受令意厭患‧為捨受故而作業者‧謂\n"+
		"集能生第四靜慮‧乃至有頂諸不動業。此是世親論師意趣。由此正理‧若普厭棄一切諸有‧\n"+
		"為解脫故三門行善‧則能漸遠生死‧漸近涅槃。\n"+
		"<b><s>　第三死歿及結生之理分五‧<n>一</n>死緣‧<n>二</n>死心‧<n>三</n>從何攝煖‧<n>四</n>死後成辦中有之理‧<n>五</n>次於生有受生道\n"+
		"　理。　　今初</s></b>\n"+
		"　　壽盡死者‧謂如宿業所引壽量‧一切罄盡而死‧是為時死。福盡死者‧謂如無資具死。未"
		,
		/*===========================第 176 頁===========================*/
		"捨不平等死者‧謂如經說‧壽未窮盡‧有九死因緣‧謂食無度量‧食所不宜‧不消復食‧生而不\n"+
		"吐‧熟而持之‧不近醫藥‧不知於己若損若益‧非時非量‧行非梵行。\n"+
		"　　第二‧死心分三。善心死者‧謂由自憶‧或他令憶‧乃至粗想現行以來‧信等善法現行於\n"+
		"心。又行善不善補特伽羅將命終時‧或自憶念‧或他令憶‧昔於何法多所串習彼便力強‧由\n"+
		"此令心於彼流注‧餘皆忘失。若於二事平等串習‧先憶何法便不退捨‧不起餘心。又作善者\n"+
		"如從闇處趣向光明‧臨命終時‧猶如夢中‧見有種種可意之色‧非不可愛‧安祥而逝。臨死其\n"+
		"身無重苦受。造妙業者‧解肢節苦‧亦極輕微。\n"+
		"　　不善心死者‧謂由自憶或他令憶‧乃至粗想現行以來‧追念貪等現行不善‧臨死其身\n"+
		"受重苦受。造不善業當死之時‧現受先造不善業果‧所有前相‧謂如夢中多怪色相‧於彼顯\n"+
		"現‧如從光明趣向闇處。諸造上品不善業者‧由見彼等不可愛相‧身毛恐竪手足紛亂‧遂失\n"+
		"便穢‧捫摸虛空‧翻睛咀沫‧此等相現。若造中品不善‧彼諸相中有現不現‧設有不俱。作惡業\n"+
		"者‧解肢節苦‧最極尤重。又解肢節‧除天‧那落迦‧所餘生處‧一切皆有。又一切人臨命終時‧乃\n"+
		"至未到昏昧想位‧長夜所習我愛現行‧復由我愛增上力故‧謂我當無‧便愛自身‧此即能成"
		,
		/*===========================第 177 頁===========================*/
		"中有之因。此中預流及一來者‧雖其我愛亦復現行‧然慧觀察制而不著‧譬如強力制伏羸\n"+
		"劣‧諸不還者我愛不行。\n"+
		"　　無記心死者‧謂行善不善者或未行者‧自未能念此二種事‧無他令憶。此臨終時俱離\n"+
		"苦樂。善心死者‧是於有粗想時‧若細想行時‧善心即捨‧住無記心。彼於爾時‧於曾習善亦不\n"+
		"能憶‧他亦不能令其憶念‧不善亦爾。故細想行時‧一切死心‧皆是無記。俱舍釋說‧「善不善\n"+
		"心行相明了‧不能隨順當斷死心。」\n"+
		"　　第三‧從何攝煖者。造不善者‧識於所依從上分捨‧上分先冷乃至心處。造善業者‧自下\n"+
		"分捨‧下分先冷‧二者俱從心處識捨。識最初託精血之中‧即為肉心‧最後捨處即最初託。如\n"+
		"是先從上身攝煖至心‧或從下分收煖至心。次雖未說‧從下或上‧亦攝至心‧然當類知。\n"+
		"　　第四‧死後成辦中有之理者。如前所說識從何捨‧即於彼處‧無間而成‧死與中有‧如秤\n"+
		"低昂。依二種因‧謂我愛已生故‧無始樂著戲論已熏習故。善不善業已熏習故。又此中有‧眼\n"+
		"等諸根悉皆完具‧當生何趣即彼身形‧乃至未受生有以來‧眼無障礙‧猶如天眼。身無障礙‧\n"+
		"如具神通。俱舍亦云‧「為當本有形‧此謂死以前‧生剎那以後‧同類淨眼見‧具業神通力‧根"
		,
		/*===========================第 178 頁===========================*/
		"全無障礙‧不轉為尋香。」此說中有是同類見‧及修所得離過天眼能見。成辦何趣中有‧次\n"+
		"定不可轉趣餘生‧集論中說容有轉改。本有者‧俱舍論中總說四有‧死已未生是為中有‧當\n"+
		"正受生初一剎那是為生有‧從此第二剎那乃至死有最後剎那以前‧是為本有‧臨終最後\n"+
		"剎那是為死有‧此望將來受生之死有‧是其本有。有誤解此說為前生身形‧又有見說是後\n"+
		"形故‧說三日半為前生形‧次三日半為後生形。此說全無清淨依據‧唯增益執‧瑜伽論說識\n"+
		"不住故‧於前世身不起欲樂。故有說云‧見前世身而生憂苦‧亦屬增益。造不善者所得中有‧\n"+
		"如黑羺光或陰闇夜。作善中有‧如白衣光或晴明夜‧見己同類中有‧及見自等所當生處。入\n"+
		"胎經云‧「地獄中有如燒杌木‧旁生中有其色如煙‧餓鬼中有色相如水‧人天中有形如金\n"+
		"色‧色界中有其色鮮白。」此是顯色差別。從無色沒生下二界則有中有‧若從下二生無色\n"+
		"者則無中有。於何處沒‧即於其處成無色蘊‧堪為根據諸教典中除此而外‧未說餘無中有\n"+
		"之例‧故說上下無間‧皆無中有‧亦不應理。經中又說天之中有頭便向上‧人之中有橫行而\n"+
		"去‧諸作惡業所有中有‧目向下視倒擲而行‧意似通說三惡趣者。俱舍論說‧人鬼畜三‧各如\n"+
		"自行。壽量者‧若未得生緣‧極七日住。若得生緣‧則無決定。若仍未得則易其身‧乃至七七以"
		,
		/*===========================第 179 頁===========================*/
		"內而住‧於此期內定得生緣‧故於此後更無安住。堪依教典‧悉未說有較彼更久‧故說過此\n"+
		"更能久住‧不應道理。如天中有七日死已‧或仍生為彼天中有‧或轉成辦人等中有‧謂由餘\n"+
		"業轉變勢用‧能轉中有諸種子故‧餘亦如是。\n"+
		"　　第五次於生有結生之理者。若是胎生‧則彼中有於當生處‧見有自己同類有情‧為欲\n"+
		"看彼及戲笑等‧遂願往趣當生之處。次於父母精血‧起顛倒見。爾時父母未行邪行‧猶如幻\n"+
		"變‧見行邪行‧便起貪愛。此復若當為女‧欲令母離‧貪與父會‧若當生男‧便欲父離‧貪與母會。\n"+
		"瑜伽師地是說非實見其父母‧誤於精血見行邪行。生此欲已‧如如漸近‧如是如是漸漸不\n"+
		"見男女餘分‧唯見男女二根之相‧於此發憤中有即沒‧而生其中。此復父母貪愛俱極‧最後\n"+
		"決定各出一滴濃厚精血‧二滴和合住母胎中‧猶如熟乳凝結之時‧與此同時中有俱滅。與\n"+
		"滅同時‧即由阿賴耶識力故‧有餘微細諸根大種和合而生‧及餘有根同分精血和合摶生。\n"+
		"爾時識住‧即名結生。諸有不許阿賴耶者‧許為意識結生相續。若薄福者‧當生下賤種‧彼於\n"+
		"死時及入胎時聞紛亂聲‧及自妄見入諸蘆荻稠林等中。造善業者‧當生尊貴族‧聞有寂靜\n"+
		"美妙音聲‧及自妄見昇於高閣宮殿等處。又住胎者‧凡經七日‧有三十八‧胎中圓滿一切肢"
		,
		/*===========================第 180 頁===========================*/
		"節。次經四日‧當即降生。如入胎經云‧「此經九月或過九月‧是極圓滿‧住八月者雖亦圓滿‧\n"+
		"非極圓滿。若經六月‧或住七月‧非為圓滿‧或復缺肢。」此等廣說‧如入胎經‧應當了知。\n"+
		"　　若於生處不欲趣赴‧則必不往‧若不往者定不應生。故作感那洛迦業及增長已‧謂屠\n"+
		"羊宰雞‧或販豬等‧諸非律儀中有‧猶如夢中‧於當生處見有羊等。由先所習憙樂馳趣。次由\n"+
		"瞋恚生處之色‧中有遂滅生有續起。如是於餘似那洛迦癭鬼等中‧受生亦爾。若生旁生‧餓\n"+
		"鬼‧人間‧欲天‧色天‧便於生處‧見己同類‧可意有情。次由於彼起欣欲故‧便往其所‧瞋當生處‧\n"+
		"中有遂滅‧生有續起‧此乃瑜伽師地論說。若非宰雞及販豬等‧不律儀者‧生那洛迦‧理同後\n"+
		"說。俱舍論云‧「餘求香宅舍。」謂濕生欲香‧化生求舍‧而受生也。\n"+
		"　　復如釋說‧若是當生熱那洛迦‧希求煖熱‧生寒地獄‧希求清涼‧中有遂往。諸卵生者‧俱\n"+
		"舍論說亦同胎生‧死沒及結生之理‧無特外者‧皆如本地分說。\n"+
		"<b>菩提道次第廣論卷六終</b>"
		,
		/*===========================第 181 頁===========================*/
		"<b>菩提道次第廣論卷七</b>\n"+
		"<b><s>　第二由十二緣起門中思惟分四‧<n>一</n>支分差別‧<n>二</n>支分略攝‧<n>三</n>幾世圓滿‧<n>四</n>此等攝義。　　今初</s></b>\n"+
		"　　十二緣起支中‧初無明者‧如俱舍云‧「無明如非親實等。」此亦如說怨敵虛誑‧非唯\n"+
		"遮無親友諦實‧及異親實‧是說親友實語相違所對治品。如是無明亦非僅遮能對之明及\n"+
		"明所餘‧是明相違所對治品。此中能治明者‧謂正明了補特伽羅無我之義‧此相違者‧謂補\n"+
		"特伽羅我執薩迦耶見。此乃法稱論師所許。無著論師兄弟‧則許倒執實義‧蒙昧實義二中\n"+
		"後者‧總謂邪解‧未解二心之中‧為未解心‧然此相違能治上首‧則同許為覺無我慧。又此愚\n"+
		"蒙‧集論中說略分二種‧謂業果愚及真實義愚‧初能招集墮惡趣行‧後能招集往樂趣行。\n"+
		"　　行即是業‧此有非福業能引惡趣及能引善趣業。後復有二‧謂能引欲界善趣之福業\n"+
		"及能引上界善趣之不動業。\n"+
		"　　識者‧經說六識身‧然此中主要‧如許阿賴耶者‧則為阿賴耶‧如不許者‧則為意識。此復\n"+
		"若愚‧從不善業起苦苦果‧造作增長諸不善業‧此業習氣所熏‧現法之識者‧是因位識。由依"
		,
		/*===========================第 182 頁===========================*/
		"此識‧未來世中於惡趣處結生之識者‧是果位識。如是由於無我真實義愚增上力故‧未如\n"+
		"實知善趣真苦‧妄執為樂‧即便造集福不動業‧爾時之識是因位識。由依於此遂於欲界上\n"+
		"界善趣結生之識‧是果位識。\n"+
		"　　名色中名者‧謂受想行識非色四蘊。色者若生無色‧唯有色種而無實色‧除此餘位羯\n"+
		"羅藍等色‧如應當知。\n"+
		"　　六處者‧若是胎生‧由其最初識入精血‧為羯羅藍‧與名俱增‧成眼等四處‧身與意處‧於\n"+
		"羯羅藍位而有。若是化生‧結生之時‧諸根頓起‧無此漸次。卵生濕生唯除住胎‧餘者悉同。是\n"+
		"本地分所說。由是因緣‧成就名色得身自體‧成就六處成身差別‧是為成就能受用者‧五有\n"+
		"色處者‧於無色中無。\n"+
		"　　觸者‧謂由根‧境‧識三種和合‧取諸可意‧非可意‧中庸三境‧說「六處緣」者‧亦表境識。\n"+
		"　　受者‧謂觸取三境順生三受‧謂苦樂捨。\n"+
		"　　愛者‧謂於樂受起不離愛‧於諸苦惱起乖離愛。說「由受緣生愛」者‧是從無明和合\n"+
		"觸緣‧所生之受而能生愛‧若無無明‧雖有諸受愛終不生。由是因緣‧觸是境界受用‧受是生"
		,
		/*===========================第 183 頁===========================*/
		"受用或異熟受用‧若此二圓滿‧即為受用圓滿。其中三界有三種愛。\n"+
		"　　取者‧於四種境起四欲貪‧謂欲著於色聲等欲塵‧及除薩迦耶見餘諸惡見‧惡見係屬\n"+
		"惡戒‧惡禁及薩迦耶見‧是為欲取‧見取‧戒禁取‧我語取。\n"+
		"　　有者‧謂昔行於識‧熏業習氣‧次由愛取之所潤發‧引生後有有大勢力‧是於因上‧假立\n"+
		"果名。\n"+
		"　　生者‧謂識於四生最初結生。老死中老者‧謂諸蘊成熟轉變餘相‧死謂棄捨同分諸蘊。\n"+
		"　　第二支分略攝者。如集論云‧「云何支分略攝。謂能引支‧所引支‧能生支‧所生支。能引\n"+
		"支者謂無明行識‧所引支者謂名色六處觸受‧能生支者謂愛取有‧所生支者謂生老死。」\n"+
		"若爾引生兩重因果‧為顯有情一重受生因果耶抑顯兩重耶。若如初者‧則已生起果位之\n"+
		"識‧乃至於受‧後生愛等不應道理。若如第二‧則後重因果中缺無明行及因位識‧前因果中\n"+
		"缺愛取有。答‧無過。謂能引因所引之法‧即能生因之所生起‧所引已生‧即於此立生老死故。\n"+
		"若爾何為說兩重因果耶。答‧為顯引果苦諦‧與生果苦諦相各異故。前者於所引位唯有種\n"+
		"子‧自體未成是未來苦‧後者已生苦位現法即苦。又為說明果之受生有二種因‧謂能引因"
		,
		/*===========================第 184 頁===========================*/
		"及此所引生起之因‧故說二重因果。如本地分云‧「問‧識等至受及生老死‧若是雜相‧何故\n"+
		"說為二種相耶。答‧為顯苦相異故‧及顯引生二差別故。」又云‧「問‧諸支中幾苦諦攝現法\n"+
		"為苦。答‧二謂生及老死。問‧幾苦諦攝當來為苦。答‧識乃至受諸種子性。」是故能生之愛與\n"+
		"發愛之受‧二者非是一重緣起‧發愛之受‧乃是餘重緣起果位。\n"+
		"　　四相當知能引所引‧一何為所引‧謂果位識乃至其受‧共四支半。二以何而引‧謂依無\n"+
		"明之行。三如何而引‧謂於因位識中熏業習氣之理。四所引之義‧謂若遇愛等能生‧堪能轉\n"+
		"成如是諸果。三相當知能生所生‧一以何而生‧謂以愛緣取。二何為所生‧謂生老死。三如何\n"+
		"而生‧謂由行於識‧所熏業習潤此堪能令有大力之理。緣起經釋中‧以生一支為所生支‧老\n"+
		"死則為彼等過患。由是由愚業果無明起不善行‧於識熏建惡業習氣‧令其堪成三惡趣中\n"+
		"果時之識乃至於受。次以愛取數數潤發‧令彼業習漸有勢力‧於當來世惡趣之中感生老\n"+
		"死。又由愚無我真實義無明‧起欲界攝戒等福行‧及上界攝奢摩他等諸不動行‧於識熏習\n"+
		"妙業習氣‧令其堪成欲界善趣及上界天果位之識乃至其受。次以愛取數數潤發‧令其業\n"+
		"習漸有勢力‧於當來世諸善趣中‧生起生等。如是十二有支‧復於煩惱業苦三道‧悉皆攝盡。"
		,
		/*===========================第 185 頁===========================*/
		"如龍猛菩薩云‧「初八九煩惱‧二及十為業‧餘七者是苦。」稻稈經說十二有支攝為四因‧\n"+
		"謂無明種者‧於業田中下識種子‧潤以愛水‧遂於母胎生名色芽。\n"+
		"　　第三幾世圓滿者。能引所引支之中間‧容有無量劫所間隔‧或於二世即能生起無餘\n"+
		"世隔。其能生支與所生支二無間隔‧速者二生即能圓滿。如於現法新造天中順生受業‧即\n"+
		"於現法滿二支半‧謂無明行及因位識。臨終以前圓滿愛取及有三支‧於當來世圓滿所引\n"+
		"四支及半‧並圓所生二支分故。遲久亦定不過三生‧謂其能生及二所生並三能引各須一\n"+
		"生‧諸所引支於所生支攝故‧能引能生中間‧縱為多世間隔‧然是其餘緣起之世‧非此緣起\n"+
		"之世故。此未別算中有之壽。\n"+
		"　　如是已生諸果支時‧然而全無實作業者‧及受果者‧補特伽羅之我。如前所說從唯法\n"+
		"因支‧起唯法果支‧由不了知生死道理‧於彼愚蒙妄執有我‧求我安樂‧故造三門善不善業\n"+
		"仍復流轉。故從三惑起二支業及從彼業出生七苦‧復從七苦而起煩惱‧又從煩惱如前而\n"+
		"轉‧故三有輪流轉不息。龍猛菩薩云‧「從三出生二‧從二而生七‧從七復生三‧數轉三有輪。」\n"+
		"若正思惟由如是理‧漂流生死‧即是最勝厭離方便。從無量劫造集能引善不善業‧異熟未"
		,
		/*===========================第 186 頁===========================*/
		"出‧對治未壞‧今以愛取而為滋養‧由此增上‧則當漂流善趣惡趣。諸阿羅漢昔異生時‧雖造\n"+
		"無數能引之業‧然無煩惱解脫生死‧若於是理獲決定解‧則於煩惱執為怨敵‧於滅煩惱能\n"+
		"發精進。此中樸窮瓦大善知識‧專於十二緣起有支‧淨修其心‧思惟緣起流轉還滅‧著道次\n"+
		"第。此復是說‧思惟惡趣十二有支流轉還滅為下士類。次進思惟二善趣中十二有支流轉\n"+
		"還滅為中士類。如是比度自心‧推想曾經為母有情‧亦皆由其十二支門漂流生死發生慈\n"+
		"悲‧為利彼故‧願當成佛‧學習佛道為大士類。\n"+
		"　　第四此等攝義者。如前所說‧由業惑集增上力故‧生起苦蘊生死道理‧及特由其十二\n"+
		"有支轉三有輪。於斯道理善了知已‧正修習者‧能壞一切衰損根本極重愚闇‧除遣妄執內\n"+
		"外諸行從無因生‧及邪因生一切邪見‧增盛佛語寶藏珍財‧如實了知生死體相‧便能發起\n"+
		"猛利厭離‧於解脫道策發其意。是能醒覺諸先修者‧能得聖位微妙習氣最勝方便。如是亦\n"+
		"如妙臂請問經云‧「於愚癡者‧以緣起道。」稻稈經說‧「善見緣起‧則能遮除緣前後際‧及\n"+
		"緣現在一切惡見。」龍猛菩薩云‧「此緣起甚深‧是佛語藏寶。」毘奈耶教中說第一雙（即\n"+
		"舍利弗與目犍連）所有現行‧謂時時中遊觀五趣‧遊觀之後還贍部洲‧為諸四眾宣說彼"
		,
		/*===========================第 187 頁===========================*/
		"等所有眾苦。諸有共住近住弟子‧不樂梵行‧即便引彼付第一雙‧請為教誨。二人受已教誨\n"+
		"彼等‧得教授已‧愛樂梵行便能證得殊勝上德。大師見此問阿難陀‧啟白其事‧佛曰‧一切時\n"+
		"處‧不能遍有如第一雙‧應於門房畫生死輪‧分為五分‧周圍當畫十二緣起流轉還滅‧其次\n"+
		"乃興畫生死輪。又為仙道大王寄佛像時‧於下繪寫十二緣起流轉還滅而為寄之。大王受\n"+
		"已‧至天曉時‧結跏趺坐‧端正其身‧住對面念‧善觀緣起二種道理而證聖果。\n"+
		"　　第二生此意樂之量者。如是由於苦集二諦及其十二緣起支門‧詳細了知生死體相‧欲\n"+
		"捨生死‧欲彼寂滅及欲證得。雖纔生此‧亦是出離意樂‧然唯爾許猶非止足‧如六十正理論釋\n"+
		"云‧「處於無常熾燃大火三地之中‧如入火宅決欲超出。」又云‧「如囚欲脫獄」等。如前所\n"+
		"引‧謂如誤入熾燃火宅及墮牢獄‧不樂彼處‧能生幾許欲脫之心‧即當發生如彼心量‧次後更\n"+
		"須令漸增長。又此意樂如霞惹瓦說‧若僅口面漂浮少許‧如酸酒上所擲粉麵‧則於集諦生死\n"+
		"之因‧見不可欲亦僅爾許。若如是者‧則於滅除苦集之滅‧求解脫心亦復同爾‧故欲正修解脫\n"+
		"道心‧亦唯虛言。見他有情漂流生死‧所受眾苦不忍之悲‧亦無從起‧亦不能生有大勢力策發\n"+
		"心意無上真菩提心‧故云大乘‧亦唯隨言知名而已。故當取此中士法類‧以為教授之中心"
		,
		/*===========================第 188 頁===========================*/
		"而善修習。\n"+
		"　　第三除遣此中邪分別者。若作是云‧若於生死修習厭患‧令心出離‧則如聲聞墮寂滅\n"+
		"邊‧於生死中不樂安住‧故修厭患‧於小乘中可名為妙‧然諸菩薩不應修此。不可思議秘密\n"+
		"經云‧「諸菩薩者‧為欲成熟攝受有情‧於生死中見大勝利‧非於涅槃見如是利。」又云‧\n"+
		"「若諸菩薩‧於生死行境生怖畏者‧墮非行境。」又云‧「薄伽梵‧聲聞怖畏生死行境‧菩薩\n"+
		"返應周遍攝受無量生死。」此是倒執經義成大錯謬。經說不應厭離生死‧此義非顯由於\n"+
		"惑業增上力故‧漂流三有生老病死‧是等諸苦不應厭離。是顯菩薩為利眾生‧乃至生死最\n"+
		"後邊際‧擐披誓甲學菩薩行‧雖總眾生一切大苦‧一一剎那降自身心‧然不由此厭離怖畏‧\n"+
		"於廣大行勤發精進‧於生死中不應厭離。如是月稱論師亦云‧「眾生眾苦無餘盡至‧盡生\n"+
		"死邊‧剎那剎那種種異相損害身心‧然不因此而起恐怖。眾生眾苦一時頓至‧盡生死際發\n"+
		"大勇進‧剎那剎那悉能生起‧一切眾生一切種智無量無邊珍寶資糧‧知此因已‧應當更受\n"+
		"百千諸有。」為證此故‧引彼諸經。\n"+
		"　　又於三有見為勝利之理者‧即彼經說菩薩精勤義利有情‧如於此事所發精進‧如是"
		,
		/*===========================第 189 頁===========================*/
		"其心而獲安樂。故不厭患三有之義‧是於生死‧義利有情不應厭患‧當於此事而發歡喜。若\n"+
		"由煩惱及業增上漂流生死‧眾苦逼迫尚不能辦自己義利況云利他‧此乃一切衰損之門‧\n"+
		"較小乘人極應厭患極應滅除。若由大悲願等增上‧於三有中攝取生者‧則應歡喜。此二不\n"+
		"同。若未如是分別‧如前宣說‧則此說者‧若有菩薩律儀‧菩薩地說犯一惡作‧是染違犯‧恐繁\n"+
		"不錄。故見三有一切過失‧雖極厭離‧然由大悲牽引意故‧不斷三有者‧是為希有。若見三有\n"+
		"盛事‧如妙天宮‧愛未減少‧借利他名而云我等不捨生死‧智者豈能將以為喜。中觀心論亦\n"+
		"云‧「見過故非有‧悲不住涅槃‧利他具禁行‧而安住三有。」又菩薩地說百一十苦‧是於一\n"+
		"切有情‧發大悲之因。由見如是無邊眾苦‧心生恆常猛利不忍‧而云於生死不稍厭患‧極為\n"+
		"相違。若於生死心善出離‧次見有情皆自親屬‧為利他故入三有海‧此道次第亦是菩薩觀\n"+
		"行四百論之意趣。月稱論師於彼釋中亦詳明之‧如云‧「由其宣說生死過患‧令意怖畏求\n"+
		"解脫者‧為令決定趣大乘故‧世尊告曰‧諸比丘有情類中‧不易可得少數有情‧經於長夜流\n"+
		"轉生死‧不為汝等若父若母兒女親族‧隨一處所。」了知世尊如斯言教‧菩薩為以大乘道\n"+
		"筏‧度脫無始流轉生死‧為父母等諸親眷屬‧無依無怙諸眾生故‧安忍躍入。無上密咒亦須"
		,
		/*===========================第 190 頁===========================*/
		"此理‧如聖天攝行炬論云‧「以此次第‧應當趣入極無戲論行。其次第者‧謂修行者最初當\n"+
		"念‧無始生死所有大苦求涅槃樂‧遍捨一切猥雜‧下至王位自在‧亦當修苦想。」\n"+
		"　　第四決擇能趣解脫道性者。如室利勝逝友云‧「沈溺三有流‧苦海無邊底‧喜掉無厭\n"+
		"畏‧何物在我心。貧難求護壞‧離及病老衰‧入恆熾然火‧覺樂寧非狂。」又云‧「噫‧世具眼盲‧\n"+
		"雖現前常見‧後仍不略思‧汝心豈金剛。」當自策勵‧修習生死所有過患。如七童女因緣論\n"+
		"云‧「見住世動搖‧如水中月影‧觀欲如瞋蛇‧盤身舉頭影。見此諸眾生‧苦火遍燒燃‧大王我\n"+
		"等樂‧出離往尸林。」依正世間‧剎那不住滅壞無常‧猶如水月為風所動。諸欲塵者利小害\n"+
		"大‧等同毒蛇身所現影。又見五趣‧熾然三苦大火燒惱‧由見是故厭捨三有‧生如北方孩童\n"+
		"之心‧欣樂欲得出離解脫。北方孩童者‧傳說北方炒麵稀貴‧於日日中唯食蔓菁‧孩童飢餓\n"+
		"欲食炒麵‧向母索之‧母無炒麵給以生蔓菁‧云我不要此‧次給以乾蔓菁亦云不要‧次給以\n"+
		"新煮者又云不要‧更給以熟冷者亦云此亦不要‧心不喜曰‧此都是蔓菁云。如是我等‧見聞\n"+
		"憶念世間安樂‧一切皆應作是念云‧此是世間‧此亦世間‧此皆是苦‧非可治療‧發嘔吐心。如\n"+
		"是思惟‧昔從無始漂流生死‧厭患出離及思今後仍當漂流‧令實發生畏懼之心非唯空言。"
		,
		/*===========================第 191 頁===========================*/
		"如親友書云‧「生死如是故當知‧生於天人及地獄‧鬼旁生處皆非妙‧生是非一苦害器。」\n"+
		"生生死中乃是一切損害根本‧故當斷除。此復要待滅除二因‧謂煩惱‧業。此二之中‧若無煩\n"+
		"惱‧縱有多業亦不受生。若有煩惱‧縱無宿業率爾能集。故應摧壞煩惱‧壞煩惱者‧賴修圓滿\n"+
		"無謬之道。\n"+
		"<b><s>　此中分二‧<n>一</n>以何等身滅除生死‧<n>二</n>修何等道而為滅除。　　今初</s></b>\n"+
		"　　如親友書云‧「執邪倒見‧及旁生‧餓鬼‧地獄‧無佛教‧及生邊地蔑戾車‧性為騃啞‧長壽\n"+
		"天。隨於一中受生已‧名為八無暇過失‧離此諸過得閒暇‧故當勵力斷生死。」是須於現得\n"+
		"暇滿時斷除生死‧生無暇中無斷時故‧如前已說。大瑜伽師云‧「現是從畜分出之時。」博\n"+
		"朵瓦云‧「昔流爾久未能自還‧今亦不能自然還滅‧故須斷除。斷除時者‧亦是現得暇滿之\n"+
		"時。」此復居家於修正法‧有多留難及有眾多罪惡過失‧出家違此‧斷生死身出家為勝‧是\n"+
		"故智者應欣出家。若數思惟‧在家過患出家功德‧先已出家令意堅固‧未出家者安立醒覺\n"+
		"妙善習氣。此中道理當略宣說‧其居家者‧富則守護劬勞為苦‧貧則追求眾苦艱辛‧於無安\n"+
		"樂愚執為樂‧應當了知是惡業果。本生論云‧「於同牢獄家‧永莫思為樂‧或富或貧乏‧居家"
		,
		/*===========================第 192 頁===========================*/
		"為大病。一因守煩惱‧二追求艱辛‧或富或貧乏‧悉皆無安樂‧於此愚歡喜‧即惡果成熟。」是\n"+
		"故執持眾多資具‧求無喜足非出家事‧若不爾者居家無別。又居家者與法相違‧故居家中\n"+
		"難修正法。即前論云‧「若作居家業‧不能不妄語‧於他作罪者‧不能不治罰。行法失家業‧顧\n"+
		"家法豈成。法業極寂靜‧家事猛暴成‧故有違法過‧自愛誰住家。」又云‧「憍慢癡蛇窟‧壞寂\n"+
		"靜喜樂‧家多猛苦依‧如窟誰能住。」應數思惟‧如是等類在家過患‧發願出家。\n"+
		"　　復應願以粗劣衣缽乞活知足‧於遠離處淨自煩惱‧為他供處‧如七童女因緣論云‧\n"+
		"「願剃除髮已‧守持糞掃衣‧樂住阿蘭若‧何時能如是。目視軛木許‧手執瓦缽器‧何時無譏\n"+
		"毀‧於家家行乞。何時能不貪‧利養及恭敬‧淨煩惱刺泥‧為村供施處。」又應希願‧用草為座‧\n"+
		"臥無覆處‧霜露濕衣‧以粗飲食而能知足‧及於樹下柔軟草上‧以法喜樂存活寢臥。「何時\n"+
		"從草起‧著衣霜濕重‧以粗惡飲食‧於身無貪著。何時我能臥‧樹下柔軟草‧如諸鸚鵡綠‧受現\n"+
		"法喜樂。」房上降雪‧博朵瓦云‧「昨晚似於七童女因緣所說‧心很歡喜‧除欲如是修學而\n"+
		"無所餘。」又應希願‧住藥草地流水邊岸‧思惟水浪起滅無常‧與自身命二者相同‧以妙觀\n"+
		"慧滅除我執‧三有根本能生一切惡見之因。背棄三有所有歡樂‧數數思惟依正世間如幻"
		,
		/*===========================第 193 頁===========================*/
		"化等。「何時住水岸‧藥草滿地中‧數觀浪起滅‧同諸命世間。破薩迦耶見‧一切惡見母‧何時\n"+
		"我不樂‧三有諸受用。何時我通達‧動不動世間‧等同夢陽燄‧幻雲尋香城。」此等一切皆是\n"+
		"希願‧作出家身‧作此諸事。伽喀巴云‧「若能以大仙行‧住苦行山間‧始為文父真養子。」霞\n"+
		"惹瓦亦云‧「於諸在家事忙匆時‧應披妙衣往赴其所‧令彼念云出家安樂‧則種未來出家\n"+
		"習氣。」勇猛長者請問經亦云‧「我於何時能得出離苦處家庭‧如是而行‧何時能得‧作僧\n"+
		"羯摩‧長淨羯摩‧解制羯摩‧住和敬業‧彼當如是愛出家心。」此說在家菩薩應如是願。此之\n"+
		"主要為慕近圓‧莊嚴經論云‧「當知出家品‧具無量功德‧由是勝勤戒‧在家之菩薩。」如是\n"+
		"非但修行解脫‧脫離生死歎出家身‧即由波羅蜜多及密咒乘修學種智‧亦歎出家身最第\n"+
		"一。出家律儀‧即三律儀中別解脫律儀‧故當敬重聖教根本別解脫戒。\n"+
		"　　第二修何等道而為滅除者。如親友書云‧「或頭或衣忽然火‧尚應棄捨滅火行‧而當\n"+
		"勵求無後有‧因無餘事勝於此。應以戒慧靜慮證‧寂調無垢涅槃位‧不老不死無窮盡‧離地\n"+
		"水火風日月。」應學寶貴三學之道。其中三學‧數定有三。初觀待調心次第數決定者‧謂散\n"+
		"亂心者令不散亂‧是須戒學。心未定者為令得定‧謂三摩地或名心學。心未解脫為令解脫‧"
		,
		/*===========================第 194 頁===========================*/
		"是謂慧學。由此三學‧諸瑜伽師一切所作‧皆得究竟。觀待得果數決定者‧謂不毀戒果‧是為\n"+
		"欲界二種善趣。毀犯之果是諸惡趣。心學之果‧謂得上界二種善趣。慧學之果即是解脫。總\n"+
		"其所生‧謂增上生及決定勝‧初有上下二界善趣‧故能生法亦有二種‧此二即是本地分說。\n"+
		"又諸先覺‧待所斷惑亦許三種‧謂破壞煩惱‧伏其現行‧盡斷種子‧故有三學。次第決定者‧本\n"+
		"地分中引梵問經顯此義云‧「初善住根本‧次樂心寂靜‧後聖見惡見‧相應不相應。」此中\n"+
		"尸羅是為根本‧餘二學處從此生故。次依尸羅能得第二心樂靜定。心得定者見如實故‧能\n"+
		"得第三成就聖見‧遠離惡見。三學自性者‧如梵問經云‧「應圓滿六支‧四樂住成就‧於四各\n"+
		"四行‧智慧常清淨。」此中戒學‧圓滿六支‧具淨尸羅‧守護別解脫律儀‧此二顯示解脫出離\n"+
		"尸羅清淨。軌則‧所行‧俱圓滿者‧此二顯示無所譏毀尸羅清淨。於諸小罪見大怖畏者‧顯無\n"+
		"穿缺尸羅清淨。受學學處者‧顯無顛倒尸羅清淨。四心住者‧謂四靜慮‧此於現法安樂住故‧\n"+
		"名樂成就‧是為心學。四謂四諦‧各四行者‧謂苦中無常‧苦‧空‧無我‧集中因‧集‧生‧緣‧滅中滅‧靜‧\n"+
		"妙‧離‧道中道‧如‧行‧出‧達此十六有十六相‧是為慧學。若導尋常中士道者‧此應廣釋於三學\n"+
		"中引導之理‧然非如是‧故修止觀心慧二學‧於上士時茲當廣釋‧今不繁述。"
		,
		/*===========================第 195 頁===========================*/
		"　　當略宣說學戒之理。此中最初當數思惟尸羅勝利‧令其至心增長歡喜‧如大涅槃經\n"+
		"云‧「戒是一切善法之梯。戒是根本‧猶如地是樹等根本。戒是一切善法前導‧如大商主是\n"+
		"為一切商人前導。戒是一切法幢‧如帝釋幢。戒畢竟斷一切罪惡及惡趣道。戒如藥樹治療\n"+
		"一切罪惡病故。戒是險惡三有道糧。戒是甲劍能摧煩惱諸怨敵故。戒是明咒能除煩惱諸\n"+
		"毒蛇故。戒是橋梁度罪河故。」龍猛菩薩亦云‧「戒是一切德依處‧如動不動依於地。」妙\n"+
		"臂請問經云‧「一切稼穡依於地‧無諸災患而生長‧如是依戒勝白法‧悲水灌澆而生長。」\n"+
		"應如思惟。若受不護過患極重‧如比丘珍愛經云‧「或有戒為樂‧或有戒為苦‧具戒則安樂‧\n"+
		"毀戒則成苦。」此說受學通於勝利過患二品‧是故亦應善思過患‧敬重學處。\n"+
		"　　如何修學之理者。四犯因中‧無知對治者‧謂當聽聞‧了知學處。放逸對治者‧謂於取捨\n"+
		"所緣行相‧不忘憶念及以正知‧率爾率爾觀察三門‧了知轉趣若善若惡‧依自或法增上力\n"+
		"故‧羞恥作惡是為知慚‧恐他譏毀羞恥為愧‧及由怖畏惡行異熟‧懷恐懼等‧當如是學。不敬\n"+
		"對治者‧謂於大師‧師所制立‧同梵行所‧應修恭敬。煩惱熾盛對治者‧應觀自心‧何煩惱盛‧勵\n"+
		"修對治。若不如是策勵修學‧思違越此‧許其罪輕微‧於諸佛制放縱而轉‧當獲純苦。如分別"
		,
		/*===========================第 196 頁===========================*/
		"阿笈摩云‧「若於大師大悲教‧起輕微心少違犯‧由是而獲苦增上‧折籬失壞菴沒林。現或\n"+
		"有於王重禁‧違越而未受治罰‧非理若違能仁教‧如醫缽龍墮旁生。」故應勵力‧莫為罪染。\n"+
		"　　假設已染‧莫不思慮而便棄捨‧當如佛說還出罪犯‧勵力悔除。梵問經云‧「於彼學尋\n"+
		"求‧及勤修彼行‧終不應棄捨‧命難亦無虧‧常住正行中‧隨毘奈耶轉。」成就真實尸羅經云‧\n"+
		"「諸比丘寧可離命而死‧非可毀壞尸羅。何以故‧離命而死‧唯令此生壽量窮盡。毀壞尸羅‧\n"+
		"乃至百俱胝生‧常離種姓‧永失安樂‧當受墮落。」此具因說‧故當捨命而善守護。若不能爾‧\n"+
		"則應審思‧我剃鬚髮披壞色衣‧空無所義。如三摩地王經云‧「於佛聖教出家已‧仍極現行\n"+
		"諸惡業‧於財穀起堅實想‧貪諸乘具及象車。諸不殷重持學處‧此等何故而薙頭。」若欲逃\n"+
		"出有為生死‧趣解脫城‧壞戒足者‧非僅不能實行‧反當流轉生死‧眾苦逼惱。並及譬喻如三\n"+
		"摩地王經云‧「若人為諸盜賊逼‧欲活命故而逃避‧如其人足不能行‧仍為賊執而摧壞。如\n"+
		"是愚人毀淨戒‧而欲脫離諸有為‧由戒壞故不能逃‧為老病死所摧壞。」故此經又云‧「為\n"+
		"著居家服‧我所說學處‧爾時諸比丘‧亦無此學處。」為近事說五種學處圓滿守護‧比丘亦\n"+
		"無。若於此時精修學處‧其果猶大故應勵策。即此經云‧「若經俱胝恆沙劫‧淨心以諸妙飲"
		,
		/*===========================第 197 頁===========================*/
		"食‧傘蓋幢幡及燈鬘‧承事百億俱胝佛。若於正法極失壞‧善逝聖教將滅時‧晝夜能行一學\n"+
		"處‧其福勝前俱胝倍。」\n"+
		"　　又若念云‧毀犯可悔‧無後不犯防護之心‧放逸轉者‧說可還出‧如食毒藥。如彌勒獅子\n"+
		"吼經云‧「慈氏‧末世末劫後五百歲‧有諸在家出家菩薩‧出現於世。彼作是云‧悔除惡業能\n"+
		"無餘盡‧造作眾罪造已當悔‧增上毀犯而不防護‧我說彼等是作死業。云何為死‧謂如人食\n"+
		"毒‧此亦同彼‧命終之後‧顛倒墮落。」又云‧「慈氏‧於此聖法毘奈耶說為毒者‧謂諸違越所\n"+
		"制學處‧故說汝等莫自食毒。」若具別解脫律儀‧應以如是道理守護‧密咒亦然。如妙臂請\n"+
		"問經云‧「佛我所說別解脫‧淨戒調伏盡無餘‧在家咒師除形相‧軌則諸餘盡當學。」此說\n"+
		"雖諸在家咒師‧除出家相‧羯摩軌則少分遮罪‧尚如調伏所出而行‧況出家咒師‧又能成就\n"+
		"密咒根本亦是尸羅。妙臂請問經云‧「咒本初為戒‧次精進忍辱‧信佛菩提心‧密咒無懈怠。\n"+
		"如王具七寶‧無厭調眾生‧如是咒成就‧七支能調罪。」曼殊室利根本續云‧「念誦若毀戒‧\n"+
		"此無勝成就‧中悉地亦無‧又無下成就。能仁未曾說‧毀戒咒能成‧非趣涅槃城‧境域及方所。\n"+
		"於此愚惡人‧何有咒能成‧此毀戒有情‧何能生善趣。且不得天趣‧又無勝安樂‧何況佛所說‧"
		,
		/*===========================第 198 頁===========================*/
		"諸咒豈能成。」康壟巴亦云‧「若年饑荒‧一切事情皆至糧麥‧如是一切皆繞於戒‧當勤學\n"+
		"此。又戒清淨‧不思業果必不得成‧故思業果是眞教授。」霞惹瓦亦云‧「總有禍福皆依於\n"+
		"法‧其中若依毘奈耶說‧無須改易內心清淨‧堪忍觀察‧心意安泰‧邊際善妙。」善知識敦巴\n"+
		"云‧「有一類人依律毀咒‧依咒輕律‧除我尊長教授‧無餘能使調伏為咒助伴‧及令密咒為\n"+
		"調伏伴。」覺亦云‧「我印度中‧凡有大事或忽然事‧集諸受持三藏法師‧問三藏中不曾\n"+
		"遮耶。既決擇已‧於此安住。我毘迦瑪拉希拉諸師‧則於其上‧更須問云‧菩薩行中不曾遮耶‧\n"+
		"不違彼耶。安欲根本隨持律轉。」\n"+
		"　　如是戒淨‧又如內鄔蘇巴云‧「現在於內與煩惱鬥‧唯此為要‧不鬥煩惱戒不能淨。若\n"+
		"爾不生伏斷煩惱‧定學慧學‧當須畢竟漂流生死。」又如前說認識煩惱‧思彼過患離彼勝\n"+
		"利‧以念正知而為防慎。煩惱稍出‧即應用矛數數擊刺。此復自心隨何煩惱生已無間‧視如\n"+
		"怨敵與之鬥戰。若不爾者‧初起忍受非理作意‧令其資養成無可敵‧唯隨彼行。如是勵力縱\n"+
		"未能遮‧亦當速斷莫令相續。應如畫水莫如畫石‧如親友書云‧「當了知自心‧如畫水土石‧\n"+
		"煩惱初為上‧樂法應如後。」若於法品‧與上相違。入行論亦云‧「我應記恨此‧與此共戰爭‧"
		,
		/*===========================第 199 頁===========================*/
		"如是相煩惱‧除能壞煩惱。我寧被燒殺‧或被斷我頭‧然於煩惱敵‧終不應屈敬。」善知識樸\n"+
		"窮瓦亦云‧「我雖忽被煩惱壓伏‧後我從下而為切齒。」博朵瓦聞之曰‧「若能如是‧當下\n"+
		"即退。」世庸怨敵‧一次擯逐遂居他方‧待得力時仍來報怨‧煩惱不同。煩惱於身‧若能一次\n"+
		"拔出根本‧無往他方亦無報復。然由我等‧不能精勤破壞煩惱之所致耳。入行論云‧「擯庸\n"+
		"敵出國‧攝受住他方‧養力仍返報‧煩惱敵不爾。煩惱為惑慧眼斷‧遣離我意能何往‧豈能住\n"+
		"餘返報我‧唯我志弱無精進。」女絨巴云‧「煩惱起時不應懈怠‧當下應以對治遮除。若不\n"+
		"能遮‧應即起立設曼陀羅及諸供具‧供養祈禱尊長本尊‧次緣煩惱‧忿怒念誦‧即能折伏。」\n"+
		"朗日塘巴亦云‧「彼又云移動住處‧勁舉項頸‧亦能折伏‧可見彼與煩惱鬥爭。」此復應如\n"+
		"阿蘭若師云‧「晝夜唯應觀察自心‧豈有餘事。」依此而行乃能生起。又傳說大覺一日\n"+
		"隨見幾次‧爾時定問「生善心否。」\n"+
		"　　此諸煩惱如何斷者。謂癡罪重極難遠離‧為餘一切煩惱所依。彼之對治‧多修緣起‧善\n"+
		"巧生死流轉還滅。若能修此‧則五見等一切惡見悉不得生。瞋與現後二世大苦‧斷諸善根\n"+
		"是大怨敵。如入行論云‧「無罪能如瞋。」故一切種莫令生起‧勵修忍辱‧若不生瞋‧則於現"
		,
		/*===========================第 200 頁===========================*/
		"法‧亦極安樂。如入行云‧「若能勵摧瞋‧此現後安樂。」貪愛能令先造一切善不善業‧漸增\n"+
		"勢力能生生死。又欲界者‧從受用境‧觸緣生受‧味著生愛‧應多修習內外不淨及貪欲塵所\n"+
		"有過患‧而正遮除。世親大阿闍黎云‧「鹿象蛾魚蠅‧五類被五害‧一害況恆常‧近五何不\n"+
		"害。」又易生難離‧謂愛四事‧利譽稱樂及於此等四相違品‧意不歡喜。當修對治。此復總修\n"+
		"生死過患‧特修念死‧即能退除。慢於現法最能障礙當生之道‧及是當來奴賤等因‧故應斷\n"+
		"除。斷除道理‧如親友書云‧「當數思惟老病死‧親愛別離及諸業‧終不能越自受果‧由對治\n"+
		"門莫憍慢。」若於四諦三寶業果獲得定解‧則不復生疑惑隨眠。\n"+
		"　　又睡眠‧昏沈‧掉舉‧懈怠‧放逸‧無慚‧無愧‧忘念‧不正知等‧諸隨煩惱最易生起‧障修善品‧\n"+
		"當知過患修習對治‧率爾率爾令漸微劣。其過患者‧如親友書云‧「掉悔瞋恚及昏沈‧睡眠\n"+
		"貪欲並疑惑‧應知如是五種蓋‧劫善法財諸盜賊。」勸發增上意樂經云‧「若樂睡眠與昏\n"+
		"沈‧痰癊風病及膽疾‧其人身中多增長‧令彼諸界極擾亂。若樂睡眠與昏沈‧集飲食垢腹不\n"+
		"清‧身重容顏不和美‧所發言語不清晰。」又云‧「若樂睡眠與昏沈‧其人愚癡失法欲‧凡稚\n"+
		"退失一切德‧退失白法趣黑闇。」念住經云‧「諸煩惱所依‧獨一謂懈怠‧誰有一懈怠‧彼便"
		,
		/*===========================第 201 頁===========================*/
		"無諸法。」集法句云‧「若行於放逸‧即壞凡夫心‧如商護財貨‧智當不放逸。」本生論\n"+
		"云‧「捨慚為天王‧意違於正法‧寧瓦缽蔽衣‧觀敵家盛事。」親友書云‧「大王應知念\n"+
		"身住‧善逝說為唯一過‧故當勵力勤守念‧失念則壞一切法。」入行論云‧「雖諸具多\n"+
		"聞‧正信樂精進‧由無正知過‧而令有犯染。」不能如是斷諸煩惱及隨煩惱‧然當不順\n"+
		"煩惱‧不執彼品‧視如怨敵‧是為現在必不容少‧故應勵力攝對治品‧破除煩惱‧清淨自\n"+
		"內所受尸羅。大覺弟子吉祥阿蘭若師謂內鄔蘇巴云‧「智然‧後有人問‧汝弟子眾\n"+
		"以何而為教授中心‧則定答為已發神通或見本尊。然實應說於業因果漸漸決定‧於\n"+
		"所受戒清淨護持。」故修之成就‧當知亦是無明等惑‧漸趣輕微。能感現後二世純大\n"+
		"罪苦‧謂與他鬥爭。然於爾時一切眾苦‧捨命強忍‧其傷疤等返自顯示‧謂此即彼時所\n"+
		"傷。若斷煩惱發精進時‧忍耐苦行‧極為應理。入行論云‧「無義被敵所毀傷‧若尚愛為\n"+
		"身莊嚴‧為大義故正精進‧小苦於我豈為損。」若能如是戰勝煩惱‧乃名勇士。戰餘怨\n"+
		"敵如割死屍‧雖不殺害自亦當死。入行論云‧「輕蔑一切苦‧摧伏瞋等敵‧勝此名勇士‧\n"+
		"餘者如斬尸。」故又如論云‧「住煩惱聚中‧千般能安住‧如野干圍獅‧煩惱不能侵。」"
		,
		/*===========================第 202 頁===========================*/
		"道所治品‧莫令侵害而當勝彼。已說共中士道次第。\n"+
		"<b>菩提道次第廣論卷七終</b>"
		,
		/*===========================第 203 頁===========================*/
		"<b>菩提道次第廣論卷八</b>\n"+
		"<b><s>敬禮至尊成就大悲諸善士足。</s></b>\n"+
		"　　如是恆長修習生死種種過患‧見一切有如同火坑‧欲證解脫息滅惑苦‧由此希求策\n"+
		"逼其意‧學三學道‧能得解脫脫離生死。又此解脫無所退失‧非如善趣‧然所斷過及所證德\n"+
		"僅是一分‧故於自利且非圓滿‧由此利他亦唯少分‧後佛勸發當趣大乘。故具慧者‧理從最\n"+
		"初即入大乘。如攝波羅蜜多論云‧「無力引發世間利‧畢竟棄捨此二乘‧一味利他為性者‧\n"+
		"應趣佛乘由悲說。」又云‧「知樂非樂等如夢‧見癡過逼諸眾生‧捨棄利他殊勝業‧此於自\n"+
		"利何精勤。」如是見諸眾生墮三有海與我相同‧盲閉慧眼不辨取捨‧履步蹎蹶不能離險‧\n"+
		"諸有成就佛種性者‧不悲愍他‧不勤利他不應正理。即前論云‧「盲閉慧目步蹎蹶‧欲利世\n"+
		"間有佛種‧何人不起悲愍心‧誰不精勤除其愚。」當知此中‧士夫安樂‧士夫威德‧士夫勝力‧\n"+
		"謂能擔荷利他重擔‧唯緣自利共旁生故。故諸大士本性‧謂專一趣注行他利樂‧弟子書云‧\n"+
		"「易得少草畜亦食‧渴逼獲水亦歡飲‧士夫此為勤利他‧此聖威樂士夫力。日勢乘馬照世"
		,
		/*===========================第 204 頁===========================*/
		"遊‧地不擇擔負世間‧大士無私性亦然‧一味利樂諸世間。」如是見諸眾生眾苦逼惱‧為利\n"+
		"他故而發怱忙‧是名士夫亦名聰叡。即前書云‧「見世無明煙雲覆‧眾生迷墮苦火中‧如救\n"+
		"頭然意勤忙‧是名士夫亦聰叡。」是故能生自他一切利樂本源‧能除一切衰惱妙藥‧一切\n"+
		"智士所行大路‧見聞念觸‧悉能長益一切眾生‧由行利他兼成自利‧無所缺少具足廣大善\n"+
		"權方便。有此大乘可趣入者‧當思希哉。我今所得誠為善得‧當盡所有士夫能力‧趣此大乘。\n"+
		"此如攝波羅蜜多論云‧「淨慧引發最勝乘‧能仁遍智從此出‧此是一切世間眼‧具足照了\n"+
		"如日光。」由種種門觀大乘德‧牽引其意起大恭敬‧而當趣入。\n"+
		"<b><s>　由是因緣於大士道次第修心分三‧<n>一</n>顯示入大乘門唯是發心‧<n>二</n>如何發生此心道理‧<n>三</n>既發心\n"+
		"　已學行道理。　　今初</s></b>\n"+
		"　　如是若須趣入大乘‧能入之門又復云何。此中佛說二種大乘‧謂波羅蜜多大乘與密\n"+
		"咒大乘‧除此更無所餘大乘。於此二乘隨趣何門‧然能入門唯菩提心。若於相續‧何時生此\n"+
		"未生餘德‧亦得安立為大乘人。何時離此‧縱有通達空性等德‧然亦墮在聲聞等地‧退失大\n"+
		"乘。大乘教典多所宣說‧即以正理亦善成立。故於最初入大乘數‧亦以唯發此心安立‧後出"
		,
		/*===========================第 205 頁===========================*/
		"大乘亦以唯離此心安立。故大乘者‧隨逐有無此心而為進退。如入行論云‧「發菩提心剎\n"+
		"那後‧諸囚繫縛生死獄‧然應稱為善逝子。」又云‧「今日生佛族‧今為諸佛子。」此說發心\n"+
		"無間‧即為佛子。聖彌勒解脫經云‧「善男子‧譬如破碎金剛寶石‧然能映蔽一切勝妙金莊\n"+
		"嚴具‧亦不棄捨金剛寶名‧亦能遣除一切貧窮。善男子‧如是發起一切智心金剛寶石‧縱離\n"+
		"修習‧然能映蔽聲聞獨覺一切功德金莊嚴具‧亦不棄捨菩薩之名‧能除一切生死貧窮。」\n"+
		"此說雖未學習勝行‧然有此心便名菩薩。龍猛菩薩云‧「自與此世間‧欲證無上覺‧其本菩\n"+
		"提心‧堅固如山王。」金剛手灌頂續云‧「諸大菩薩‧此極廣大‧此最甚深‧難可測量‧秘密之\n"+
		"中最為秘密‧陀羅尼咒大曼陀羅‧不應開示諸惡有情。金剛手‧汝說此為最極希有‧昔未聞\n"+
		"此‧此當對何有情宣說。金剛手答曰‧曼殊室利‧若有正行修菩提心‧若時此等成就菩提心。\n"+
		"曼殊室利‧爾時此諸菩薩行菩薩行‧行密咒行‧當令入此大智灌頂陀羅尼咒大曼陀羅。若\n"+
		"菩提心未圓滿者‧此不當入‧亦不使彼見曼陀羅‧亦不於彼顯示印咒。」故法雖是大乘之\n"+
		"法‧不為滿足‧最要是彼補特伽羅入大乘數。\n"+
		"　　又大乘人依菩提心‧假若此心僅有解了‧大乘亦爾。若有此心德相圓滿‧則其大乘亦"
		,
		/*===========================第 206 頁===========================*/
		"成真淨‧故當勤學。如華嚴經云‧「善男子‧菩提心者‧猶如一切佛法種子。」當獲定解‧故更\n"+
		"釋之。此如水糞及暖土等‧與稻種合為稻芽因‧與麥豆等種子相合為彼芽因‧故是共因。如\n"+
		"麥種子任會何緣‧終不堪為稻等芽因‧故是麥芽不共之因。由此所攝水糞等事‧亦皆變成\n"+
		"麥芽之因。如是無上菩提之心‧佛芽因中猶如種子‧是不共因。解空之慧‧如水糞等是三菩\n"+
		"提共同之因。故寶性論云‧「信解大乘為種子‧慧是能生佛法母。」謂菩提心如父之種‧證\n"+
		"無我慧如同慈母。如父是藏人‧決定不生漢胡等子‧父是子姓決定之因。母是藏人生種種\n"+
		"子‧故是共因。龍猛菩薩云‧「諸佛辟支佛‧諸聲聞定依‧解脫道唯汝‧決定更無餘。」此讚般\n"+
		"若波羅蜜多‧聲聞獨覺亦須依此‧故說般若波羅蜜多為母‧是大小乘二子之母。故證空慧‧\n"+
		"不能判別大乘小乘‧以菩提心及廣大行而分判之。寶鬘論云‧「諸聲聞乘中‧未說菩薩願‧\n"+
		"大行及迴向‧何能成菩薩。」此說不由見分‧當以行分。如是證空性慧‧尚非大乘不共之道‧\n"+
		"況諸餘道。故若不以菩提心為教授中心而正修習‧僅於起首略憶文句‧而於餘道微細一\n"+
		"分多殷重修‧顯然於法知見太淺。總如生子俱須父母‧道支圓滿亦須方便智慧二品。特須\n"+
		"方便上首發菩提心‧智慧上首通達空性。設修一分而未全修‧若唯希求解脫生死‧於奢摩"
		,
		/*===========================第 207 頁===========================*/
		"他須莫誤為毘缽舍那‧善修無我空性之義。然若自許是大乘者‧是則必須修菩提心‧如慈\n"+
		"尊云‧「智不住三有‧悲不住寂滅。」以慧遮止墮生死邊‧以悲遮止墮寂滅邊‧慧不能遮墮\n"+
		"寂滅故‧不墮有邊小乘有故‧菩薩道者‧正所斷除墮寂邊故。\n"+
		"　　解佛密意堪為定量諸佛子等‧若有如此寶貴之心‧於內生起執為希有‧歎生如此希\n"+
		"有妙道‧若內心生愚夫所愛微分功德‧則不執為如是希奇。入行論云‧「餘自利不起‧利益\n"+
		"有情心‧此希勝心寶‧先無今得生。」又云‧「豈有等此善‧何有此知識‧豈有如此福。」又云‧\n"+
		"「誰發勝心寶‧即禮彼士身。」又云‧「從搖正法乳‧出此妙醍醐。」此說是出佛語心藏勝\n"+
		"教授故。是故吉祥阿底峽尊持中觀見‧金洲大師持唯識中實相之見‧然菩提心依金洲得‧\n"+
		"故為師中恩最重者。若有了解聖教扼要‧觀此傳記‧於道扼要有大了解。若勤修此生真實\n"+
		"心‧雖施烏鴉少許飲食‧由此攝持亦能墮入菩薩行數。若無此心‧縱將珍寶充三千界而為\n"+
		"布施‧亦不能入菩薩之行。如是淨戒乃至智慧‧修諸本尊脈息明點等‧皆不能入菩薩之行。\n"+
		"猶如世說刈草磨鐮‧若此寶心未至扼要‧任經幾久勵修善行‧無甚進趣‧如以鈍鐮刈諸草\n"+
		"木。若令此心至於扼要‧亦如磨鐮雖暫不割使其鋒利‧其後刈草雖少時間‧能刈甚多。一一"
		,
		/*===========================第 208 頁===========================*/
		"剎那亦能速疾淨治罪障‧積集資糧‧雖微少善能令增廣‧諸將盡者能無盡故。入行論云‧\n"+
		"「大力極重惡‧非大菩提心‧餘善何能映。」又云‧「此如劫火一剎那‧定能燒毀諸罪惡。」\n"+
		"又云‧「若思為除療‧諸有情頭痛‧具此利益心‧其福且無量。況欲除一一‧有情無量苦‧欲為\n"+
		"一一所‧成無量功德。」又云‧「餘善如芭蕉‧生果即當盡‧菩提心樹果‧恆無盡增長。」\n"+
		"<b><s>　第二如何發生此心道理分四‧<n>一</n>由依何因如何生起‧<n>二</n>修菩提心次第‧<n>三</n>發起之量‧<n>四</n>儀軌受法。</s></b>\n"+
		"　　初中有三‧初從四緣發心道理者。若見諸佛及諸菩薩難思神力‧或從可信聞如是事‧\n"+
		"依此發心‧謂念所住所修菩提有大威力。雖無如是若見若聞‧而由聽聞依於無上菩提法\n"+
		"藏‧信解佛智而發其心。雖未聞法‧由見菩薩正法將滅‧便作是念而發其心‧謂念如是正法\n"+
		"久住‧能滅無量有情大苦‧我為令此菩薩正法久安住故‧定當發心。雖未觀見正法欲滅‧然\n"+
		"見惡世上品愚癡‧無慚無愧嫉妬慳等‧便作是念‧於此世中‧雖於聲聞獨覺菩提能發心者‧\n"+
		"尚屬難得‧況於無上菩提發心。我且發心餘當隨學‧見難發心而發其心‧共為四種。發心之\n"+
		"理‧論說於大菩提發心‧故是發心欲證菩提。由何緣者‧初由見聞希有神變生希有想‧念我\n"+
		"當得如是菩提。第二謂從說法師所‧聞佛功德先生淨信‧次於此德發欲證心。第三謂由不"
		,
		/*===========================第 209 頁===========================*/
		"忍大乘聖教遷滅‧於佛妙智發欲得心。此中由見聖教不滅則能滅除有情大苦‧亦緣除苦\n"+
		"而發其心‧然其發心主要因緣‧是由不忍聖教寢滅‧若不爾者‧則與下說依悲發心有重複\n"+
		"過。第四由見此心大利極為希貴‧正由此緣之所激動‧便於佛所發欲得心。又此發心‧由於\n"+
		"菩提發欲得心而為建立‧非就所為而為安立。若不於佛功德修信‧則於佛位不希證得‧不\n"+
		"能滅除於辦自利執唯寂滅為足之心。若由修習慈悲門中‧見於利他須大菩提‧欲得佛者‧\n"+
		"此能遮遣於利他中執唯寂滅為足之心‧不能遮前滿足執故‧又無餘法能遮彼故。又於自\n"+
		"利執唯寂滅為足之心‧非不須遮‧以於小乘唯脫生死‧唯有一分斷證功德‧其自利義不圓\n"+
		"滿故。又此雖脫三有衰損‧然未解脫寂滅衰故‧又經宣說圓滿自利是佛法身故。故於佛德\n"+
		"淨修信已則能觀見‧況云利他‧即辦自利若不得佛亦必不可‧是為不退小乘最大因緣。又\n"+
		"前所說初二發心‧曾未見說慈悲所引‧諸餘經論亦多僅說見佛色身法身功德‧引起欲得\n"+
		"成佛之心名曰發心。又說誓願安立一切有情成佛亦名發心。故此二中‧雖一一分亦應預\n"+
		"入發心之數。圓滿一切德相發心者‧僅見利他必須成佛‧引起欲得成佛之心猶非滿足‧即\n"+
		"於自利‧亦見成佛必不可少而引欲得。又此亦非棄捨利他‧亦須為求利益他故‧現觀莊嚴"
		,
		/*===========================第 210 頁===========================*/
		"論云‧「發心為利他‧欲正等菩提。」此說雙求菩提與利他故。\n"+
		"　　二從四因發心者。謂種姓圓滿‧善友攝受‧悲愍有情‧而不厭患生死難行‧依此四因而\n"+
		"發其心。\n"+
		"　　三從四力發心者。謂由自功力欲大菩提‧是名自力。由他功力希大菩提‧是名他力。昔\n"+
		"習大乘‧今暫得聞諸佛菩薩稱揚讚美而能發心‧是名因力。於現法中親近善士‧聽聞正法‧\n"+
		"諦思惟等長修善法‧名加行力。依此四力而發其心。菩薩地說依上總別八種因緣‧若由自\n"+
		"力或由因力‧而發心者是名堅固。又由依止此諸因緣‧或由他力或加行力‧而發心者名不\n"+
		"堅固。如是善知總諸聖教及大乘教‧將近隱滅‧較諸濁世最為惡濁‧現於此世應當了知至\n"+
		"誠發心極為希少。當依善士聽大乘藏‧諦思惟等‧勤修加行。非唯他勸‧非隨他轉‧非為仿效\n"+
		"其規式等‧當由自力至誠發心樹立根本‧以其菩薩一切諸行皆依此故。\n"+
		"<b><s>　第二修菩提心次第者‧從大覺所傳來者現分二種‧<n>一</n>修七種因果教授‧<n>二</n>依寂天佛子著述\n"+
		"所出而修。　　今初</s></b>\n"+
		"　　七因果者‧謂正等覺菩提心生‧此心又從增上意樂‧意樂從悲‧大悲從慈‧慈從報恩‧報"
		,
		/*===========================第 211 頁===========================*/
		"恩從念恩‧憶念恩者從知母生‧是為七種。\n"+
		"<b><s>　此中分二‧<n>一</n>於其漸次令發定解‧<n>二</n>如次正修。　初中分二‧<n>一</n>開示大乘道之根本即是大悲‧<n>二</n>諸\n"+
		"　餘因果是此因果道理。</s></b>\n"+
		"　　初中有三。初重要者‧若由大悲發動心意‧為欲拔除一切有情出生死故起決定誓‧若\n"+
		"悲下劣不能如是。故荷盡度眾生重擔‧賴此悲故‧不荷此擔便不能入大乘數故。悲初重要‧\n"+
		"如無盡慧經云‧「大德舍利弗‧又諸菩薩大悲無盡‧所以者何‧是前導故。大德舍利弗‧如息\n"+
		"出入是人命根之所前導‧如是諸菩薩所有大悲‧亦是成辦大乘前導。」伽耶經云‧「曼殊\n"+
		"室利‧諸菩薩行‧云何發起‧何為依處。曼殊室利告曰‧天子‧諸菩薩行‧大悲發起‧有情為依。」\n"+
		"若不修學至極廣大二種資糧‧終不能滿如是誓願‧觀見是已轉趣難行廣大資糧‧故為轉\n"+
		"入諸行所依。\n"+
		"　　中重要者。如是一次發如是心趣入正行‧然因有情數量眾多行為惡暴‧學處難行‧多\n"+
		"無邊際經劫無量‧見已怯畏退墮小乘‧非唯一次發起大悲‧應恆修習漸令增長。於自苦樂\n"+
		"全不顧慮‧於利他事毫無厭捨‧故易圓滿一切資糧。如修次初篇云‧「如是菩薩大悲所動‧"
		,
		/*===========================第 212 頁===========================*/
		"全不自顧‧極欲希求利益他故‧而能趣入至極難行‧長夜疲勞集聚資糧。如聖發生信力經\n"+
		"說‧『其大悲者‧為欲成熟一切有情‧全無苦生是所不受‧全無樂生是所不捨。』若趣如是\n"+
		"極大難行‧不久即能圓滿資糧‧決定當得一切智位‧是故一切佛法根本唯是大悲。」\n"+
		"　　後重要者。諸佛獲得果位之時‧不如小乘而住寂滅‧盡虛空住義利眾生‧亦是由於大\n"+
		"悲威力‧此若無者同聲聞故。如修次第中篇云‧「由大悲心所攝持故‧諸佛世尊雖得圓滿\n"+
		"一切自利‧盡有情界究竟邊際而善安住。」又云‧「佛薄伽梵無住大涅槃‧因即大悲。」譬\n"+
		"如稼禾初以種子‧中以雨澤‧後以成熟而為最要。佛之稼禾‧初中後三‧悲為最要。吉祥月稱\n"+
		"云‧「以許悲為佛勝苗‧初如種子增如水‧長時受用如成熟‧是故我先讚大悲。」由見此義‧\n"+
		"正攝法經云‧「世尊‧菩薩不須學習多法。世尊‧菩薩若能善受善達一法‧一切佛法皆在其\n"+
		"手。一法云何‧所謂大悲。世尊‧由大悲故‧一切佛法皆能自來菩薩手中。世尊‧譬如轉輪聖王\n"+
		"輪寶所至‧一切軍眾皆至其處。世尊‧如是菩薩大悲所至‧一切佛法咸至其所。世尊‧譬如命\n"+
		"根若在‧餘根亦在。世尊‧如是大悲若在‧菩提餘法亦當生起。」若於如是勝道扼要‧無邊教\n"+
		"理之所成立‧獲得定解‧於菩薩心根本大悲所有法類‧何故不執為勝教授。故如響那窮敦"
		,
		/*===========================第 213 頁===========================*/
		"巴說‧「於覺所雖請教授‧終唯教云‧捨世間心‧修菩提心。」善知識敦巴譏笑告曰‧「此\n"+
		"是掘出覺所有教授中心。」知法扼要‧獲決定解‧唯此最難。故應數數集聚淨治‧閱華嚴\n"+
		"等諸大經論‧求堅定解。如吉祥敬母云‧「尊心寶即是‧正等菩提種‧唯尊知堅實‧餘凡莫能\n"+
		"曉。」\n"+
		"　　第二諸餘因果是此因果之理。初從知母乃至於慈‧為因之理者。總欲離苦‧數數思惟\n"+
		"其有情苦即能生起‧然令此心易生猛利及堅固者‧則彼有情先須悅意愛惜之相。如親有\n"+
		"苦不能安忍‧怨敵有苦心生歡喜‧親怨中庸若有痛苦多生捨置。其中初者‧因有可愛‧此復\n"+
		"隨其幾許親愛‧便生爾許不忍其苦‧中下品愛下品不忍‧若極親愛‧雖於微苦亦能生起廣\n"+
		"大不忍。見敵有苦‧非但不生欲拔之心‧反願更大願不離苦‧是不悅意相之所致。此亦由其\n"+
		"不悅大小‧於苦歡喜而成大小。親怨中庸所有痛苦‧既無不忍亦無歡喜‧是由俱無悅非悅\n"+
		"意相之所致。如是應知‧修諸有情為親屬者‧是為令起悅意之相。親之究竟是為慈母‧故修\n"+
		"知母‧憶念母恩‧及報恩三‧是為引發悅意可愛。愛執有情猶如一子‧此悅意慈是前三果。由\n"+
		"此即能引發悲心。欲與樂慈及拔苦悲‧因果無定。故知母等三種所緣‧即是與樂慈及拔苦"
		,
		/*===========================第 214 頁===========================*/
		"悲二者根本‧故於此中當勤修學。又發心因‧修諸有情皆為親者‧是月稱論師及大德月‧蓮\n"+
		"花戒論師等之所宣說。\n"+
		"　　增上意樂及以發心為果之理者。由其如是漸修其心‧悲心若起‧便能引發為利有情\n"+
		"希得成佛‧即此便足‧何故於此添增上心。欲令有情得樂離苦‧慈悲無量聲聞獨覺亦皆有\n"+
		"之‧若自荷負一切有情與樂拔苦‧則除大乘決定非有‧故須發此心力強勝增上意樂。是故\n"+
		"僅念一切有情云何得樂云何離苦‧非為滿足‧須自至誠荷此重擔‧故當分辨此等差別。海\n"+
		"慧問經云‧「海慧‧如有商主或有長者‧唯有一子‧可悅可愛可惜可意‧見無違逆‧然此童子\n"+
		"因其幼稚而作舞娛‧墮不淨坑。次其童子若母若親‧見彼童子墮不淨坑‧見已雖發號哭憂\n"+
		"嘆‧然終不能入不淨坑拔出其子。次童子父來至其所‧彼見一子墮不淨坑‧見已急急舉止\n"+
		"慌措‧欲出其子心甚愛顧‧全無嘔吐‧跳不淨坑取出其子。」此說三界為不淨坑‧獨愛一子\n"+
		"謂諸有情‧若母若親者謂聲聞獨覺‧見諸有情墮生死中‧憂慼嘆嗟然不能出。商主長者謂\n"+
		"諸菩薩‧法譬合說。又說獨一愛子落不淨坑‧如母之悲‧聲聞獨覺亦皆共有‧故依悲愍‧當發\n"+
		"荷負度眾生擔增上意樂。如是若發度有情心‧然我現時不能圓滿利一有情。又非止此‧即"
		,
		/*===========================第 215 頁===========================*/
		"使證得二羅漢位亦僅利益少數有情‧利亦唯能引發解脫‧不能立於一切種智。故當思惟\n"+
		"無邊有情‧誰能圓滿此諸有情現前究竟一切利義‧則知唯佛方有此能‧故能引發為利有\n"+
		"情欲得成佛。\n"+
		"<b><s>　第二如次正修分三‧<n>一</n>修習希求利他之心‧<n>二</n>修習希求菩提之心‧<n>三</n>明所修果即為發心。　初中\n"+
		"　分二‧<n>一</n>引發生起此心所依‧<n>二</n>正發此心。　初中分二‧<n>一</n>於諸有情令心平等‧<n>二</n>修此一切成悅意\n"+
		"　相。　　今初</s></b>\n"+
		"　　如前下中士中‧所說諸前行等所有次第‧於此亦應取來修習。又若此中不從最初遮\n"+
		"止分黨‧令心平等‧於諸有情一類起貪‧一類起瞋‧所生慈悲皆有黨類‧緣無黨類則不能生‧\n"+
		"故當修捨。又捨有三‧行捨受捨及無量捨‧此是最後。此復有二‧謂修有情無貪瞋等煩惱之\n"+
		"相‧及於有情自離貪瞋令心平等‧此是後者。修此漸次為易生故‧先以中庸無利無害為所\n"+
		"緣事‧次除貪瞋令心平等。若能於此心平等已‧次緣親友修平等心。若於親友心未平等‧或\n"+
		"由貪瞋分別黨類‧或貪輕重令不平等。此亦平已‧次於怨敵修平等心‧此若未平‧專見違逆\n"+
		"而起瞋恚。若此亦平‧次當遍緣一切有情‧修平等心。"
		,
		/*===========================第 216 頁===========================*/
		"　　若爾於彼由修何事能斷貪瞋‧謂修二事。就有情者‧謂念一切欣樂厭苦‧皆悉同故‧緣\n"+
		"於一類執為親近而興饒益‧於他一類計為疏遠‧或作損惱或不饒益‧不應道理。就自己者‧\n"+
		"當作是思‧從無始來於生死中‧未經百返為我親屬‧雖一有情亦不可得‧於誰應貪‧於誰當\n"+
		"瞋‧此是修次中篇所說。又於親屬起貪愛時‧如月上童女請問經云‧「我昔曾殺汝一切‧我\n"+
		"昔亦被汝殺害‧一切互相為怨殺‧汝等如何起貪心。」及如前說無定過時‧一切親怨速疾\n"+
		"變改所有道理‧當善思惟‧由此俱遣貪瞋二心。此取怨親差別事修‧故不須遣親怨之心‧是\n"+
		"滅由執怨親為因‧所起貪瞋分黨之心。\n"+
		"　　引發一切成悅意相者。修次中篇云‧「慈水潤澤內心相續‧如濕潤田‧次下悲種易於\n"+
		"增廣‧故心相續以慈薰習‧次應修悲。」所說慈者‧謂於諸有情‧見如愛子悅意之相。又此所\n"+
		"說由修等捨‧息滅貪瞋不平惡澀‧如調善田。次以見為悅意慈水而潤澤已‧下以悲種‧則大\n"+
		"悲心速疾當生‧應當了知極為切要。此中有三‧初修母者。生死無始‧故自受生亦無始際‧若\n"+
		"生若死輾轉傳來‧於生死中未受此身‧未生此處決定非有‧亦無未作母等親者。如本地分\n"+
		"引經說云‧「我觀大地‧難得汝等長夜於此未曾經受無量生死。我觀有情‧不易可得長夜"
		,
		/*===========================第 217 頁===========================*/
		"流轉未為汝等若父若母兄弟姊妹軌範親教‧若餘尊重‧若等尊重。」此復非僅昔曾為母‧\n"+
		"於未來世亦當為母‧無有邊際。如是思惟‧於為自母‧應求堅固決定了解。此解若生‧次念恩\n"+
		"等亦易發生‧此若未生‧則念恩等無所依故。\n"+
		"　　二修念恩者。修習一切有情是母之後‧若先緣於現世母修速疾易生。如博朵瓦所許\n"+
		"而修‧先想前面母相明顯‧次多思惟非唯現在‧即從無始生死以來‧此為我母過諸數量。如\n"+
		"是此母為母之時‧一切損害悉皆救護‧一切利樂悉皆成辦。特於今世先於胎藏恆久保持‧\n"+
		"次產生已黃毛疏竪‧附以暖體十指捧玩‧哺以乳酪授以口食‧口拭涕穢手擦屎尿‧種種方\n"+
		"便‧心無厭煩而善資養。又饑渴時與以飲食‧寒時給衣‧乏時給財‧皆是自己未肯用者。又此\n"+
		"資具皆非易得‧是負罪苦及諸惡名‧受盡艱辛求來授與。又若其子有病等苦‧較其子死寧\n"+
		"肯自死‧較其子病寧肯自病‧較其子苦寧肯自苦‧出於自心實願易代‧用盡加行除苦方便‧\n"+
		"總盡自己所知所能‧但有利樂無不興辦‧凡有損苦無不遣除‧於此道理應專思惟。如是修\n"+
		"已‧若念恩心非唯虛言真實生者‧次於父等諸餘親友‧亦當知母如上修習。次於中人知母\n"+
		"而修‧若能於此生如親心‧則於怨敵亦應知母而正修習。若於怨敵起同母心‧次於十方一"
		,
		/*===========================第 218 頁===========================*/
		"切有情‧知母為先漸廣修習。\n"+
		"　　三修報恩者。如是唯除轉生死故不能相識‧而實是我有恩之母‧彼等受苦無所依怙‧\n"+
		"捨而不慮自脫生死‧薄無慚愧何甚於此。如弟子書云‧「諸親趣入生死海‧現如沈沒大水\n"+
		"中‧易生不識而棄捨‧自脫無愧何過此。」故若棄捨如是有恩‧於下等人且不應理‧況與我\n"+
		"法豈能隨順。如是思已‧取報恩擔‧即前書云‧「嬰兒始產全無能‧飲誰慈力授乳酪‧依慈多\n"+
		"勞此諸母‧雖最下等誰樂捨。」又云‧「由得誰腹而安住‧由誰悲慎而取此‧此母煩惱苦無\n"+
		"依‧最下眾生孰樂捨。」無邊功德讚云‧「有情無明盲‧意樂衰損慧‧為父子承事‧慈悲饒益\n"+
		"我。棄此獨解脫‧非是我之法‧故汝發願度‧無怙諸眾生。」若爾如何報其恩耶‧生死富樂母\n"+
		"自能得‧然彼一切無不欺誑‧故我往昔於由煩惱魔力所傷‧如於重傷注硝鹽等‧於性苦上\n"+
		"更令發生種種大苦。慈心饒益‧應將彼等安立解脫涅槃之樂而報其恩。中觀心論云‧「又\n"+
		"由煩惱魔‧傷害已成瘡‧我如注灰水‧反令苦病苦。若有於餘生‧慈敬及恩益‧欲報其恩惠‧除\n"+
		"涅槃何有。」不報恩擔‧重於大海及須彌擔‧若能報恩‧即是智者稱讚之處。如龍王鼓音頌\n"+
		"云‧「大海及須彌‧地等非我擔‧若不知報恩‧即是我重擔。若人心不掉‧報恩及知恩‧令恩不"
		,
		/*===========================第 219 頁===========================*/
		"失壞‧智者極讚此。」總之自母未住正念‧心狂目盲復無引導‧步步蹎蹶趣向可怖險崖而\n"+
		"行‧其母若不祈望其子‧復望於誰。若子不應從其險怖救度其母‧又應誰救‧故應從此而救\n"+
		"度之。如是若見為母眾生‧由煩惱魔擾亂其心‧自心無主而成狂亂。又離慧眼觀增上生‧決\n"+
		"定勝道。又無真實善友引導‧一一剎那造作惡行‧如步蹎蹶。總於生死‧別於惡趣奔馳懸險‧\n"+
		"母當望子‧子應濟母。如是思已‧拔出生死而報其恩。集學論云‧「煩惱狂癡盲‧於多懸險路‧\n"+
		"步步而蹎蹶‧自他恆憂事‧眾生苦皆同。」此說如是觀已‧不應於他尋求過失‧見一功德應\n"+
		"覺希有‧然此亦合苦惱之理。\n"+
		"　　第二正發此心分三。初修慈中慈所緣者‧謂不具足安樂有情。行相者‧謂念云何令遇\n"+
		"安樂‧惟願令其獲得安樂‧我應令其遇諸安樂。勝利者‧三摩地王經云‧「遍於無邊俱胝剎‧\n"+
		"盡其無量眾供養‧以此常供諸勝士‧不及慈心一數分。」此說較以廣大財物‧於究竟田常\n"+
		"時供養‧其福尤大。曼殊室利莊嚴佛土經云‧「於東北方有大自在王佛‧世界曰千莊嚴‧其\n"+
		"中有情皆具安樂‧如諸比丘入滅定樂。設於彼土修淨梵行‧經過百千俱胝年歲‧若於此土\n"+
		"最下乃至於彈指頃‧緣一切有情發生慈心‧其所生福較前尤多‧況晝夜住。」寶鬘論云‧"
		,
		/*===========================第 220 頁===========================*/
		"「每日三時施‧三百罐飲食‧然不及須臾‧修慈福一分。天人皆慈愛‧彼等恆守護‧喜樂多安\n"+
		"樂‧毒刀不能害。無勞事得成‧當生梵世間‧設未能解脫‧得慈法八德。」若有慈心‧天人慈愛\n"+
		"自然集會‧佛以慈力戰敗魔軍‧故守護中為最勝等‧故雖難生然須勵力。集學論說‧當一切\n"+
		"心思惟金光明中‧開示修習慈悲偈文‧下至語中讀誦而修。其文為「以此金光勝鼓音‧於\n"+
		"三千世界中‧惡趣諸苦閻羅苦‧匱乏苦苦願息滅」等。修慈次第先於親修‧次於中庸‧次於\n"+
		"怨修‧其次遍於一切有情如次修習。修習道理‧如於有情數數思惟苦苦道理‧便生悲愍‧如\n"+
		"是亦當於諸有情‧數數思惟缺乏有漏無漏諸樂‧樂缺乏理‧若修習此‧欲與樂心任運而起‧\n"+
		"又當作意種種妙樂‧施諸有情。\n"+
		"　　二修悲中悲所緣者‧由其三苦如其所應‧苦惱有情。行相者‧謂念云何令離此苦‧願其\n"+
		"捨離‧我當令離。修習漸次先於親友‧次於中者‧次於怨修‧若於怨處如同親友‧心平等轉‧漸\n"+
		"於十方一切有情而修習之。如是於其等捨慈悲別分其境‧次第修者‧是蓮花戒論師隨順\n"+
		"阿毘達磨經說‧此極扼要。若不別分‧初緣總修似生起時‧各各思惟‧皆悉未生。若於各各皆\n"+
		"生前說變意感覺‧漸次增多‧後緣總修‧隨緣總別‧清淨生故。修習道理‧當思為母此諸有情"
		,
		/*===========================第 221 頁===========================*/
		"墮生死中‧如何領受總別諸苦‧具如前說。此復若修前中士道已生起者‧比自心修易於生\n"+
		"起。若於自上思惟此等‧則成引發出離心因‧若於他上而思惟者‧則成引發悲心之因。然未\n"+
		"先於自上思惟‧則不能生令至扼要。此乃略說‧廣則應如菩薩地說‧悲心所緣百一十苦‧有\n"+
		"彊心力應當修學。此說較諸聲聞現證究竟苦諦‧以厭患心所見諸苦‧菩薩修悲思苦眾多‧\n"+
		"若無量門思惟無樂苦惱道理‧慈悲亦多。若恆思惟則能發生猛利堅固‧故少教授便覺飽\n"+
		"足‧棄修諸大教典所說‧力極微弱。此如前說趣大乘門是發心理‧及以大悲為根本理‧善別\n"+
		"此等‧以觀察智思擇修習‧後生證悟。若其知解未善分別‧唯專策勤略生感觸‧全無所至‧修\n"+
		"餘事時皆如是知。\n"+
		"　　其悲生量者。修次初篇云‧「若時猶如可意愛子身不安樂‧如是亦於一切有情‧欲淨\n"+
		"其苦‧此悲行相任運而轉‧性相應轉。爾時即是悲心圓滿‧得大悲名。」此說心中最愛幼兒\n"+
		"若有痛苦‧其母能生幾許悲痛‧即以此許而為心量‧若於一切有情悲任運轉‧說為圓滿大\n"+
		"悲體相。由此生起大慈之量‧亦當了知。又彼論插敘云‧「由修如是大悲力故‧立誓拔濟一\n"+
		"切有情‧願求無上正等菩提‧以為自性菩提之心‧不須策勵而得生起。」此說能生願心之"
		,
		/*===========================第 222 頁===========================*/
		"因‧須前所說如是大慈。由此當知大菩提心發生之量‧此非已至高上聖道所有發心‧初發\n"+
		"業者所有發心說為如是。攝大乘論亦云‧「清淨增上力‧堅固心昇進‧名菩薩初修‧無數三\n"+
		"大劫。」三無數劫起首菩薩‧亦須發起如是之心。\n"+
		"　　故全未知此之方境‧僅作是念‧為欲利益一切有情‧願當成佛‧為此義故我行此善。發\n"+
		"此意樂便大誤會‧未得謂得‧堅固所有增上之慢。不以菩提心為教授中心而善修習‧追求\n"+
		"餘事勵力欲想超邁多級‧了知大乘扼要觀之‧實可笑處。多經宣說諸勝佛子‧於多劫中尚\n"+
		"須執為修持中心而正修學‧況諸唯能了知名者。又此非說不修餘道‧是說須將修菩提心‧\n"+
		"而為教授中心修習。總未能生前說領感‧若善了知大乘學處‧堅信大乘‧亦可先為發心正\n"+
		"受律儀‧次乃修習菩提之心。如入行論‧先受律儀及菩提心‧次於彼學六度之中修靜慮時‧\n"+
		"乃廣宣說修菩提心。然為成就此法器故‧於先亦須修眾多心‧謂思惟勝利‧七支皈依‧修治\n"+
		"身心‧了知學處‧發心欲護。故進道中‧修空性解須漸增‧進尚有名在。然此相等大菩提心‧亦\n"+
		"須善修上上轉勝‧令道昇進名亦弗存。此於一切佛子唯一真道‧波羅蜜多教授論中‧宣說\n"+
		"二十二種發心‧從諸論師解釋此等進道之理‧應當了知。"
		,
		/*===========================第 223 頁===========================*/
		"　　第三修增上意樂者。如是修習慈悲之後‧應作是思‧噫‧此諸有情‧可愛悅意如是乏樂‧\n"+
		"眾苦逼惱‧云何能令得諸安樂‧解脫眾苦。便能荷負度此重擔‧下至語言亦當修心。前報恩\n"+
		"時雖亦略生‧然此說者‧僅生慈悲與樂離苦‧猶非滿足‧是為顯示須有慈悲‧能引是心‧我為\n"+
		"有情成辦利樂。又此非唯於正修時‧即修完後‧一切威儀皆能憶念‧相續修習增長尤大。修\n"+
		"次中篇云‧「此即大悲‧或住定中‧或於一切威儀之中‧於一切時一切有情‧皆當修習。」悲\n"+
		"是一例‧隨修何等所緣行相‧一切皆同。如大德月大論師云‧「心樹自從無始時‧煩惱苦汁\n"+
		"所潤滋‧不能改為甘美味‧一滴德水有何益。」謂如極苦「噠」大樹‧以一二滴糖汁澆\n"+
		"灌不能令甜。如是無始煩惱苦味‧薰心相續‧少少修習慈悲等德‧悉無所成‧是故應須相續\n"+
		"修習。\n"+
		"　　第二修習希求菩提之心者。由如前說次第所致‧便見利他定須菩提‧起欲得心‧然僅\n"+
		"有此猶非滿足。如皈依中說‧由思惟身語意三事業功德‧先應盡力增長淨信。論說信為欲\n"+
		"依‧次於彼德發起誠心證得之欲‧則於自利亦定了知‧一切種智必不可少。能為引生發心\n"+
		"之因‧雖有多種‧然悲為勝‧自力所發極為殊勝‧此是修次初篇引智印三摩地經所說。"
		,
		/*===========================第 224 頁===========================*/
		"　　第三顯所修果即為發心者。總相如前所引現觀莊嚴教義。其差別者‧隨順華嚴經義‧\n"+
		"入行論云‧「應知如欲往‧正往之差別‧如是智應知‧此二別如次。」此說分為願行二種。異\n"+
		"說雖多‧然作是念‧為利有情‧願當成佛或應成佛‧作是願已於施等行隨學未學‧乃至何時\n"+
		"未受律儀‧是名願心。受律儀已當知此心‧是名行心。修次初篇云‧「為利一切諸有情故願\n"+
		"當成佛‧初起希求是名願心。受律儀後修諸資糧‧是名行心。」此中雖有多種徵難‧茲不廣\n"+
		"說。\n"+
		"<b>菩提道次第廣論卷八終</b>"
		,
		/*===========================第 225 頁===========================*/
		"<b>菩提道次第廣論卷九</b>\n"+
		"<b><s>　第二依寂天教典而修分三‧<n>一</n>思惟自他能換勝利及不換過患‧<n>二</n>若能修習彼心定能發生‧<n>三</n>修\n"+
		"　習自他相換法之次第。　　今初</s></b>\n"+
		"　　思惟自他能換勝利及不換過患者。入行論云‧「若有欲速疾‧救護自及他‧彼應自他\n"+
		"換‧密勝應受行。」又云‧「盡世所有樂‧悉從利他生‧盡世所有苦‧皆從自利起。此何須繁說‧\n"+
		"凡愚作自利‧能仁行利他‧觀此二差別。若不能真換‧自樂及他苦‧非僅不成佛‧生死亦無\n"+
		"樂。」謂當思惟‧唯自愛執‧乃是一切衰損之門。愛執他者‧則是一切圓滿之本。\n"+
		"　　若修自他換易意樂‧定能發起。如先怨敵聞名便怖‧後若和順相結為友‧設無彼時亦\n"+
		"能令生最大憂惱‧一切悉是隨心而轉。故若能修‧觀自如他‧觀他如自亦能生起。即此論云‧\n"+
		"「困難不應退‧皆由修力成‧先聞名生畏‧後無彼不樂。」又云‧「自身置為餘‧如是無艱\n"+
		"難。」若作是念‧他身非我身‧云何於彼能生如自之心耶。即此身體亦是父母精血所成‧是\n"+
		"他體分‧然由往昔串習力故而起我執。若於他身修習愛執‧宛如自體亦能生起。即彼論云‧"
		,
		/*===========================第 226 頁===========================*/
		"「如汝於他人‧一滴精血聚‧虛妄執為我‧如是應修餘。」如是善思勝利過患‧則能至心愛\n"+
		"樂修習‧又見修習便能生起。\n"+
		"　　彼修自他換易之理‧次第云何。言自他換‧或說以自為他以他為自者‧非是於他強念\n"+
		"為我‧於他眼等念為我所而修其心。乃是改換愛著自己‧棄捨他人二心地位‧應當發心愛\n"+
		"他如自‧棄自如他。故說改換自樂他苦‧應知亦是於我愛執視如怨敵‧滅除愛重我之安樂。\n"+
		"於他愛執見為功德‧滅除棄捨他人痛苦‧於除他苦殷重修習‧總當不顧自樂而除他苦。\n"+
		"<b><s>　此中分二‧<n>一</n>除其障礙‧<n>二</n>正明修法。　　今初</s></b>\n"+
		"　　修習此心有二障礙。一謂執自樂他苦所依自他二身‧猶如青黃各各類別。次於依此\n"+
		"所生苦樂‧亦便念云‧此是我者應修應除‧此是他者輕而棄捨。能治此者‧謂觀自他非有自\n"+
		"性各各類別‧唯互觀待‧於自亦能起如他心‧於他亦能起自覺故‧如彼山此山。譬如彼山雖\n"+
		"就此岸起彼山心‧若至彼山則定發起此山之覺。故不同青色‧任待於誰唯起青覺‧不起餘\n"+
		"色之覺。如集學論云‧「修自他平等‧堅固菩提心‧自他唯觀待‧妄如此彼岸。彼岸自非彼‧觀\n"+
		"誰而成此‧自且不成自‧觀誰而成他。」此說唯由觀所待處而假安立‧全無自性。二謂又念"
		,
		/*===========================第 227 頁===========================*/
		"他之痛苦‧無害於我‧為除彼故不須勵力。除此礙者‧謂若如是‧則恐老時受諸苦惱‧不應少\n"+
		"年積集財物‧以老時苦無害於少故。如是其手亦不應除足之痛苦‧以是他故。老時幼年‧前\n"+
		"生後生‧僅是一例‧即前日後日‧上午下午等皆如是知。若謂老幼是一相續‧其手足等是一\n"+
		"身聚‧故與自他不相同者。相續與身聚‧是於多剎那多支分而假施設‧無獨立性‧自我他我\n"+
		"亦皆於假聚相續而安立‧故言自他皆觀待立全無自性。然由無始串習愛執增上力故‧自\n"+
		"所生苦便不忍受‧若能於他修習愛執‧則於他苦亦能發生不忍之心。\n"+
		"　　如是除自他換諸障礙已‧正修習者。謂由於自貪著力故‧起我愛執‧由此執故無始生\n"+
		"死乃至現在‧發生種種不可愛樂。欲修自利作自圓滿‧行非方便經無數劫‧自他二利悉無\n"+
		"所成。非但無成‧且唯受其眾苦逼惱。若自利心移於利他‧則早定成佛‧圓滿自他一切利益。\n"+
		"由未如是‧故經長時勞而無益。今乃了知第一怨敵即我愛執‧應後依止念及正知‧堅固決\n"+
		"定勵力滅除。其未生者當令不生‧其已生者令不相續。入行論云‧「此於生死中‧百返損害\n"+
		"我‧意汝欲自利‧雖經眾多劫‧以此大疲勞‧汝唯引生苦。」又云‧「若汝從往昔‧能作如是業‧\n"+
		"除佛圓滿樂‧定無如斯時。」如是不執自言‧不護自品‧當數修心‧將自身財及諸善根‧悉無"
		,
		/*===========================第 228 頁===========================*/
		"顧慮惠施有情。\n"+
		"　　又施彼已即應利彼‧不應於彼而行邪行‧故於身等應當滅除自利之心。如云‧「意汝\n"+
		"定應知‧自為他自在‧除利諸有情‧汝今莫想餘。他自在眼等‧不應作自利‧眼等於利他‧不應\n"+
		"作邪行。」若見身等棄捨利他攀緣自利‧或身語意而反於他作損害緣‧應作是念而正遮\n"+
		"止‧此於往昔‧亦曾令受無邊眾苦‧現今若於相似利益而生錯誤‧隨彼轉者當生大苦。如云‧\n"+
		"「汝昔傷害我‧已往可不諫‧我見汝何逃‧應摧汝憍慢。今汝應棄捨‧思我有自利‧我於餘賣\n"+
		"汝‧莫厭應盡力。放逸不將汝‧惠施諸有情‧汝則定將我‧授與諸獄卒。如是汝長時‧捨我令久\n"+
		"苦‧今念諸怨恨‧摧汝自利心。」如是數思愛他勝利‧當由至心發生勇悍‧棄他之心未生不\n"+
		"生‧其已生者令不相續‧於他令發可愛可樂可意之相。\n"+
		"　　如昔於自愛樂執著‧今於他所應令發起愛執之心‧如云‧「應執餘如我。」能發如是\n"+
		"愛執有情‧其因謂當念彼恩德‧或見於自所作饒益。此復猶如見諸沃田善植種子‧能結眾\n"+
		"多上妙果實便極珍愛。如是若於有情福田植施等種‧亦能出現時究竟一切利樂。若獲定\n"+
		"解‧亦起愛執‧故於是等應當思惟。入行論云‧「有情與諸佛‧同能生佛法‧如其敬信佛‧何不"
		,
		/*===========================第 229 頁===========================*/
		"敬有情。」此如令諸有情歡喜頌說‧若殺有情則能引其墮三惡趣‧若救其殺能引善趣復\n"+
		"得長壽‧若於有情不與而取及施資財‧發瞋恚心及修慈悲‧亦能引生善趣惡趣。特緣有情\n"+
		"乃得發心‧為利有情始修諸行‧是故成佛亦須有情‧要依有情施等乃滿‧當審思惟。釋菩提\n"+
		"心論云‧「世間善惡趣‧其愛非愛果‧皆由於有情‧作利損而生。若無上佛位‧且依有情得‧人\n"+
		"天諸資財‧梵釋及猛利‧護世所受用‧於此三趣中‧無非利有情‧所引此何奇。地獄鬼畜中‧有\n"+
		"情之所受‧苦事非一種‧從損有情起。飢渴互打擊‧及侵害等苦‧難遮無窮盡‧皆損有情果。」\n"+
		"諸聲聞等果報下劣‧是由未能廣行利他‧諸佛獲得究竟果位‧是由廣利有情而生‧應思此\n"+
		"理‧不應剎那貪著自利。即前論云‧「於有情離貪‧如毒應棄捨‧諸聲聞離貪‧豈非下菩提‧由\n"+
		"不棄有情‧佛證大菩提。若知生如是‧利非利諸果‧則於剎那頃‧豈有貪自利。」是則專住利\n"+
		"他及菩提果‧亦見是從菩提心苗之所出生‧此心根本見為大悲‧故諸佛子愛樂修習。若多\n"+
		"修習令其堅固‧則能任運趣極難行諸廣大行。即前論云‧「悲堅為根本‧菩提心苗生‧專利\n"+
		"他覺果‧諸佛子應修。若修令堅固‧諸怖他苦者‧能捨靜慮樂‧而趣入無間。此奇此應讚‧此為\n"+
		"勝士法。」今於此義‧亦應用諸先賢言論而發定解‧如覺云‧「不知修慈悲之菩薩‧唯藏"
		,
		/*===========================第 230 頁===========================*/
		"人能知。」\n"+
		"　　若爾當如何修‧「須從最初次第學習。」朗日塘巴云‧「霞婆瓦與我‧有十八種人方\n"+
		"便‧一種馬方便。人方便者‧謂發大菩提心‧隨作何事‧悉學利益有情。馬方便者‧謂菩提心未\n"+
		"生者令不生‧已生者令不住‧不使增長者為我愛執‧故特於彼盡力違害‧正對有情盡力利\n"+
		"益。」大瑜伽師謂善知識敦巴云‧「我有風息平等轉等‧如此如此三摩地。」答云‧「汝修\n"+
		"縱能耳邊擊鼓不可破壞‧若無慈悲及菩提心‧猶當生於晝夜應悔之地。」此中意趣似說‧\n"+
		"當成能生無暇無色等處‧異生之因。康壟巴云‧「我等於覺有情顛倒行事‧有情於我等\n"+
		"亦當如是行。」立與未立大乘根本‧入與未入大乘之分‧一切皆是相值於此‧故一切時應\n"+
		"觀於此令心生起。若生者善‧若未生者莫如是住‧應常親近開示此法大善知識‧常與如是\n"+
		"修心伴侶共同居住‧觀閱顯示此法經論‧勤修此因積集資糧‧淨此障礙。自能如是淨修其\n"+
		"心‧則定能下圓滿種子‧誠非小事‧理應歡喜。如大覺云‧「欲趣大乘門‧覺心如日月‧除暗\n"+
		"息熱惱‧勵劫亦令生。」\n"+
		"　　第三此心發起之量。如前已說‧應當了知。"
		,
		/*===========================第 231 頁===========================*/
		"　　第四儀軌正受者。如大覺云‧「欲修令此生‧應勵恆修習‧慈等四梵住‧應除貪及嫉‧\n"+
		"以儀軌正發。」若修心已‧於其發心獲得定解‧當行受此之儀軌。\n"+
		"<b><s>　此中分三‧<n>一</n>未得令得‧<n>二</n>已得守護不壞‧<n>三</n>設壞還出之方便。　初中分三‧<n>一</n>所受之境‧<n>二</n>能受之依‧\n"+
		"　<n>三</n>如何受之軌則。　　今初</s></b>\n"+
		"　　覺於尊長事次第中僅云‧「具相阿闍黎。」更未明說。諸先覺說‧「具足願心住其\n"+
		"學處‧猶非完足‧須具行心律儀。」此與勝敵論師說‧「當往具菩薩律儀善知識所‧」極相\n"+
		"符順。十法經中由他令受而發心者‧說有聲聞‧是說由彼勸令厭離而受發心‧非說聲聞為\n"+
		"作儀軌。\n"+
		"　　能受之依者。總如勝敵論師說‧「若善男子或善女人‧具足圓滿身及意樂。」謂天龍\n"+
		"等其身意樂堪發願心者‧一切皆可為此之依。然此中者如道炬釋論說‧「厭離生死‧憶念\n"+
		"死沒‧具慧大悲。」謂於前說諸道次第已修心者‧是於菩提心略為生起轉變意者。\n"+
		"<b><s>　如何受之儀軌分三‧<n>一</n>加行儀軌‧<n>二</n>正行儀軌‧<n>三</n>完結儀軌。　初加行軌分三‧<n>一</n>受勝皈依‧<n>二</n>積集資\n"+
		"　糧‧<n>三</n>淨修意樂。　初中分三‧<n>一</n>莊嚴處所安布塔像陳設供物‧<n>二</n>勸請皈依‧<n>三</n>說皈依學處。　　今</s></b>"
		,
		/*===========================第 232 頁===========================*/
		"<b><s>　初</s></b>\n"+
		"　　遠離罪惡眾生之處‧善治地基令其平潔‧以牛五物塗灑其地‧以栴檀等上妙香水而\n"+
		"善澆灑‧散妙香花。設三寶像謂鑄塑等‧諸典籍等‧諸菩薩像‧安置床座或妙棹臺。懸挂幡蓋\n"+
		"及香花等‧諸供養具盡其所有。又當預備伎樂飲食諸莊嚴具。用花嚴飾大善知識所居之\n"+
		"座。諸先覺等‧又於先時供養僧伽‧施食鬼趣集聚資糧。若無供具應如賢劫經說‧其碎布等\n"+
		"皆成供養‧有者則應無諸諂曲殷重求覓廣興供養‧令諸同伴心難容納。傳說西藏諸知識\n"+
		"在莽宇境及桑耶等處‧於覺前請發心時‧覺教曰‧「供養太惡不生。」所供像中‧須善\n"+
		"開光大師之像‧必不可少‧經典亦須攝頌以上諸般若經。次如尊長事次第說迎請聖衆‧誦\n"+
		"念三遍供養雲陀羅尼‧應讚誦之。其次弟子沐浴著鮮淨衣‧合掌而聽‧尊長開示福田海會\n"+
		"所有功德‧令其至心發生淨信‧教彼自想‧住於一一佛菩薩前‧徐徐念誦七支供養。先覺多\n"+
		"云‧「龍猛寂天所傳來者俱修七支‧慈氏無著所傳來者唯修禮拜供養二支。若修悔罪必\n"+
		"須追悔‧令意不喜‧菩提心者具足踴躍歡喜方生。」不應道理。大覺師於發心及律儀儀\n"+
		"軌說‧「禮敬供養等‧」以等字攝略。尊長事次第中‧於發心前明說七支‧又其因相‧若果如"
		,
		/*===========================第 233 頁===========================*/
		"是‧則龍猛及寂天派中‧亦當許不生。\n"+
		"　　第二者‧次說於師須住佛想‧故應作佛勝解‧禮敬供養‧右膝著地‧恭敬合掌‧為菩提心\n"+
		"而正請白‧「如昔如來應正等覺及入大地諸大菩薩‧初於無上正等菩提而發其心。如是\n"+
		"我名某甲‧亦請阿闍黎耶‧今於無上正等菩提而發其心。」乃至三說。次應為授殊勝皈依‧\n"+
		"謂佛為世尊‧法是大乘滅道二諦‧僧為不退聖位菩薩‧以為其境。時從今起乃至未證大菩\n"+
		"提藏‧為救一切諸有情故‧皈佛為師‧正皈於法‧皈僧為伴‧具此總意樂。特如道炬論說‧「以\n"+
		"不退轉心‧」當發猛利欲樂‧令如是心一切時中而不退轉‧威儀如前而受皈依‧「阿闍黎\n"+
		"耶存念‧我名某甲‧從今時始乃至證得大菩提藏‧皈依諸佛薄伽梵兩足中尊。阿闍黎耶存\n"+
		"念‧我名某甲‧從今時始乃至證得大菩提藏‧皈依寂靜離欲諸法衆法中尊。阿闍黎耶存念‧\n"+
		"我名某甲‧從今時始乃至證得大菩提藏‧皈依不退菩薩聖僧諸衆中尊。」如是三說。皈依\n"+
		"一一寶前‧各一存念‧及皈法文句與餘不同‧皆如覺所造儀軌。\n"+
		"　　皈依學處者。前下士時所說學處‧今於此中阿闍黎耶亦應為說。\n"+
		"　　積集資糧者。發心儀軌中‧於此亦說修禮供等。釋論中說修七支供‧憶念諸佛及諸菩"
		,
		/*===========================第 234 頁===========================*/
		"薩‧若昔若現諸善知識‧應如是行。供諸尊長者‧前供養時亦應了知。七支者普賢行願‧入行\n"+
		"論文‧隨一即可。\n"+
		"　　修淨心者。道炬論說慈心為先‧觀苦有情而發其心。謂令慈悲所緣行相‧皆悉明顯俱\n"+
		"如前說。\n"+
		"　　正行儀軌者。謂於阿闍黎前‧右膝著地或是蹲踞‧恭敬合掌而發其心。如道炬論云‧\n"+
		"「無退轉誓願‧應發菩提心。」儀軌中說‧「乃至菩提藏。」故非僅念為利他故願當成佛\n"+
		"而為發心‧是緣所發心乃至未證菩提誓不棄捨‧當依儀軌發此意樂。若於願心學處不能\n"+
		"學者‧則不應發如是之心。若用儀軌僅發是念‧為利一切有情我當成佛者‧則於發心學處‧\n"+
		"能不能學皆可授之‧願心容有如是二類。若用儀軌受其行心‧若於學處全不能學‧則一切\n"+
		"種決定不可。故有說云龍猛與無著所傳律儀儀軌‧於衆多人有可授不可授之差別者‧是\n"+
		"大蒙昧。復有一類造初發業行法論‧說受行心儀軌令數數受‧然全不知諸總學處及根本\n"+
		"罪‧未嘗宣說所學差別‧是令受行最大無義。教授勝光王經說‧「若不能學施等學處‧亦應\n"+
		"唯令發菩提心‧能生多福。」依據此意‧修次初篇云‧「若一切種‧不能修學諸波羅蜜多‧彼"
		,
		/*===========================第 235 頁===========================*/
		"亦能得廣大果故‧方便攝受亦當令發大菩提心。」此說若於施等學處不能修學‧容可發\n"+
		"心‧不可受戒‧最為明顯。\n"+
		"　　受心儀軌者。「惟願現住十方一切諸佛菩薩於我存念‧阿闍黎耶存念‧我名某甲‧若\n"+
		"於今生‧若於餘生‧所有施性戒性修性善根‧自作教他見作隨喜‧以此善根如昔如來應正\n"+
		"等覺及住大地諸大菩薩‧於其無上正等菩提而發其心。如是我名某甲‧從今為始乃至菩\n"+
		"提‧亦於無上正等菩提而發其心‧有情未度而當度之‧未解脫者而令解脫‧諸未安者而安\n"+
		"慰之‧未涅槃者令般涅槃。」如是三說。皈依儀軌‧及此二種‧雖未明說須隨師念‧然實須之。\n"+
		"此是有師之軌‧若未獲得阿闍黎者應如何受‧覺所造發心軌云‧「若無如是阿闍黎耶‧\n"+
		"自發菩提心之儀軌者‧自當心想釋迦牟尼如來及其十方一切如來‧修習禮供諸儀軌等‧\n"+
		"捨其請白及阿闍黎語‧皈依等次第悉如上說。」如此而受。\n"+
		"　　完結儀軌者。阿闍黎耶應為弟子‧宣說願心諸應學處。\n"+
		"<b><s>　第二得已守護不令失壞者‧謂當知學處‧故應宣說。此中分二‧<n>一</n>修學現法不退發心之因‧<n>二</n>修\n"+
		"　學餘生不離發心之因。　初中分四‧<n>一</n>為於發心增歡喜故‧應當修學憶念勝利‧<n>二</n>正令增長所</s></b>"
		,
		/*===========================第 236 頁===========================*/
		"<b><s>　發心故‧應當修學六次發心‧<n>三</n>為利有情而發其心‧應學其心不捨有情‧<n>四</n>修學積集福智資糧。\n"+
		"　　　今初</s></b>\n"+
		"　　若閱經藏或從師聞‧思菩提心所有勝利‧華嚴經中廣宣說故‧應當多閱。如前所引‧說\n"+
		"如一切佛法種子。又說總攝菩薩一切行願故‧猶如總示。謂若廣說支分無邊‧於總示中能\n"+
		"攝一切‧故謂總示。又如嗢柁南‧攝集一切菩薩道法所有扼要‧說為嗢柁南。菩薩地中所說\n"+
		"勝利‧是願心勝利。彼最初發堅固心有二勝利‧一謂成就尊重福田‧二能攝受無惱害福。第\n"+
		"一者如云‧「天人世間皆應敬禮。」謂發心無間‧即成一切有情所供養處。又如說云‧「發\n"+
		"心無間‧由種性門‧亦能映蔽諸阿羅漢。」謂成尊上。又說‧「雖作小福‧亦能出生無邊大果‧\n"+
		"故為福田‧一切世間悉應依止‧猶如大地。」謂如一切眾生父母。第二者‧如說得倍輪王護\n"+
		"所守護‧若寢若狂或放逸時‧諸惡藥叉宅神非人不能嬈害。若餘眾生為欲息滅疾疫災橫\n"+
		"所用無驗咒句明句‧若至此手尚令有驗‧何況驗者。由此顯示息災等業‧發心堅固則易成\n"+
		"辦。諸共成就‧若有此心亦得速成。隨所居處‧於中所有恐怖鬥諍‧飢饉過失非人損惱‧未起\n"+
		"不起設起尋滅‧轉受餘生少病無病‧不為長時重病所觸‧常為眾生宣說正法‧身無極倦念"
		,
		/*===========================第 237 頁===========================*/
		"無忘失心無勞損。\n"+
		"　　菩薩安住種性之時‧由其自性粗重微薄‧既發心已‧身心粗重轉復薄弱。由其成就堪\n"+
		"忍柔和‧能忍他惱不惱於他‧見他相惱深生悲惱‧忿嫉諂覆等多不現行‧設暫現起亦無彊\n"+
		"力‧不能久住速能遠離。難生惡趣‧設有生時速得解脫‧即於惡趣受小苦受‧即由此緣深厭\n"+
		"生死‧於彼有情起大悲心。菩提心福若有色形‧雖太虛空亦難容受‧以諸財寶供養諸佛‧尚\n"+
		"不能及此福一分。勇授問經云‧「菩提心福德‧假設若有色‧遍滿虛空界‧福尤過於彼。若人\n"+
		"以諸寶‧遍滿恆沙數‧諸佛剎土中‧供養世間依。若有敬合掌‧心敬禮菩提‧此供最殊勝‧此福\n"+
		"無邊際。」傳說覺繞金剛座時‧心作是念‧「當修何事而能速證正等菩提。」時諸小像\n"+
		"起立請問諸大像曰‧「欲速成佛當修何法。」答曰‧「當學菩提心。」又見寺上虛空之中‧\n"+
		"有一少女問一老婦‧亦如前答。由聞是已‧於菩提心‧心極決定。由是能攝大乘教授一切扼\n"+
		"要‧一切成就大寶庫藏‧超出二乘大乘特法‧策發菩薩行廣大行‧最勝依止‧應知即是菩提\n"+
		"之心。於修此心當漸增長勇悍歡喜‧如渴聞水‧乃至多劫以希有智‧最極深細觀察諸道‧諸\n"+
		"佛菩薩唯見此是速能成佛勝方便故。如入行論云‧「能仁多劫善觀察‧唯見此能利世間。」"
		,
		/*===========================第 238 頁===========================*/
		"<b><s>　正令增長所發心故‧修學六次發心分二‧<n>一</n>不捨所發心願‧<n>二</n>學令增長。　　今初</s></b>\n"+
		"　　如是以佛菩薩知識為證‧立彼等前立大誓願‧未度有情令度脫等。次見有情數類繁\n"+
		"多行為暴惡‧或見長久須經多劫勵力修行‧或見二種資糧無邊難行皆須修學‧為怯弱緣‧\n"+
		"若更捨置發心重擔‧較別解脫他勝之罪‧尤為重大。如攝頌云‧「雖經億劫修十善‧欲得獨\n"+
		"勝及羅漢‧爾時戒過戒失壞‧發心重過他勝罪。」此說菩薩毀犯尸羅‧以能防護二乘作意‧\n"+
		"即是菩薩最勝尸羅‧故若失此即是破戒。若未捨此‧縱於五欲無忌受用‧猶非破壞菩薩不\n"+
		"共防護心故。即前經云‧「菩薩受用五欲塵‧皈依佛法及聖僧‧作意遍智願成佛‧智者應知\n"+
		"住戒度。」若棄如是所受之心‧則須長夜馳騁惡趣。入行論云‧「於少惡劣物‧由意思布施‧\n"+
		"若人後不施‧說為餓鬼因。若於無上樂‧至心請喚已‧欺一切眾生‧豈能生善趣。」是故此論\n"+
		"又云‧「如盲於糞聚‧獲得妙珍寶‧如是今偶爾‧我發菩提心。」謂當思念我得此者極為希\n"+
		"有‧於一切種不應棄捨‧更當特緣此心‧多立誓願剎那不捨。\n"+
		"　　第二者‧如是不捨尚非滿足‧須晝三次及夜三次勵令增長。此復如前所說儀軌‧若能\n"+
		"廣作即如是行。若不能者‧則應明想福田‧供諸供養修慈悲等六返攝受。其儀軌者‧謂「諸"
		,
		/*===========================第 239 頁===========================*/
		"佛正法眾中尊‧乃至菩提我皈依‧以我所修布施等‧為利眾生願成佛。」每次三返。\n"+
		"　　學心不捨有情者。道炬論及發心儀軌中說學處時‧雖未說及‧道炬釋云‧「如是攝受\n"+
		"不捨有情‧於菩提心所緣及其勝利‧發心軌則‧共同增長及不忘故‧應當守護。」爾時數之\n"+
		"與根本文‧意無乖違‧故於此事‧亦應修學。心棄捨之量者‧依彼造作非理等事而為因緣‧便\n"+
		"生是念‧從今終不作此義利。\n"+
		"　　修學積集二種資糧者。從以儀軌受願心已‧當日日中供三寶等勤積資糧‧是能增上\n"+
		"菩提心因。此除先覺傳說而外‧雖未見有清淨根據‧然有大利。\n"+
		"<b><s>　第二修學餘生不離發心之因分二‧<n>一</n>斷除能失四種黑法‧<n>二</n>受行不失四種白法。　　今初</s></b>\n"+
		"　　大寶積經迦葉問品說成就四法‧於餘生中忘失發心‧或不現行。又成就四法乃至未\n"+
		"證菩提中間不忘菩提之心‧或能現行‧此即願心學處。四黑法中‧欺誑親教及阿闍黎尊重\n"+
		"福田者。當以二事了知‧一境‧二師易知‧言尊重者謂欲為饒益‧言福田者謂非師數‧然具功\n"+
		"德‧此是迦葉問品釋論所說。二即於此境由作何事而成黑法‧謂於此等隨一之境‧故知欺\n"+
		"誑則成黑法。欺誑道理者‧釋論解云‧「謂彼諸境以悲愍心舉發所犯‧以虛妄語而蒙迷"
		,
		/*===========================第 240 頁===========================*/
		"之。」總之凡以欺誑之心‧作蒙蔽師長等方便‧一切皆是。然諂誑非妄者‧如下當說‧此須虛\n"+
		"妄‧以集學論說斷除黑法即是白法。能治此者‧即四白法中第一法故。若於尊重啟白餘事‧\n"+
		"而於屏處另議餘事‧說善知識已正聽許‧亦是弟子欺蒙師長。\n"+
		"　　於他無悔令生追悔。其中亦二‧境者‧謂他補特伽羅修諸善事‧不具追悔。於境作何事\n"+
		"者‧謂以令起憂悔意樂‧於非悔處令生憂悔。釋論中說‧同梵行者正住學處‧以諂誑心令於\n"+
		"學處而生蒙昧。此上二法能不能欺‧生不生悔皆同犯罪‧釋論亦同‧然釋論中於第二罪作\n"+
		"已蒙昧。\n"+
		"　　說正趣大乘諸有情之惡名等。境者‧有說已由儀軌正受發心而具足者‧有說先曾發\n"+
		"心現雖不具為境亦同‧此與經違不應道理。其釋論中僅說菩薩餘未明說‧然餘處多說具\n"+
		"菩薩律學所學處者‧謂正趣大乘似當具足發心。於此作何事者‧謂說惡名等。由瞋恚心發\n"+
		"起而說‧與釋論同。對於何境而宣說者‧釋論說云‧「如彼菩薩欲求法者‧信解大乘或欲修\n"+
		"學‧為遮彼故對彼而說。」然了義者即可。其惡稱者如云本性暴惡‧未明過類。惡名者如云\n"+
		"行非梵行‧分別而說。惡譽者如云以如是如是行相‧行非梵行廣分別說。惡讚者通於前三"
		,
		/*===========================第 241 頁===========================*/
		"之後‧是釋論解。此於我等最易現行‧過失深重前已略說。又如菩薩起毀訾心‧則此菩薩須\n"+
		"經爾劫恆住地獄。寂靜決定神變經說‧唯除毀謗諸菩薩外‧餘業不能令諸菩薩墮於惡趣。\n"+
		"攝頌亦云‧「若未得記諸菩薩‧忿心諍毀得記者‧盡其惡心剎那數‧盡爾許劫更擐甲。」謂\n"+
		"隨生如是忿心之數‧即須經爾許劫更修其道‧則與菩提極為遙遠。故於一切種當滅忿心‧\n"+
		"設有現起‧無間勵力悔除防護。即前經云‧「應念此心非善妙‧悔前防後莫愛樂‧彼當學習\n"+
		"諸佛法。」若有瞋恚則其慈悲先有薄弱‧若先無者雖久修習亦難新生‧是斷菩提心之根\n"+
		"本。若能滅除違緣瞋恚‧如前正修則漸漸增長以至無量。釋量論云‧「若無違品害心成彼\n"+
		"本性。」又云‧「由前等流種‧漸次增長故‧此諸悲心等‧若修何能住。」\n"+
		"　　於他人所現行諂誑‧非增上心。境者‧謂他隨一有情。於此作何事者‧謂行諂誑。增上心\n"+
		"者釋論說為自性意樂。諂誑者謂於秤斗行矯詐等。又如勝智生‧實欲遣人往惹瑪‧而云遣\n"+
		"往垛壟‧後彼自願往惹瑪。集論中說‧此二俱因貪著利養增上而起‧貪癡一分。誑謂詐現不\n"+
		"實功德‧諂謂矯隱真實過惡‧言矯隱者謂於自過矯設方便令不顯露。\n"+
		"　　四白法中初白法中‧境者‧謂凡諸有情。事者‧謂於彼所以命因緣下至戲笑‧斷除故知"
		,
		/*===========================第 242 頁===========================*/
		"而說妄語。若能如是‧則於親教及軌範等殊勝境前‧不以虛妄而行欺惑。第二白法‧境者‧謂\n"+
		"一切有情。事者‧謂於彼所不行諂誑住增上心‧謂心正直住。此能對治第四黑法。第三白法‧\n"+
		"境者‧謂一切菩薩。事者謂起大師想‧於四方所‧宣揚菩薩真實功德。我等雖作相似微善‧然\n"+
		"無增相‧盡相極多‧謂由瞋恚毀訾破壞菩薩‧伴友‧而致窮盡。故能斷此及破壞菩薩者‧則集\n"+
		"學論說‧依補特伽羅所生諸過悉不得生。然於何處有菩薩住‧非所能知‧當如迦葉問經所\n"+
		"說‧於一切有情起大師想‧修清淨相。讚揚功德‧謂有聽者時至‧非說不往四方宣說便成過\n"+
		"咎‧此能對治第三黑法。第四白法‧境者‧謂自所成熟之有情。事者‧謂不樂小乘令其受取正\n"+
		"等菩提‧此就自己須令所化受行大乘。若彼所化不能發生大乘意樂‧則無過咎非所能故‧\n"+
		"由此能斷第二黑法。若由至心欲安立他於究竟樂‧定不為令他憂惱故‧而行令他憂惱加\n"+
		"行。師子請問經云‧「由何一切生‧不失菩提心‧夢中尚不捨‧何況於醒時。」答曰‧「於村或\n"+
		"城市‧或隨住境中‧令正趣菩提‧此心則不捨。」又曼殊室利莊嚴國土經說‧「若具四法不\n"+
		"捨大願‧謂摧伏我慢‧斷嫉‧除慳‧見他富樂心生歡喜。」寶雲經說‧「若於一切威儀路中修\n"+
		"菩提心‧隨作何善以菩提心而為前導‧於餘生中亦不捨離如此心寶‧如如若人多觀察。」"
		,
		/*===========================第 243 頁===========================*/
		"等明顯宣說。\n"+
		"　　第三犯已還出道理者。多作是說‧犯四黑法及心捨有情之五‧或加念云我不能成佛。\n"+
		"棄捨發心共為六種。若越一時則捨願心‧若一時內而起追悔‧僅是衰損因。若犯六次發心\n"+
		"及學二資糧‧亦唯衰損之因。若已失者應以儀軌重受願心‧若唯衰損因者則不須重受‧悔\n"+
		"除即可。其中若念‧我不能成佛‧故捨發心者‧即彼無間棄捨‧無待一時‧故一切種畢竟非理。\n"+
		"四黑法者‧非是現法失發心因‧是於他生令所發心不現起因‧故於現法而正遮止。道炬論\n"+
		"云‧「此為餘生憶念故‧如說學處應盡護。」言如說者‧謂如迦葉問品所說也‧即此經意亦\n"+
		"是如此。四白法時顯然說云‧「迦葉‧若諸菩薩成就四法‧一切生中生已無間‧菩提之心即\n"+
		"能現起‧乃至菩提中無忘失。」四黑法時‧雖無現後明文‧故亦當知是約後世。然於現法若\n"+
		"行黑法‧則所發心勢力微弱。若非爾者‧則具菩提心律儀者‧為戲笑故略說妄語‧於有情所\n"+
		"略起諂誑‧瞋恚菩薩略說惡名‧於他善根略令生悔‧自無追悔‧過一時竟‧皆當棄捨菩薩律\n"+
		"儀。以由此等棄捨願心‧若捨願心即捨律儀‧菩薩地中及集學論俱宣說故。若許爾者‧亦應\n"+
		"立彼為根本罪‧然任何中悉無立者‧不應理故。又算時者‧當是依於鄔波離請問經‧然彼全非"
		,
		/*===========================第 244 頁===========================*/
		"經義‧我於戒品釋中‧已廣決擇‧故此不說。心捨有情者‧若緣總有情‧謂我不能作此許有情\n"+
		"之事‧心棄捨者即捨願心‧極為明顯。若緣別有情‧謂我終不作此義利‧若起是心‧如壞一分\n"+
		"即壞整聚‧便壞為利一切有情所發之心。若不爾者‧則棄二三四等多有情已‧為餘有情而\n"+
		"發心者‧亦當能發圓滿菩提之心。\n"+
		"　　如是於此發心學處‧道炬釋論別說‧因陀羅補底‧龍猛‧無著‧勇識‧寂天‧大德月‧靜命等\n"+
		"派各有差別。有者許為盡初發心及行諸行所有學處。又有許為經說一切皆應守護。復有\n"+
		"許為盡資糧道所有學處。餘者有謂不許如此如此定相。有餘更許於其皈依學處之上‧應\n"+
		"護八法謂不忘心法及忘失心法。說此諸軌‧皆是經說‧應隨自師所傳受持。說云‧「我師所\n"+
		"說‧」許彼一切皆是經義。總此釋論‧從善知識敦巴所傳諸大知識‧皆不說是覺自造。拏\n"+
		"錯所傳‧則說是覺造是拏錯之秘法。然諸先覺傳說覺‧於補讓時作一略釋‧次在桑耶\n"+
		"譯師請其更為增釋‧覺教令廣之即可。是以覺所作略解‧更引眾談說之事而為增補‧\n"+
		"故亦略有數處謬誤‧然於正義亦多善說。諸無謬者‧我於餘處及道次中亦多引述。此說學\n"+
		"處多不可信。若以發心是為行心‧其學處者則於皈依學處之上‧僅加取捨白黑八法‧定非"
		,
		/*===========================第 245 頁===========================*/
		"完足故不應理。若單取願心者‧則其學處不須俱學經說一切‧及入行以後所有學處。若非\n"+
		"爾者‧則與律儀學處‧無差別故。除前所說二學處外諸餘學處‧是如道炬論及發心儀軌所\n"+
		"說。須學七法經者‧說是欲求速發通者所應修學‧故非發心特別學處‧此中不錄。如是自宗\n"+
		"除捨願心‧心捨有情犯餘學處‧乃至未具菩薩律儀‧無依菩薩之罪犯‧僅違所受中類善性\n"+
		"學處‧故是惡行應以四力而悔除之。從得菩薩律儀之後‧即犯違越律儀學處‧如論所說還\n"+
		"出罪法‧依行即可‧故即攝入行心學處‧非為別有。然六次發心‧是為願心不共學處。\n"+
		"<b><s>　第三既發心已於諸勝行修學道理分三‧<n>一</n>發心已後須學學處之因相‧<n>二</n>顯示學習智慧方便\n"+
		"　一分不能成佛‧<n>三</n>正釋學習學處之次第。　　今初</s></b>\n"+
		"　　如是發願心已‧若不修學施等學處‧雖如前引慈氏解脫經說有大勝利‧然不修學菩\n"+
		"薩學處定不成佛‧故於勝行應當修學。伽耶經云‧「菩提是以正行而為堅實‧諸大菩薩之\n"+
		"所能得‧非以邪行而為堅實諸人所有。」三摩地王經亦云‧「故以正行而為堅實‧何以故‧\n"+
		"童子若以正行而為堅實‧無上正等菩提非難得故。」言正行者謂成佛方便‧即是學習菩\n"+
		"薩學處故。修次初篇亦云‧「如是發心菩薩‧自未調伏不能伏他‧如是知已自於施等極善"
		,
		/*===========================第 246 頁===========================*/
		"修學‧若無正行不得菩提。」釋量論云‧「具悲為摧苦‧當修諸方便‧彼方便生因‧不現彼難\n"+
		"宣。」謂於他所‧若有大悲須除他苦。又除彼苦‧但有善心願其離苦猶非滿足‧故應轉趣除\n"+
		"苦方便。又若自不先趣方便‧不能度他‧故欲利他當先自調。又於自調‧經說「正行而為堅\n"+
		"實。」其正行者‧說「受律儀已‧學其學處。」故以正行為堅實者‧於所行處無錯為要。\n"+
		"<b><s>菩提道次第廣論卷九終</s></b>"
		,
		/*===========================第 247 頁===========================*/
		"<b><s>菩提道次第廣論卷十</s></b>\n"+
		"　　第二者‧如是欲求成佛猶非滿足‧應須進趣成佛方便。又此方便須無錯謬‧於錯謬道‧\n"+
		"任何勵力終不生果‧如欲搆乳而扯牛角。若雖不錯然不圓滿‧縱多勵力亦不生果‧猶如種\n"+
		"子及水土等‧隨缺一緣亦不生芽。故如修次中篇云‧「若於錯因殷重修習‧雖極長時終不\n"+
		"能獲所欲得果‧譬如從角而搆牛乳。若不修行一切因者‧亦不生果‧如種子等隨缺一緣‧亦\n"+
		"不發生芽等果故。故欲得果‧當依無錯一切因緣。」若爾何為圓滿無錯因緣耶‧如毘盧遮\n"+
		"那現證菩提經云‧「秘密主‧一切種智者‧從大悲根本生‧從菩提心因生‧以諸方便而至究\n"+
		"竟。」其中大悲如前已說。菩提心者謂世俗勝義二菩提心。方便者謂施等圓滿‧是蓮花戒\n"+
		"大師所說。\n"+
		"　　支那堪布等‧於如此道顛倒分別‧有作是云‧「凡是分別‧況惡分別‧即善分別亦能繫\n"+
		"縛生死‧其所得果不出生死。金索繩索皆是繫縛‧黑白二雲俱障虛空‧黑白狗咬皆生痛苦‧\n"+
		"是故唯有無分別住是成佛道。其施戒等為未能修如是了義愚夫而說‧若已獲得如是了"
		,
		/*===========================第 248 頁===========================*/
		"義‧更修彼行‧如王為農‧得象求跡。」和尚於此引八十種讚歎無分別經根據成立‧此說一\n"+
		"切方便之品‧皆非真實成佛之道。毀謗世俗‧破佛教之心藏‧破觀察慧思擇無我真實義故‧\n"+
		"故亦遠離勝義道理。任何勝進終唯攝於奢摩他品‧於此住心執為勝道‧是倒見中最下品\n"+
		"者‧蓮花戒大菩薩以淨教理已善破除‧宏揚如來所愛善道。然由聖教將近隱沒‧能以了義\n"+
		"無垢教理‧判決正道圓滿扼要‧諸善士夫亦盡滅亡。又諸有情多是薄福‧雖於正法略有信\n"+
		"仰‧然其慧力最極羸劣‧故現仍有輕毀行品持戒等事‧於修道時棄捨此等‧宛如和尚所教\n"+
		"而修。又有一類除不毀謗方便而外‧見解道理許和尚說而為善哉。又有餘者棄捨觀慧‧全\n"+
		"不思惟‧意許和尚修法為善。此等之道‧全未接近修空方所。縱許修空‧然若說云‧「已得無\n"+
		"倒空性之義‧無謬修習‧有修證者‧唯當修空‧不當更修世俗行品。」或說‧「行品不須執為\n"+
		"中心‧多門修習。」亦與一切聖教相違‧唯是違越正理之道。\n"+
		"　　以諸大乘人所應成辦‧是為無住大般涅槃。其能不住生死者‧是由覺悟眞實義慧‧依\n"+
		"勝義道次甚深之道‧智慧資糧智慧支分之所成辦故。不住寂靜般涅槃者‧是由了悟盡所\n"+
		"有慧‧俗諦道次廣大之道‧福德資糧方便支分之所成辦故。如秘密不可思議經云‧「智慧"
		,
		/*===========================第 249 頁===========================*/
		"資糧者‧謂能斷除一切煩惱。福德資糧者‧謂能長養一切有情。世尊‧以是因緣‧菩薩摩訶薩\n"+
		"當勤修習福智資糧。」聖虛空庫經云‧「由慧智故而能遍捨一切煩惱。由方便智故而能\n"+
		"不捨一切有情。」聖解深密經云‧「我終不說一向棄背利益眾生事者‧一向棄背發起諸\n"+
		"行所作者‧能得無上正等菩提。」無垢稱經云‧「何為菩薩繫縛解脫‧若無方便攝取三有\n"+
		"是為菩薩繫縛‧若以方便趣向三有是為解脫。若無智慧攝取三有是為菩薩繫縛‧若以智\n"+
		"慧趣向三有是為解脫。方便未攝慧為繫縛‧方便所攝慧為解脫。慧所未攝方便為縛‧慧攝\n"+
		"方便是為解脫。」如是廣說。是故欲得佛果‧於修道時須依方便智慧二分‧離則不成。伽耶\n"+
		"經云‧「諸菩薩道略有二種‧何等為二‧謂方便智慧。」祥勝初品云‧「般若波羅蜜多者是\n"+
		"母‧善巧方便者是父。」迦葉請問經云‧「迦葉‧譬如大臣‧所保國王則能成辦一切所作‧如\n"+
		"是菩薩所有智慧‧若由方便之所攝持‧能作一切諸佛事業。」故當修習完具施等一切方\n"+
		"便‧具一切種最勝空性。僅以單空‧於大乘道全無進趣。寶頂經云‧「應披慈甲住大悲處‧引\n"+
		"發具一切種最勝空性而修靜慮。何等名為具一切種最勝空性耶‧謂不離布施‧不離持戒‧\n"+
		"不離忍辱‧不離精進‧不離靜慮‧不離智慧‧不離方便。」如經廣說。上續論中釋此義云‧「此"
		,
		/*===========================第 250 頁===========================*/
		"諸能畫者‧謂施戒忍等‧具一切種勝‧空性為王像。」謂如有一善能畫首‧不善畫餘‧有知畫\n"+
		"手不知餘等‧集多畫師畫一王像‧若缺一師亦不圓滿。國王像者譬如空性‧諸畫師者譬如\n"+
		"施等。施等方便若有缺少‧則同缺頭殘手等像。\n"+
		"　　又若執謂唯應修空餘不應修‧世尊親為敵者而善破斥‧謂若果爾‧則菩薩時多劫行\n"+
		"施‧護尸羅等‧悉成壞慧未解了義。攝研經云‧「彌勒‧若諸菩薩為欲成辦正等菩提‧修行六\n"+
		"種波羅蜜多。然諸愚人作如是說‧菩薩唯應修學般若波羅蜜多‧何須諸餘波羅蜜多。此是\n"+
		"思惟‧破壞諸餘波羅蜜多。無能勝‧此作何思。前為迦希王時‧為救鴿故自肉施鷹‧豈慧壞耶。\n"+
		"彌勒白言‧不也世尊。世尊告曰‧彌勒‧我昔修行菩薩行時‧修集六種波羅蜜多相應善根‧是\n"+
		"諸善根有損我耶。彌勒白言‧不也世尊。世尊告曰‧無能勝‧汝亦曾於六十劫中正修布施波\n"+
		"羅蜜多‧六十劫中正修尸羅波羅蜜多‧六十劫中正修忍辱波羅蜜多‧六十劫中正修精進\n"+
		"波羅蜜多‧六十劫中正修靜慮波羅蜜多‧六十劫中正修般若波羅蜜多。彼諸愚人作如是\n"+
		"說‧唯以一法而證菩提‧謂以空法。此等未能清淨諸行。」故若說云‧有空解者不須勵力修\n"+
		"方便分‧是謗大師昔本生事‧為是未解了義之時。設作是念‧由種種門修施等行‧是未獲得"
		,
		/*===========================第 251 頁===========================*/
		"堅固空解‧若有空解即此便足‧是大邪見。此若是實‧則已獲得無分別智‧證勝義諦大地菩\n"+
		"薩‧及諸特於無分別智獲得自在八地菩薩不須修行‧然此非理。十地經說‧「於十地中雖\n"+
		"各各地‧於施等行別別增上‧然於餘行非不修行。」故一一地中說皆修六度或修十度‧此\n"+
		"等經義‧無能勝尊龍猛無著‧皆如是釋‧定不可作餘義解故。\n"+
		"　　特八地位滅盡一切煩惱‧安住寂滅一切戲論勝義之時‧諸佛於彼作是勸云‧「唯此\n"+
		"空解不能成佛‧聲聞獨覺‧亦皆得此無分別故。當觀我身及智土等‧此無量德‧我之力等汝\n"+
		"亦非有‧故當精進。又當思惟‧未能靜寂諸有情類種種煩惱之所逼惱‧亦復不應棄捨此\n"+
		"忍。」尚須修學菩薩諸行。得少三昧便生喜足‧棄捨餘德‧誠為智者所輕笑處。如十地經云‧\n"+
		"「佛子‧若有菩薩安住菩薩此不動地‧諸佛世尊於此安住法門之流‧發宿願力‧為令善修\n"+
		"如來智慧‧作是教言‧善男子善哉善哉‧當隨證悟一切佛法‧此雖亦是勝義法忍‧然汝尚無\n"+
		"我之十力及無畏等圓滿佛法。為遍求此圓滿佛法故‧當發精進‧亦不應捨此法忍門。善男\n"+
		"子‧汝雖得此靜寂解脫‧當思此諸異生凡夫未能靜寂‧起種種惑種種損惱。又善男子‧當念\n"+
		"宿願‧饒益有情‧不可思議智慧之門。又善男子‧此乃諸法法性‧隨諸如來出不出世‧然此法"
		,
		/*===========================第 252 頁===========================*/
		"界恆常安住。謂一切法空性‧一切法不可得性。非以此故差別如來‧一切聲聞獨覺亦皆得\n"+
		"此無分別法性。又善男子‧當觀我身無有限量‧無量智慧‧無量佛土‧無量成辦智‧無量光明\n"+
		"輪‧無量清淨音聲‧汝亦當如是修。」十地經又說‧「譬如大船入大海已‧順風所吹一日進\n"+
		"程‧未入海前勵力牽行‧縱經百年亦不能進。如是已至八地‧不待策勵‧須臾進趣一切智道。\n"+
		"若未得入此地之前‧縱經億劫勵力修道‧亦不能辦。」故若唱言有速疾道‧不須修學菩薩\n"+
		"行者‧是自誑自。\n"+
		"　　設謂非說不須施等‧然即於此無所思中完具施等‧不著所施能施施物具無緣施‧如\n"+
		"是餘度亦悉具足。經中亦說一一度中攝六六故。若僅由此便為完足‧則諸外道心一境性\n"+
		"奢摩他中‧亦當具足一切波羅蜜多‧於住定時亦無如是執著故。特如前說聲聞獨覺‧於諸\n"+
		"法性無分別時‧應成大乘‧具足一切菩薩行故。若因經說‧一一度中攝六六度‧便以為足‧若\n"+
		"爾供獻曼陀羅中「具牛糞水即是施」等文‧亦說具六‧唯應修此。故見攝行‧方便攝慧者‧\n"+
		"譬如慈母喪失愛子‧憂惱所逼‧與諸餘人言說等時‧任起何心‧憂惱勢力雖未暫捨‧然非一\n"+
		"切心皆是憂心。如是解空性慧‧若勢猛利‧則於布施‧禮拜‧旋繞‧念誦等時‧緣此諸心雖非空"
		,
		/*===========================第 253 頁===========================*/
		"解‧然與空解勢力俱轉‧實無相違。如初修時若菩提心猛勢為先‧入空定時‧其菩提心雖非\n"+
		"現有‧此力攝持亦無相違‧故於如此名無緣施。若全無捨心則不能施‧如是於餘亦當了知。\n"+
		"方便智慧不離之理‧當知亦爾。又經宣說福資糧果‧為生死中身及受用長壽等事‧亦莫誤\n"+
		"解。若離智慧善權方便雖則如是‧若由此攝持‧亦是解脫一切智因。如寶鬘論云‧「大王總\n"+
		"色身‧從福資糧生。」教證無邊。又汝有時說一切惡行一切煩惱惡趣之因‧皆能變為成佛\n"+
		"之因‧有時又說施戒等善增上生因‧是生死因非菩提因‧應當令心正住而說。\n"+
		"　　又如經說‧「著施等六‧是為魔業。」三蘊經說‧「墮所緣故而行布施‧由戒勝取守護\n"+
		"戒等‧如是一切皆悉懺悔。」梵問經云‧「盡其所有一切觀擇‧皆是分別‧無分別者‧即是菩\n"+
		"提。」於此等義亦莫誤解。\n"+
		"　　初經義者‧謂於二我顛倒執著‧所起施等未清淨故‧說為魔業‧非說施等皆是魔業。若\n"+
		"不爾者‧六度俱說‧靜慮般若亦當許為是諸魔業。\n"+
		"　　第二經義亦於顛倒執著所起未清淨者‧作如是說‧非說不應修習施等。若不爾者‧說\n"+
		"墮所緣而行布施‧則不須說墮所緣故‧理應總云行施當悔‧然未作如是說故。修次下編如"
		,
		/*===========================第 254 頁===========================*/
		"是回答‧理最切要。若倒解此‧則一切行品皆為補特伽羅或法我相執‧許為有相故。\n"+
		"　　又若捨心念捨此物‧及防護心防此惡行‧如是等類諸善分別‧一切皆是執著三輪法\n"+
		"我執者‧則諸已得法無我見‧於一切種理應斷除‧如瞋慢等不應習近。又諸分別念此為此‧\n"+
		"一切皆是分別三輪法我執者‧則思知識所有功德‧及思暇滿‧死沒無常‧諸惡趣苦‧淨修皈\n"+
		"依‧從如此業起如是果‧大慈大悲及菩提心‧修學行心所有學處‧一切皆思此者為此‧此從\n"+
		"此生‧此中有此功德過患而引定解。如於此等增長定解‧當是漸增諸法我執‧又法無我增\n"+
		"長定解‧此道定解漸趣微劣。行見二品違如寒熱‧故於二品全無發生猛利恆常定解之處。\n"+
		"故如果位安立法身為所應得‧及立色身為所應得‧二無相違。於如是道時二我相執所緣\n"+
		"之事‧雖微塵許戲論永離‧引發定解‧及於此從此生‧此中有此功德過失‧引發定解‧二須無\n"+
		"違。此復依賴因位正見‧決擇二諦之理‧故以教理決擇生死涅槃一切諸法‧於自本性無少\n"+
		"自性立勝義量‧與因果法各各決定無少紊亂‧安立因果名言之量‧此二互相‧況為能損所\n"+
		"損‧實互為伴。獲此定解‧其後乃為證二諦義‧始得墮入獲得諸佛密意數中。此理於毘缽舍\n"+
		"那時‧茲當廣說。"
		,
		/*===========================第 255 頁===========================*/
		"　　第三經義‧其經文時正是觀擇生等之時‧故說施等眞實無生。言分別者‧顯其唯是分\n"+
		"別假立‧非說施等不應習近而應棄捨。是故乃至未成佛前‧於此諸行無不學時‧故須學習\n"+
		"六度等行。此復現在當由至心勵力修行‧諸能修者策勵而修‧暫未能者當為願境‧於能修\n"+
		"習此等之因‧集聚資糧‧淨治業障‧廣發大願‧是則不久當能修行。若不如是行‧執自不知及\n"+
		"不能行‧謂於此等不須學者‧自害害他‧亦是隱滅聖教因緣‧故不應爾。集經論云‧「觀察無\n"+
		"為厭有為善‧是為魔業。知菩提道而不尋求波羅蜜多道‧是為魔業。」又云‧「若諸菩薩離\n"+
		"善方便‧不應勤修甚深法性。」不可思議秘密經云‧「善男子‧如火從因燃‧無因則滅。如是\n"+
		"從所緣境心乃熾然‧若無所緣心當息滅。此諸善巧方便菩薩般若波羅蜜多遍清淨故‧亦\n"+
		"能了知息滅所緣‧於諸善根不滅所緣‧於諸煩惱不生所緣‧安立波羅蜜多所緣‧亦善觀察\n"+
		"空性所緣‧於一切有情以大悲心亦觀所緣。」此中別說無緣有緣‧當善分別。如是煩惱及\n"+
		"執相縛當須緩放‧學處之索則當緊束‧當壞二罪‧不當滅壞諸善所作。學處繫縛與執相縛‧\n"+
		"二事非一‧護律緩放與我執縛緩放‧二亦不同。一切種智由多因成‧僅一一因非為完足。獲\n"+
		"妙暇身‧本當從其種種門中而取堅實‧若說一石驚飛百鳥‧修道一分不修餘者‧當知是遮"
		,
		/*===========================第 256 頁===========================*/
		"二資糧門不善惡友。\n"+
		"　　又大小乘‧亦是修時學不學習無邊資糧‧曰少分乘及曰小乘‧二是異名‧少分義者是\n"+
		"一分故。現在劣果飲食等事‧尚須眾多因緣成辦‧而於士夫第一勝利‧欲修成佛‧反計一分\n"+
		"而為完足‧極不應理。果隨因行‧是諸緣起法性爾故。悲華於此密意說云‧「少分成少分‧一\n"+
		"切成一切。」如來出現經云‧「若諸如來出現於世‧非一因緣‧何以故‧最勝子‧諸如來者要\n"+
		"以十億無量正因‧乃能成辦。何等為十‧謂以無量福智資糧圓滿正因。」乃至廣說。無垢\n"+
		"稱經亦云‧「諸友伴‧如來身者從百福生‧從一切善法生‧從無量善道生。」如是廣說。龍猛\n"+
		"菩薩亦云‧「若佛色身因‧如世間無量‧爾時法身因‧如何而可量。」如是方便智慧‧以六波\n"+
		"羅蜜多總攝修學者‧如前所說是諸密咒與波羅蜜多二所共同。諸大咒典釋諸宮殿及中\n"+
		"諸尊‧盡其所有‧一切皆是內心德時‧數數說為六波羅蜜多‧三十七菩提分‧十六空等圓滿\n"+
		"波羅蜜多道故。故除少數補特伽羅差別‧以諸欲塵為正道等‧與波羅蜜多所說略有取捨‧\n"+
		"當知諸餘唯是共學。若以上說而為種子‧善思惟已非一分道‧於全分道未獲定解‧則不能\n"+
		"知大乘總道。故具慧者‧當於此發堅固定解‧由多門中漸增大乘種性堪能。"
		,
		/*===========================第 257 頁===========================*/
		"<b><s>　第三解釋學習學處次第分二‧<n>一</n>於總大乘學習道理‧<n>二</n>特於金剛乘學習道理。　初中分三‧<n>一</n>淨\n"+
		"　修欲學菩薩學處‧<n>二</n>修已受取佛子律儀‧<n>三</n>受已如何學習道理。　　今初</s></b>\n"+
		"　　律咒二中‧若先未受各各律儀‧不可聽聞所有學處。此不同彼‧此諸學處先當善知‧淨\n"+
		"修相續‧次樂受者‧乃可授與諸律儀故。如菩薩地云‧「欲受菩薩淨戒律儀‧先應為說菩薩\n"+
		"法藏摩怛履迦‧其中所說菩薩學處及犯處相。若慧觀察自思擇已至心愛樂‧非為他勸非\n"+
		"為勝他‧當知是名堅固菩薩‧堪受菩薩淨戒律儀‧如受戒法‧彼亦應受亦應授彼。」故先了\n"+
		"知諸所學處‧為作意境。若於學處至心愛樂‧修欲學已‧次受律儀則極堅固‧是善方便。此及\n"+
		"下文二處宣說‧文恐太繁‧當於後釋。\n"+
		"　　第二者‧初當如何正受道理‧受已無間於根本罪及惡作罪防護道理‧設有毀犯還出\n"+
		"道理‧戒品釋中已廣決擇。未受律儀定須先閱‧如彼當知。\n"+
		"<b><s>　第三分三‧<n>一</n>何所學處‧<n>二</n>其中能攝諸學道理‧<n>三</n>於此如何學習次第。　　今初</s></b>\n"+
		"　　若廣差別雖無邊際‧隨類略攝‧於六度中盡攝菩薩諸應學事‧故六度者攝菩薩道一\n"+
		"切扼要大嗢柁南‧四攝亦即攝於其中。攝施易知‧愛語者是依六度教誡所化‧利行者是安"
		,
		/*===========================第 258 頁===========================*/
		"立他於所教義‧同事者是自亦同所化行故。又二資糧及三學等‧亦攝菩薩一切正道。然如\n"+
		"六度所引解了‧諸餘能攝則不能爾‧故以六度為能攝事最為第一。\n"+
		"<b><s>　第二分二‧<n>一</n>正義數量決定‧<n>二</n>兼說次第決定。　　今初</s></b>\n"+
		"　　佛薄伽梵略說六度總嗢柁南‧最勝紹尊如佛密意而為開解‧解釋如是重要因相‧令\n"+
		"發定智‧即此數量決定道理。若於此理獲勝定解‧則執六度修持為勝教授‧故當得定解。其\n"+
		"中分六。\n"+
		"　　觀待增上生數決定者。謂圓滿菩提廣大行者‧必須轉經無量生世。此復進道若無圓\n"+
		"滿德相之身‧如現在身略有少相‧縱勤修行實難增進‧故須身德一切圓滿。又須具足所受\n"+
		"用財‧能受用身‧同受用伴‧凡所作業悉能成辦‧四種圓滿。又此盛事亦多變為煩惱之緣‧故\n"+
		"須不隨煩惱力轉。此猶非足‧尚須對於諸取捨處‧能善分辨無倒進止。若不爾者‧猶如竹蕉\n"+
		"結子便枯‧騾孕自死‧即彼盛事而為害故。若有智慧‧知是往昔妙業之果‧更勤修因令漸增\n"+
		"長。若無智慧‧受盡先果而不增新‧後苦起首。故於餘生感六盛事‧非為無因‧不平等因‧其隨\n"+
		"順因定為六度。故於現法‧當修當習當多修習六到彼岸‧以殊勝因能感如是殊勝果故。此"
		,
		/*===========================第 259 頁===========================*/
		"是現前增上生果‧身圓滿等究竟增上生者‧唯佛地有。如莊嚴經論云‧「受用身眷作‧圓滿\n"+
		"增上生‧恆不隨惑轉‧諸事無顛倒。」\n"+
		"　　以如是身學菩薩行‧菩薩唯有二所作事‧謂正引發自利利他。是故觀待引發二利數\n"+
		"決定者。其修利他‧先須以財而作饒益。此若損惱有情而施亦無所濟‧善遮損他及所依事‧\n"+
		"利他極大‧故須尸羅。若不能忍他作怨害‧報一報二‧戒難清淨‧故戒究竟須耐怨害忍。由不\n"+
		"報復‧能免眾多他所造罪‧他若信樂堪令行善‧故是最大利他。自利者‧謂以慧力得解脫樂‧\n"+
		"若心散亂不能得此‧故須靜慮令心住定‧堪能如欲安住所緣。有懈怠者不能生此‧故須晝\n"+
		"夜發勤精進無有勞倦。此即彼等一切根本‧故修二利六度決定。如云‧「勤行利有情‧修捨\n"+
		"不害忍‧住脫及根本‧一切自利行。」此中利他非一切種‧言住脫者心住所緣‧是靜慮行跡‧\n"+
		"解脫生死是慧行跡‧若辨此二則於寂止‧不致誤為毘缽舍那。如是自許甚深持心‧亦僅是\n"+
		"此靜慮一分‧故於六度圓滿之體‧當求定解。\n"+
		"　　觀待引發圓滿一切利他數決定者。先以財捨除其匱乏‧次於有情不為損惱‧且忍怨\n"+
		"害‧於助他事發起精進而無厭離‧依於靜慮以神通等引攝其意‧若成法器次依智慧善說"
		,
		/*===========================第 260 頁===========================*/
		"斷疑‧令解脫故六度決定。如云‧「不貪及不害‧耐怨事無厭‧引攝善說故‧利他即自利。」此\n"+
		"二頌說修自他利‧不可不依六度‧若於引發自他利理‧獲得定解‧則能殷重修習六度。\n"+
		"　　觀待能攝一切大乘數決定者。謂已得財位無所貪著‧及於未得不希求故‧於諸財位\n"+
		"能不顧戀。有此則能守護學處‧受戒敬戒。依情非情所生眾苦‧能堪忍故不起厭患。修善所\n"+
		"作勇悍無厭‧修奢摩他無分別瑜伽‧及毘缽舍那無分別瑜伽。以此六事攝盡一切能趣大\n"+
		"乘‧此由六度次第引發‧無須更多。如云‧「不樂著受用‧極敬二無厭‧無分別瑜伽‧諸大乘唯\n"+
		"此。」由是因緣‧欲入大乘棄捨六度‧實為相違。\n"+
		"　　依一切種道或方便數決定者。謂於已得境界受用‧無貪欲道或方便者‧謂行惠施‧由\n"+
		"修能捨離彼貪故。諸未得境為得彼故功用散亂‧防護方便謂持淨戒‧由能安住比丘律儀‧\n"+
		"一切事業邊際散亂悉不生故。不捨有情方便謂能堪忍‧不厭怨害一切苦故。增善方便謂\n"+
		"發精進‧由發精進善增長故。淨障方便謂後二度‧靜慮伏惑‧般若能淨所知障故。故六度決\n"+
		"定。如云‧「不貪諸境道‧餘防為得散‧不捨有情增‧餘二能淨障。」又不隨已生欲塵散亂自\n"+
		"在轉者‧謂無貪施。若先未生預遮滅者‧則須尸羅‧防護無義非義散亂。惡行有情數多易遇‧"
		,
		/*===========================第 261 頁===========================*/
		"由此因緣退捨利他‧能對治者‧謂當修習有力堪忍。淨善眾多長時修作‧令增長者‧要由思\n"+
		"惟此勝利等‧發起恆常猛利勇進。暫伏煩惱‧須修靜慮。滅煩惱種及所知障‧謂須般若。此於\n"+
		"六度‧能與最大決定知解。\n"+
		"　　觀待三學數決定者。戒學自性即是戒度‧此要有施不顧資財‧乃能正受‧是戒資糧。既\n"+
		"正受已‧由他罵不報罵等忍耐守護‧忍是眷屬。靜慮心學‧般若慧學。精進遍通三學所攝‧故\n"+
		"六度決定。如云‧「依三學增上‧佛正說六度‧初學攝前三‧後二攝後二‧一通三分攝。」如是\n"+
		"當以何等勝身‧圓滿何等自他二利‧安住何乘。由具幾種方便之相‧修行何學‧能滿能攝如\n"+
		"是身‧利‧大乘‧方便及諸學者‧當知即是六波羅蜜。總攝菩薩一切修要大嗢柁南‧乃至未得\n"+
		"廣大定解應當思惟。又初不令超出生死‧其因有二‧謂貪資財及著家室。能治此者謂施及\n"+
		"戒。設暫出離‧不能究竟而復退墮‧其因有二‧謂由有情邪行眾苦長修善品而生厭離。能治\n"+
		"此者謂忍及進。以耐眾苦及他怨害‧經無量時猶如一日。善知修習勇悍之法‧若多修練發\n"+
		"起忍進‧則能對治退墮之因極為扼要。非但修此菩薩諸行‧即現在時修諸善行‧於少艱辛\n"+
		"忍力薄弱‧於所修道無大勇悍。以是因緣初入雖多‧然於中間能不退者‧實不多見‧皆由未"
		,
		/*===========================第 262 頁===========================*/
		"修忍辱精進教授所致。又於中間雖未退轉‧然有二種失壞之因‧謂心散亂不住善緣‧及壞\n"+
		"惡慧。對治此者‧謂靜慮‧般若‧佛說散心修念誦等無大義故。若於內明法藏之義無簡擇慧‧\n"+
		"雖於粗顯取捨之處‧亦起錯誤顛倒行故。此依斷除所對治品能治增上數量決定。依能成\n"+
		"辦一切佛法根本扼要數決定者。謂初四度是定資糧。以此四種能成不散靜慮度故‧依此\n"+
		"因緣若修妙觀‧則能通達真實義故。隨順成熟有情增上數決定者‧與前所說第三義同。此\n"+
		"是聖者無著所許‧如獅賢論師所立而說。對於六度引發定解‧最為切要。\n"+
		"　　第二兼說次第決定分三‧生起次第者‧若能布施於諸資財‧不顧不貪則能受戒。若具\n"+
		"尸羅善防惡行‧則於怨害而能堪忍。若有忍耐不厭難行‧退緣微少能發精進。若能晝夜發\n"+
		"勤精進‧能發正定‧心於善緣堪能安住。若心定者乃能如實通達真實。勝劣次第者‧前前微\n"+
		"劣‧後後殊勝。粗細次第者‧前較後者易轉易作‧故相粗顯‧後較前者難轉難作‧各較自前故\n"+
		"為微細。莊嚴經論云‧「依前而生後‧安住勝劣故‧粗顯微細故‧說如是次第。」\n"+
		"<b><s>　第三學此次第分二‧<n>一</n>初於總行學習道理‧<n>二</n>特於後二波羅蜜多學習道理。　初中分二‧<n>一</n>學習\n"+
		"　六度熟自佛法‧<n>二</n>學習四攝熟他有情。　初中分六‧<n>一</n>學習布施‧<n>二</n>持戒‧<n>三</n>忍辱‧<n>四</n>精進‧<n>五</n>靜慮‧<n>六</n>般</s></b>"
		,
		/*===========================第 263 頁===========================*/
		"<b><s>　若道理。　初中分四‧<n>一</n>布施度性‧<n>二</n>轉趣發起布施方便‧<n>三</n>布施差別‧<n>四</n>此等略義。　　今初</s></b>\n"+
		"　　菩薩地云‧「云何施自性‧謂諸菩薩不顧自身一切資具‧所有無貪俱生之思‧及此所\n"+
		"發能捨施物身語二業。」謂善捨思‧及此發起身語諸業。圓滿布施波羅蜜多‧不待於他捨\n"+
		"所施物‧捐除眾生所有貧窮。若不爾者‧現有眾多貧乏眾生‧過去諸佛所行布施‧當非究竟‧\n"+
		"是故身語非為主要‧唯心為主。謂自所有身財善根‧一切慳執皆悉破除‧至心施他。又非唯\n"+
		"此‧即諸捨報亦施有情‧由修此心到極圓滿‧即滿布施波羅蜜多故。如入行論云‧「若除眾\n"+
		"生貧‧是施到彼岸‧現有貧眾生‧昔佛如何度。一切有及果‧心與諸眾生‧說名為施度‧以是施\n"+
		"即心。」故修布施波羅蜜多‧現無財物可施於他‧當由多門引發捨心漸令增長。\n"+
		"　　第二者唯盡破除身財慳吝‧猶非布施波羅蜜多。慳是貪分‧小乘羅漢並其種子無餘\n"+
		"斷故‧故非唯除慳執施障‧須由至心發心施他一切所有。此須修習攝持過患‧惠施勝利‧故\n"+
		"當宣說。月燈經云‧「此腐爛色身‧命亦動無主‧如夢如幻化。愚夫由貪此‧造極重惡業‧而隨\n"+
		"罪惡轉‧不智被死乘‧當往那洛迦。」此說身不潔淨‧命常動搖如懸岩水‧身命俱是隨業自\n"+
		"在‧無我主宰‧觀其虛妄猶如夢幻滅除貪著。貪若未除則隨貪轉‧造大惡行而往惡趣。修無"
		,
		/*===========================第 264 頁===========================*/
		"邊門陀羅尼經云‧「諸有情鬥諍‧根本為攝持‧故於境斷愛‧斷愛得總持。」集學論云‧「如\n"+
		"是我身心‧一一剎那滅‧若以無常身‧垢穢常流注‧得常淨菩提‧豈非獲無價。」本生論云‧\n"+
		"「無我易壞無堅身‧眾苦無恩恆不淨‧此身若能饒利他‧不生歡喜非聰叡。」雖勤守護無\n"+
		"堅實身‧然定須捨‧若思施他能辦眾多自他義利‧未能如是淨修其心‧當自思擇我誠愚癡‧\n"+
		"故當發心施他身等。入行論云‧「捨一切涅槃‧我心修滅度‧一切終頓捨‧施諸有為勝。」攝\n"+
		"波羅蜜多論云‧「資財無常現可見‧若能任運起大悲‧當知布施極順理‧猶如他物寄自舍。\n"+
		"若施由此無恐怖‧置於自家生怖畏‧無足共他恆須護。若施無此諸過失‧由施能生他世樂‧\n"+
		"不施現法亦生苦‧人間諸財如流星‧定無不捨諸財物。諸未施財無常滅‧由施反成有財庫‧\n"+
		"饒利有情所惠施‧諸財無堅亦有實。若能惠施智者讚‧此諸愚夫樂集財‧攝持終無不離散‧\n"+
		"由施恆感諸盛事。由捨不起染污執‧慳非聖道生煩惱‧若施即是道中尊‧聖呵餘者為惡\n"+
		"道。」隨修大小一切善根‧至心迴向成辦有情‧現前究竟廣大利樂而行布施‧則由依於一\n"+
		"一有情得爾許福‧速當圓滿福德資糧。如寶鬘論云‧「如所說福德‧假說有色相‧盡殑伽沙\n"+
		"數‧世界難容納。此是世尊說‧正因亦現成‧有情界無量‧欲利亦復然。」又能障礙捨心增長‧"
		,
		/*===========================第 265 頁===========================*/
		"增長慳貪能令捨心未生不生‧已生退失‧所有眷屬及諸資財‧先已有者不應攝持‧若他施\n"+
		"與亦不應受。攝波羅蜜多論云‧「由何增長慳吝過‧或能不令捨心增‧虛誑攝持為障礙‧菩\n"+
		"薩應當盡斷除。若諸能障惠施心‧及障真正菩提道‧如是財寶或王位‧皆非菩薩所應取。」\n"+
		"如是行時‧若由慳心貪著資具‧應念能仁捨一切有而證菩提‧我亦誓願隨佛學習。我將身\n"+
		"財一切善根‧於有情所先已惠施‧若我今者仍貪資財而受用者‧如同諸象為日所逼‧入水\n"+
		"洗沐至乾岸已‧於地滾倒‧見土沾身仍下水洗次復如前‧如是思已當修無貪。即前論云‧\n"+
		"「應念諸佛殊勝行‧當自立誓思隨學‧為除貪著攝持故‧以善分別觀察心。我身已施諸眾\n"+
		"生‧施身果法我亦捨。我若反貪諸外物‧如象洗垢非我理。」如是多思能捨勝利‧若能引發\n"+
		"廣大歡喜‧及多思惟攝持過患‧若能引發極大怖畏‧則能任運生惠施心。\n"+
		"　　如是修習慈悲之心‧及善思惟諸佛菩薩傳記等後‧亦當引發能捨之心。發起道理者‧\n"+
		"如入行論云‧「身及諸受用‧三世一切善‧為利諸有情‧故當無惜施。」謂身受用善根三法‧\n"+
		"為所緣境‧思惟惠施一切有情。如是若於一切所有破我所愛‧數數修習施他之心‧是名菩\n"+
		"薩。如攝波羅蜜多論云‧「此等一切是汝物‧於此我無我所慢‧數數觀察此希有‧隨行正遍"
		,
		/*===========================第 266 頁===========================*/
		"覺功德‧誰有此德名菩薩‧難思勝士佛所說。」現在力弱勝解未熟‧意樂將身已施有情‧不\n"+
		"當真實施彼肉等‧然於身命‧若不淨修能捨意樂‧由未修故後亦不能惠施身命‧集學論中\n"+
		"作如是說‧故從現在當修意樂。集學論說‧如是至心於有情所‧已捨衣食及房舍等‧若受用\n"+
		"時當作是念‧為利他故受用此等。若忘此心‧愛著自利而受用者‧是染違犯。若無愛著‧或忘\n"+
		"安住緣利一切有情之想‧或貪利益餘一有情‧非染違犯。於已施他‧作他物想‧為自受用成\n"+
		"不與取‧若價滿足‧犯別解脫他勝處罪。此中有說‧以是迴施一切有情‧待一有情價不能滿‧\n"+
		"故無他勝。有餘師說‧於一一有情‧皆施全物‧前說非理。餘者又云‧雖已施他他未攝受‧故無\n"+
		"他勝。其密意者‧謂於人趣至心迴施‧他亦了知執我有時‧作他物想為自利取‧若價滿足可\n"+
		"成他勝‧故說是為他部之義‧亦不應理。若謂受用他有情物作利他事‧由作是念而受用者\n"+
		"悉無違犯。集學論云‧「以有主財護有主身‧若由是念受用無罪‧僕使恆時為主作業‧非自\n"+
		"有財以為存活。」設作是念‧此諸資具已施有情‧他未聽許用當有罪。無如是過‧即前論云‧\n"+
		"「譬如有僕善勤主事‧主因病等其心狂亂‧雖未聽許受用無罪。」現於有情一切不施‧以\n"+
		"心惠施實為欺誑‧故如此修全無堅實。莫生不信。即前論云‧「若有一類於如是行‧諸菩薩"
		,
		/*===========================第 267 頁===========================*/
		"前未見實施而不信解‧不應道理。當知捨心最希有故‧於此道理‧有起疑惑‧不應道理。」\n"+
		"<b><s>　第三布施差別有三‧<n>一</n>總一切依當如何行‧<n>二</n>觀待別依所有差別‧<n>三</n>布施自性所有差別。　　今\n"+
		"　初</s></b>\n"+
		"　　初中具六殊勝‧依殊勝者‧依菩提心‧由此發起而行布施。物殊勝者‧總諸施物無餘行\n"+
		"施‧若於別物而行施時‧亦應不忘總施意樂。所為殊勝者‧為令一切有情現前安樂究竟利\n"+
		"義而正惠施。善巧方便殊勝者‧經說無分別智之所攝持‧初發業者‧當以通達法無性慧之\n"+
		"所攝持。迴向殊勝者‧迴向施善於大菩提。清淨殊勝者‧攝大乘論說‧滅煩惱障及所知障。具\n"+
		"足六種波羅蜜多者‧如行法施防止聲聞獨覺作意‧是名持戒。於種智法信行堪忍‧忍恕他\n"+
		"罵‧為令法施倍復增長‧發起欲樂是名精進。心專一趣不雜小乘‧迴向此善於大菩提‧是名\n"+
		"靜慮。了知能施所施受者悉如幻化‧是名般若。具足六種力最強大‧此是八千頌廣釋所說。\n"+
		"　　第二者‧總之經說在家菩薩應修財施‧出家菩薩應行法施。菩薩別解脫經云‧「舍利\n"+
		"子‧若有在家菩薩‧以七珍寶充滿殑伽沙數諸佛國土‧供養如來應正等覺‧舍利子‧若有出\n"+
		"家菩薩‧開示宣說一四句頌‧此所生福極多於彼。舍利子‧如來未許出家菩薩修諸財施。」"
		,
		/*===========================第 268 頁===========================*/
		"集學論說‧此中密意障礙聞等‧謂遮出家特集財寶而行布施‧若無妨害自善所作‧由宿福\n"+
		"力多所獲得‧當行財施。霞惹瓦云‧「我不為汝說施功德‧我是宣說攝持過患。」是於出家\n"+
		"辛勤追求‧集積財寶而行布施‧令其淨戒多生瘡尤不喜之語。\n"+
		"　　施性差別有三‧法施者‧謂無顛倒開示正法‧如理教誨工巧等明‧世間無罪事業邊際‧\n"+
		"令受學處。無畏施者‧謂從王賊等人間怖畏‧獅虎鯨等非人怖畏‧水及火等大種怖畏救護\n"+
		"有情。\n"+
		"<b><s>　財施分二‧<n>一</n>實捨財施‧<n>二</n>唯意樂施。　初中分三‧<n>一</n>捨財道理‧<n>二</n>若不能捨當如何行‧<n>三</n>習近對治布\n"+
		"　施障礙。　初中分四‧<n>一</n>惠施何田‧<n>二</n>何心惠施‧<n>三</n>如何行施‧<n>四</n>施何等物。　　今初</s></b>\n"+
		"　　略有十種‧一諸親友於自有恩‧二諸怨敵謂作損害‧三中庸者俱無恩怨‧四有德者謂\n"+
		"具戒等‧五有過者謂戒犯等‧六劣於己‧七與自等‧八勝於自‧九者富樂‧十者貧苦。\n"+
		"　　意樂分二。初當具足何等意樂者‧緣所為事謂作是念‧當依此故圓滿無上菩提資糧‧\n"+
		"圓滿布施波羅蜜多。緣所施物‧謂於自物作他物解‧所施之物如取寄存‧當念菩薩一切所\n"+
		"有‧於有情所先已施故。緣行施田‧為善知識‧謂於來乞未乞諸田‧應念此等滿我布施波羅"
		,
		/*===========================第 269 頁===========================*/
		"蜜多‧當具如是三種意樂。攝波羅蜜多論云‧「乞者現前諸佛子‧為增菩提資糧故‧當於自\n"+
		"物住他想‧於他應起知識想。」施一一物‧念為如是如是而施‧緣所為事意樂廣說‧如妙手\n"+
		"問經及攝波羅蜜多論‧應行了知。如前所說緣田意樂‧於一切境皆應起故‧是總意樂。別意\n"+
		"樂者‧於諸怨害以慈意樂‧於諸有苦以悲意樂‧於諸有德以喜意樂‧於諸有恩以諸意樂而\n"+
		"行惠施。又於諸田當住捨心‧行善施果‧亦當迴施乞等有情‧特於苦田當住悲愍。如月稱云‧\n"+
		"「施謂離慳貪‧於諸器非器‧平等心等施‧此施施者淨‧悲施及施果‧二俱施來求‧此施無慳\n"+
		"吝‧善士所稱讚。」無量功德讚云‧「若見諸貧劣‧眾生有求心‧無悲希果報‧尋餘有德器‧意\n"+
		"壞雖行施‧等同諸乞丐‧故尊由大悲‧布施諸乞者。」\n"+
		"　　次當斷除何等意樂中‧無惡見取意樂者‧謂念布施全無果報‧及念殺害而行惠施以\n"+
		"為正法‧或計瑞相吉祥而施‧或念唯由布施圓滿‧便證世間出世離欲‧莫如是施。當無高舉\n"+
		"意樂者‧謂不毀求者‧不為勝他‧亦不施已而起憍慢‧謂我能施餘則不爾。清淨業障經說‧\n"+
		"「若諸異生行布施時‧於諸慳吝便生不信‧他發憤恚而墮地獄‧故於布施而為障礙。」又\n"+
		"說「守護戒時毀訾犯戒‧令多有情起不信心‧他由不信而墮惡趣‧住忍等時毀訾安住‧此"
		,
		/*===========================第 270 頁===========================*/
		"等逆品故障戒等。」故當如無量功德讚說而行。如云‧「汝聞慧大時‧未嘗自讚歎‧餘少德\n"+
		"眾生‧亦曾高恭敬‧自住功德時‧取自微惡行。」當無依止意樂者‧謂不望名稱而行惠施。當\n"+
		"無怯弱意樂者‧謂施前歡喜‧施時心淨‧施後無悔‧聞諸菩薩廣大施時‧莫自輕蔑恐怖退弱‧\n"+
		"增長勇悍。當無背棄意樂者‧謂於親怨及諸中庸不隨朋黨‧悲心而施。當無望報意樂者‧謂\n"+
		"非望他報恩而施‧觀諸眾生缺乏安樂‧愛火所燒‧無除苦力本性苦故。當無希望異熟意樂\n"+
		"者‧謂不希望後世異熟身財圓滿‧觀一切行悉無堅實‧無上菩提有勝利故。非破現前希此\n"+
		"諸果‧是破唯以三界身財為所欲得。復次當無邪命意樂‧謂念行施為國王等知其能施‧而\n"+
		"起敬事‧不應慮貧而不行施。又於乞者無欺誑心‧不喜忿恚‧心行散亂‧乞者來作種種邪行\n"+
		"應無厭患‧雖見乞者欺詐等過‧無宣布心‧從別別施生別別果‧深忍而施不為他動。\n"+
		"　　如何行施分二。不以何等加行而施者‧謂不速與稽留乃與‧令起煩惱然後乃與‧令行\n"+
		"非法或違世間道理之業而後施與‧先誓與此後減少給‧或給下劣‧數恩而與‧一時能與而\n"+
		"為漸次少少相給。自為國王奪他妻子而為惠施‧逼取父母奴輩等財而與餘者‧由能損害\n"+
		"他人方便而行惠施‧自懶惰住教他行施‧於來求者呵責嗤笑‧旁言輕弄粗言恐嚇而後給"
		,
		/*===========================第 271 頁===========================*/
		"與‧違越佛制學處而施‧不能如有資財而施‧長時積集然後頓施‧是為應斷‧故當捨離此等\n"+
		"加行。又諸菩薩見積集施其施有罪‧見隨得施其施無罪。謂若積集然後頓施‧福並無多‧及\n"+
		"於集時退卻眾多求資具者‧令生嫌恨‧後施諸餘未求者故。菩薩地中所說此等極為重要‧\n"+
		"謂見集時生長慳等眾多煩惱‧護等劬勞障多善行‧多於中間發生損失‧不能畢竟惠施事\n"+
		"故。\n"+
		"　　當以何等加行而捨者‧謂舒顏平視‧含笑先言‧隨對何田‧皆應恭敬。親手應時‧於他無\n"+
		"損‧耐難行苦而行惠施。此等果者‧如諦者品云‧「由恭敬施感親友等而為敬重‧由舒手施\n"+
		"感得承事‧由應時施感一切事應時成辦。」又云‧「不損他施感得堅固資財‧由忍苦施感\n"+
		"知心眷屬。」俱舍論說‧「舒手惠施得廣大財。」堅固資財者‧如俱舍釋說‧「他於資財不\n"+
		"能障難‧火等無毀。」又助他施加行者‧謂若自有可施財物‧見有慳吝‧曾未少施‧應往其家‧\n"+
		"歡喜安慰如是告言‧我家現有廣大資財‧我為圓滿布施波羅蜜多‧希欲乞者‧若有求者與\n"+
		"汝會過‧莫令空返‧可取我財惠施彼等‧或是將彼引到我所‧我行惠施當生隨喜。彼財無減\n"+
		"即便歡喜‧能如是行‧如是令彼漸種能除慳垢種子‧由漸修習自施少財‧依下無貪進得中"
		,
		/*===========================第 272 頁===========================*/
		"品‧依中無貪進得上品。如是若自親教軌範‧弟子‧助伴‧是慳貪性不能惠施‧或雖非慳然無\n"+
		"資財‧與彼資財令於三寶樹修布施‧自己不作。由此因緣自所生福彌更弘多‧令餘一類調\n"+
		"伏煩惱‧圓滿一類善法樂欲‧攝受有情成熟有情。如是若自現無資財‧應以工巧事業之處\n"+
		"集財惠施。或於他所宣正法語‧令諸貧者及慳吝者悉樂惠施。或諸求者教往俱信富饒之\n"+
		"家‧躬詣其所隨力隨能助其惠施。又於施物擇勝妙施‧及將所備可施財物圓滿惠施。\n"+
		"<b>菩提道次第廣論卷十終</b>"
		,
		/*===========================第 273 頁===========================*/
		"<b>菩提道次第廣論卷十一</b>\n"+
		"<b><s>　第四施何等物分二‧<n>一</n>略示應捨不應捨物‧<n>二</n>廣釋。　　今初</s></b>\n"+
		"　　謂由施此物‧能令現前離惡趣因‧引生樂受究竟利益‧能令斷惡或立善處。又於現前\n"+
		"雖無安樂‧然於究竟能生義利‧是則菩薩當施於他。若由施此‧現生逼惱後亦無義‧或雖現\n"+
		"樂於後有害‧不應施他。\n"+
		"<b><s>　第二分二‧<n>一</n>廣釋內物可捨不捨‧<n>二</n>廣釋外物可捨不捨。　　今初</s></b>\n"+
		"　　若知不捨內物道理‧與此相違知是應捨‧故當先說不捨道理。此中分三‧初就時門不\n"+
		"應捨者‧菩薩身等雖已至心先施有情‧然乃至未廣大悲意樂‧不厭乞求肉等難行‧縱有求\n"+
		"者亦不應捨。集學論云‧「由何能令精進厭患‧謂由少力而持重物‧或由長夜而發精進‧或\n"+
		"由勝解尚未成熟而行難行。」如施肉等‧此雖將身已施有情‧然於非時‧唯應遮止不令現\n"+
		"行。若不爾者‧能使菩薩厭諸有情‧由此失壞菩提心種‧故即失壞極大果聚。是故聖虛空庫\n"+
		"經云‧「非時欲行‧是名魔業。」入行論云‧「悲心未清淨‧不應捨其身‧若能成現後‧大利因"
		,
		/*===========================第 274 頁===========================*/
		"應捨。」就所為門不應捨者‧若為小事不應捨身。即前論云‧「能行正法身‧為小不應損‧如\n"+
		"是能速滿‧諸有情意樂。」若就自分已離慳等布施障礙‧而就他分若不捨身‧能辦眾多有\n"+
		"情利義大事之時‧有求肢等亦不應施。若為令作殺生等事‧俱害自他諸惡行故來乞求者‧\n"+
		"則自不應暫施於他。就求者門不應捨者‧若魔眾天‧或由彼天所使有情‧懷惱亂心來求肢\n"+
		"等‧不應捨與‧勿令於彼有損害故。若諸瘋狂心亂有情來乞求者‧亦不應與‧此等非是實心\n"+
		"來求‧唯於眾多浮妄言故。非但不施此等無罪‧施則成犯。除此等時來求身者‧則應施與。此\n"+
		"復有二‧謂割身支等畢究施與‧及為辦他如法事故‧為作僕等暫施自在。\n"+
		"<b><s>　第二廣釋外物捨不捨理分二‧<n>一</n>不捨外物道理‧<n>二</n>惠施外物道理。　　今初</s></b>\n"+
		"　　初中有五‧一就時門不應捨者。如於出家及諸近住‧施午後食。\n"+
		"　　二就施境門不應捨者。於持戒者‧施殘飲食‧或與便穢涕唾變吐膿血所雜所染飲食。\n"+
		"於諸不食葱蒜肉者‧不飲酒者‧縱欲飲食‧然具律儀不當授彼‧施與蒜等及所雜染。雖復先\n"+
		"以正言曉喻‧令其於施生歡喜心‧然於怨家藥叉羅叉兇暴所覆‧不知報恩‧諸忘恩惠來乞\n"+
		"求者‧與子僕等。病人來求非宜飲食‧或雖相宜‧然不知量而與飲食。若已飽滿性極饞嗜‧來"
		,
		/*===========================第 275 頁===========================*/
		"求妙食惠施妙食。若諸外道為求過端及非求知經典之義‧以財貨想而來乞求‧捨彼經典。\n"+
		"菩薩地中略說如是‧廣如菩薩地攝決擇分應當了知。如云‧「若是已寫完善經典‧有嬰兒\n"+
		"慧眾生來乞‧若施與之當知有罪‧若為施彼轉向餘求亦是有罪。若我令他持諸深法及觀\n"+
		"彼能如實信解‧唯以是思而惠施者‧是為無罪。若令諸具正信有情‧書寫相似正法典籍‧或\n"+
		"外道論‧或先已寫現在手中而施信者‧或從他乞而施與者‧是名有罪。手中現有已寫似典‧\n"+
		"菩薩應令改拭彼典書佛聖教‧自亦應知彼無堅實亦應為他說其非善。若諸紙葉猶未書\n"+
		"寫‧有來乞者‧爾時菩薩應問彼言‧汝今以此欲何所為‧若云轉賣以充食用‧菩薩若是將此\n"+
		"紙葉預書正法‧則不應施。若有財者應施價值‧若無價值‧二俱不施亦無有罪。若非預為寫\n"+
		"正法者‧應即施與‧令彼隨意受用安樂。如是若乞欲書最極下劣典籍‧不施無罪。如欲書寫\n"+
		"極惡典籍‧如是欲書中典亦爾‧若欲書寫最勝經典‧不施求者‧當知有罪。」\n"+
		"　　三就自身門不應捨者。若自了知‧於經卷等其義未辨‧又於經卷亦無慳垢而將經卷\n"+
		"惠施求者。此不應施之理者‧謂行如是法施‧為成三種隨一所須‧若不施者‧尚有後二殊勝\n"+
		"所須‧施則無故。初一所須已辦訖故‧謂我自心都無慳垢‧故慳煩惱不須更除‧若不施者‧見"
		,
		/*===========================第 276 頁===========================*/
		"增眾多妙智資糧‧施則無之。若不施者‧便能修集妙智資糧‧利益安樂一切有情‧即為愛念\n"+
		"此一有情及餘一切‧若施唯是愛此一故。菩薩地中所須輕重如是宣說。入行論亦云‧「為\n"+
		"小勿捨大‧」故不施此非僅無罪。不施方法者‧不應直言此不施汝‧要當施設方便善巧‧曉\n"+
		"喻遣發。方便善巧者‧謂諸菩薩先於所有一切資具‧以淨意樂迴向十方諸佛菩薩。譬如比\n"+
		"丘於法衣等為作淨故‧捨與親教軌範師等而守持之。由如是捨‧雖復貯蓄眾多資具‧亦名\n"+
		"安住聖種菩薩‧增無量福。此於如是一切資具‧如佛菩薩所寄護持。見乞者來‧若施與彼此\n"+
		"諸資具‧稱正理者應作是念‧諸佛菩薩無有少物不施有情‧思已而施。若不稱理‧即當念先\n"+
		"作淨施法‧由已捨故‧告言賢首‧此是他物不許施汝‧軟言曉喻。或以紙價二倍三倍施與遣\n"+
		"發‧令他了知菩薩於此非貪愛故不施於我‧定於此經不自在故‧不能施我。如是行者是巧\n"+
		"慧施。\n"+
		"　　四就施物門不應捨者。若自父母‧有蟲飲食‧妻子奴等未正曉喻‧雖正曉喻若不信解。\n"+
		"若自妻子形容軟弱‧族姓之人。雖說此等不施為奴‧然亦即是物之重者‧故墮物數。菩薩地\n"+
		"攝決擇分說‧若是三衣及餘長物佛所聽許‧無慳意樂於修善品極所須者‧雖不施與亦無"
		,
		/*===========================第 277 頁===========================*/
		"有罪。如云‧「出家菩薩除三衣外‧所餘長物佛所聽許‧身所受用順安樂住‧若故思擇施來\n"+
		"求者當知無罪。若顧善品非墮欲貪‧雖不施與亦唯無罪。」菩薩別解脫經云‧「舍利子‧若\n"+
		"諸菩薩重來求者‧捨與三衣‧此非修習少欲。」故出家菩薩施自三衣‧即是有犯。\n"+
		"　　五就所為門不應捨者。若有來乞毒火刀酒‧或為自害或為害他即便施與。若有來乞\n"+
		"戲樂等具‧能令增長墮惡趣因‧是應呵止‧反施彼物。若有來求或來學習罩羅罝弶為害有\n"+
		"情‧教施彼等。由此顯示‧凡害眾生身命資財‧皆不應學彼等教授。若為殺害或陸或水所住\n"+
		"眾生‧來乞水陸即施此等‧若為損害此國人民或為害他‧來求王位而行惠施‧若有怨家來\n"+
		"求仇隙‧施彼讎敵。\n"+
		"　　第二應施外物之道理者。若即此身非是大師所遮之時‧於彼補特伽羅捨所施物‧非\n"+
		"不稱理‧於彼相宜即應施與。又若自身與前相違‧於諸經卷有慳吝心‧雖未已辨經典之義‧\n"+
		"應施來求樂勝智者。此復若有二書即應施與‧若無二者應與書價‧價亦無者應作是念‧我\n"+
		"行此施‧縱於現法而成癡瘂‧不忍慳貪‧如是思已定當惠施。若所施物除前所說‧又自作王\n"+
		"時‧終不抑奪餘妻子等‧令離其主而轉惠施‧唯持村等可施求者‧如是不為墮惡趣因。諸戲"
		,
		/*===========================第 278 頁===========================*/
		"樂具及罩羅等‧不損於他眾生所居水陸之處‧不傷眾生無蟲飲食應施求者。若有來求毒\n"+
		"火刀酒‧為自饒益或饒益他‧即當施與。若如是行財施之時‧來二求者‧一貧一富應如何施。\n"+
		"先作是念‧設二求者來至我所‧若堪於二充足滿願‧即當俱施滿願充足‧若不堪者‧則當圓\n"+
		"滿貧者所願。由其先作如是念故‧若不能滿二所欲時‧即當滿足貧者所願‧應以軟語曉喻\n"+
		"富者‧告曰賢首‧我此資具於此貧者先已捨訖‧切莫思為特不施汝。受菩薩律初發業者‧如\n"+
		"是學施極為緊要‧故特錄出‧凡無別義者‧皆如菩薩地意趣而釋。\n"+
		"　　第二不能捨時當如何行者。若有求者正來求時‧為慳覆者‧應作是思‧此可施物定當\n"+
		"離我‧此亦棄我我亦捨此‧故應捨此令意喜悅‧攝取堅實以為命終。若捨此者‧則臨終時不\n"+
		"貪財物‧無所憂悔發生喜樂。如是思已仍不能捨‧如勇利經說‧「應以三事曉喻求者‧謂我\n"+
		"現今施力微弱善根未熟‧於大乘中是初發業‧隨不捨心自在而轉‧住於取見我我所執‧唯\n"+
		"願善士忍許‧不生憂惱。如何能滿汝及一切有情意樂‧我當如是漸次而為。」此是斷餘不\n"+
		"信過失‧非無慳過‧集學論說‧菩薩慳吝是應呵責‧然如是行似能遮免‧「由慳不施財法他\n"+
		"勝。」攝波羅蜜多論亦云‧「若有求者現在前‧力極微故不能施‧必令求者不退弱‧應以軟"
		,
		/*===========================第 279 頁===========================*/
		"語慰其意。以後若再來前乞‧必定不應令失悔‧當除慳吝諸過失‧為斷愛故應勤修。」\n"+
		"　　第三習近對治布施障。障者如攝決擇分略說四種‧謂未串習‧匱乏‧耽著‧未見大果。其\n"+
		"中初者‧謂雖現有可施財物‧然於求者不樂惠施‧能治此者應速了知如此過患‧是我於施\n"+
		"先未串習‧今若不施‧則於後世亦不樂施‧強思擇已而行惠施‧不隨未習過失而轉。第二者‧\n"+
		"由其財物極尠闕故不生捨心‧能治此者應作是念‧我於生死流轉之時‧或由宿業或繫屬\n"+
		"他‧於他人所未能饒益‧令我具受眾多難忍飢渴等苦。設由利他‧於現法中發生眾苦乃至\n"+
		"殞歿‧此施於我猶為善哉‧非空發遣諸來求者‧縱無彼財尚有菜葉可以活命‧如是思已‧忍\n"+
		"匱乏苦而行惠施。第三者貪可施物極為悅意最上勝妙‧於來求者不能生起捨與之心‧能\n"+
		"治此者應速了達耽著過失‧我今於苦倒執樂想‧由此能生當來眾苦‧如是知已斷除耽著‧\n"+
		"即將此物而行惠施。第四者未見行施能生正等菩提勝利‧觀見廣大資財勝利而發施心‧\n"+
		"能治此者當速見其過‧總應觀察一切諸行‧皆念念滅‧特觀資財速滅速離‧一切所施皆當\n"+
		"迴向廣大菩提。若唯顧視財等異熟‧則唯能得廣大財位‧不得解脫。如諸商賈為與價故‧一\n"+
		"切資財悉無吝惜捨與於他‧此唯得利非能得福。四百頌曰‧「云於此行施‧能生大果利‧為"
		,
		/*===========================第 280 頁===========================*/
		"報而行施‧如商利應呵。」\n"+
		"　　第二唯意樂布施者。內居閑靜由淨意樂淳厚淨信‧分別化現種種廣大無量財寶‧勝\n"+
		"解惠施一切有情‧以少功用生無量福‧亦名菩薩巧慧布施‧是菩薩地說。妙手問經雖說此\n"+
		"是無資財者所應修學‧非有財者不應修習。無資財時巧慧布施‧是為乃至未證增上清淨\n"+
		"意樂初極喜地‧若證此地‧則諸資財定無匱乏。如菩薩地云‧「如是菩薩現無財寶‧巧慧方\n"+
		"便而行布施‧此說乃至未證增上清淨意樂。若諸菩薩已證增上清淨意樂‧如已獲得超諸\n"+
		"惡趣‧如是生生必當獲得無盡財寶。」\n"+
		"　　第四此等略義者。正受菩薩律儀已‧學習大地布施道理‧發願修學。如前所說布施之\n"+
		"理‧當先了知現在進修開遮之處而勤學習‧特於慳吝身財善根而修對治‧勵力增廣能捨\n"+
		"之心‧能如是修應自慶喜‧心若未能如是薰修應生憂惱。若如是者‧則如妙手請問經說‧於\n"+
		"當來世‧少用功力能滿布施波羅蜜多。若此一切皆悉捨置‧即於現法亦當恆為重過所染‧\n"+
		"於當來世心不趣入‧極難趣入諸菩薩行。又如攝波羅蜜多論云‧「布施根本菩提心‧勿棄\n"+
		"如此能施欲‧世間具此能施欲‧佛說此為施中尊。」此說應當憶念修習菩提心‧為諸行所"
		,
		/*===========================第 281 頁===========================*/
		"依‧願證菩提即是一切能捨根本‧是為一切能捨之尊‧故於此心應勵力學‧此即總攝妙手\n"+
		"問經勝扼要義。\n"+
		"<b><s>　第二尸羅波羅蜜多分五‧<n>一</n>尸羅自性‧<n>二</n>趣入修習尸羅方便‧<n>三</n>尸羅差別‧<n>四</n>修尸羅時應如何行‧<n>五</n>\n"+
		"　此等攝義。　　今初</s></b>\n"+
		"　　從損害他及其根本‧令意厭捨‧此能斷心即是尸羅。由修此心增進圓滿‧即是尸羅波\n"+
		"羅蜜多。非由安立‧諸外有情悉離損惱‧為滿尸羅波羅蜜多。若不爾者‧現諸有情未離損惱‧\n"+
		"過去諸佛尸羅波羅蜜多應未圓滿‧亦不能導此諸有情‧往離損害諸方所故。是故其外一\n"+
		"切有情與諸損害隨離不離‧自相續上有離損他能斷之心‧修此即是受行尸羅。入行論云‧\n"+
		"「魚等有何處‧驅彼令不殺‧由得能斷心‧說為尸羅度。」戒雖有三‧此約律儀尸羅增上‧說\n"+
		"為斷心‧此復若具等起增上‧斷十不善是十能斷‧若就自性增上‧斷七不善是七能斷‧身語\n"+
		"業性。入中論疏云‧「此由不忍諸煩惱故‧不生惡故‧又由心中息憂悔火‧清涼性故‧是安樂\n"+
		"因‧為諸善士所習近故‧名為尸羅。此以七種能斷為相‧無貪無瞋正見三法為其等起‧故具\n"+
		"等起尸羅增上說十業道。」"
		,
		/*===========================第 282 頁===========================*/
		"　　第二趣入修習尸羅方便者。如是發心受學諸行‧此即誓辦一切有情‧令具正覺尸羅\n"+
		"妙莊‧應修其義。此復自須先生清淨戒力‧以自未能清淨尸羅及有虧損當墮惡趣‧況云利\n"+
		"他‧即自利義莫能辦故。故勤利他‧當愛尸羅不應緩慢‧必須力勵守護防範。攝波羅蜜多論\n"+
		"云‧「若具正覺戒莊嚴‧勤修一切眾生利‧先當善淨自尸羅‧發起清淨尸羅力。」又云‧「毀\n"+
		"戒無能辦自力‧豈有勢力而利他‧故勤善修利他者‧於此緩慢非應理。」如是能令尸羅清\n"+
		"淨‧依賴於諸進止之處‧如制行持。又此隨逐猛利堅固欲守護心‧故當久修‧未護過失善護\n"+
		"勝利‧而令發起欲護之心。初者如前論云‧「當見猛利大怖畏‧可斷雖小亦應斷。」謂由過\n"+
		"患深生怖畏‧雖於小罪勵力斷除。尸羅障品其粗顯者‧謂十不善所有過患‧如前已說當思\n"+
		"惟之。其勝利者前亦略說‧吉祥勇猛所說者‧即前論云‧「可愛天物及人財‧妙樂妙味天盛\n"+
		"事‧由戒因生有何奇‧當觀佛法皆此生。」又由依此‧能令相續輾轉勝進‧與諸菩薩大悲性\n"+
		"者共同學處‧永斷一切惡行種子‧得淨妙智。餘莊嚴具太老太少‧若著戴者成譏笑處‧非為\n"+
		"端嚴。尸羅莊飾‧老幼中年任誰具足皆生歡喜‧故為第一莊嚴之具。諸餘香者‧能薰順風非\n"+
		"薰逆風是有方限‧戒名稱香薰一切方。能除炎熱檀等塗香有違出家‧能除煩惱炎熱塗香‧"
		,
		/*===========================第 283 頁===========================*/
		"於出家者隨順無違。雖同具足出家之相‧具戒財者勝出餘人。即前論云‧「尸羅能得殊勝\n"+
		"道‧與諸悲性平等修‧清淨勝智以為性‧離過第一莊嚴具。遍薰三界悅意香‧塗香不違出家\n"+
		"眾‧行相雖同若具戒‧此於人中最超勝。」又雖未說虛讚邪語‧未以勤勇功力積集‧所須資\n"+
		"財任運而得‧不以暴業而令怖畏‧然諸眾生悉皆禮敬‧非為親屬‧先未利彼‧初本無識‧然諸\n"+
		"眾生自然慈愛‧足跡之塵亦為天人恭敬頂戴‧得者持去供為福田‧此諸勝利悉由戒生。即\n"+
		"前論云‧「未曾出言未力集‧能攝所須諸資具‧無怖世人悉敬禮‧無功未集得自在。非可說\n"+
		"為諸親族‧未作利益及除害‧先無相識諸眾生‧皆禮持戒勝士夫。足履吉祥諸塵土‧頂戴接\n"+
		"受諸天人‧稽首禮拜得持供‧故具尸羅為勝種。」如是智者善為思惟‧功德過失應善守護。\n"+
		"即如此論云‧「菩薩應護諸尸羅‧莫耽自樂而破壞。」又云‧「得自在故恆受樂‧智讚護戒\n"+
		"妙莊嚴‧圓滿具足諸學處‧極圓無慢依尸羅。」又護尸羅非唯為自怖畏惡趣‧及唯希望人\n"+
		"天盛事‧當為安立一切有情於妙尸羅。即前論云‧「若欲安立無邊世‧一切有情於淨戒‧為\n"+
		"利世故修尸羅‧說為尸羅到彼岸。非畏惡趣希王位‧及願善趣諸圓滿‧唯願善護淨尸羅‧為\n"+
		"利世間而護戒。」"
		,
		/*===========================第 284 頁===========================*/
		"<b><s>　第三戒差別分三‧<n>一</n>律儀戒‧<n>二</n>攝善法戒‧<n>三</n>饒益有情戒。　　今初</s></b>\n"+
		"　　菩薩地說‧即是七眾別解脫戒‧故若具足別解脫律儀而住菩薩律儀者‧或在家品或\n"+
		"出家品‧所有真實別解脫律儀‧及諸共同能斷律儀是律儀戒。若非堪為別解脫律儀之身\n"+
		"而具菩薩律儀者‧謂共別解脫斷除性罪及諸遮罪‧隨其所應能斷律儀‧是律儀戒。\n"+
		"　　攝善法者‧謂緣自相續六度等善‧未生令生‧已生不失令倍增長。\n"+
		"　　饒益有情者‧謂緣十一種利有情事‧如其所應引發彼等現法後法無罪利義。此等廣\n"+
		"如戒品釋中我已決擇‧定應於彼數數參閱。\n"+
		"　　故別解脫所制諸戒‧是諸出家菩薩律儀學處一分‧非離菩薩學處別有。三聚戒中律\n"+
		"儀戒者‧謂於真實別解脫戒或此共戒而正進止‧此於菩薩亦為初要‧故當學彼。攝決擇菩\n"+
		"薩地云‧「此三種戒‧由律儀戒之所攝持令其和合‧若能於此精進守護‧亦能精進守護餘\n"+
		"二‧若有於此不能守護‧亦於餘二不能守護。是故若有毀律儀戒‧名毀菩薩一切律儀。」是\n"+
		"故若執別解脫律是聲聞律‧棄捨此律開遮等制‧說另學餘菩薩學處‧是未了知菩薩戒學\n"+
		"所有扼要‧以曾多次說律儀戒‧是後二戒所依根本及依處故。律儀戒中最主要者謂斷性\n"+
		"罪‧攝諸性罪過患重者‧大小乘中皆說斷除十種不善‧故於彼等善護三業‧雖等起心莫令"
		,
		/*===========================第 285 頁===========================*/
		"現起。攝波羅蜜多論云‧「不應失此十業道‧是生善趣解脫路‧住此思惟利眾生‧意樂殊勝\n"+
		"定有果。應當善護身語意‧總之佛說為尸羅‧此為攝盡尸羅本‧故於此等應善修。」月稱論\n"+
		"師於尸羅波羅蜜時‧亦說是斷十種不善‧十地等經多如是說‧故先於此如前所說修靜息\n"+
		"心‧則諸餘戒亦易成辦。\n"+
		"　　第四如何修此等者。謂應具足六種殊勝‧及具六種波羅蜜多而正修習。具六波羅蜜\n"+
		"多修時‧自住尸羅‧亦能將他安住尸羅是尸羅施‧餘如前說。\n"+
		"　　第五此等攝義者。諸行所依謂菩提心‧不應失壞漸令增長者‧是為趣入戒等諸行所\n"+
		"有根本‧亦是第一遮止損害一切有情。大地以上所持尸羅為所願境‧於初發業諸進止處‧\n"+
		"當從現在至心修學。特當了知十不善等性遮諸罪‧日日多起防護之心‧又於自受律儀諸\n"+
		"根本罪‧尤應勵力數起防護。若如是行於當來世‧由其造作等流果力‧能以少勞少苦圓滿\n"+
		"諸菩薩學處。若今棄捨彼等‧則恆常為極重墮罪之所染污‧且於多生將不堪學菩薩學處。\n"+
		"故當從今精勤而行。\n"+
		"<b><s>　忍波羅蜜多分五‧<n>一</n>忍之自性‧<n>二</n>趣入修忍之方便‧<n>三</n>忍之差別‧<n>四</n>修忍時如何行‧<n>五</n>此等攝義。\n"+
		"　今初</s></b>"
		,
		/*===========================第 286 頁===========================*/
		"　　耐他怨害‧安受自身所生眾苦‧及善安住法思勝解。此等違品亦有三種‧初謂瞋恚‧次\n"+
		"謂瞋恚及怯弱心‧三謂不解無其樂欲。圓滿忍辱波羅蜜多者‧唯由自心滅除忿等修習圓\n"+
		"滿‧非為觀待一切有情悉離暴惡‧非能辦故‧調伏自心即能成辦所為事故。入行論云‧「惡\n"+
		"有情如空‧非能盡降伏‧唯摧此忿心‧如破一切敵。以皮覆此地‧豈有爾許皮‧唯以鞋底皮‧如\n"+
		"覆一切地。如是諸外物‧我不能盡遮‧應遮我自心‧何須遮諸餘。」\n"+
		"　　第二趣入修忍之方便者‧雖有多門‧且當宣說修忍勝利不忍過患。其中勝利如菩薩\n"+
		"地云‧「謂諸菩薩‧先於其忍見諸勝利‧謂能堪忍補特伽羅‧於當來世無多怨敵無多乖離‧\n"+
		"有多喜樂‧臨終無悔‧於身壞後當生善趣天世界中。見勝利已自能堪忍‧勸他行忍‧讚忍功\n"+
		"德‧見能行忍補特伽羅慰意慶喜。」攝波羅蜜多論云‧「若有棄捨利他意‧佛說忍為勝方\n"+
		"便‧世間圓滿諸善事‧由忍救護忿過失。是具力者妙莊嚴‧是難行者最勝力‧能息害心野火\n"+
		"雨‧現後眾害由忍除。諸勝丈夫堪忍鎧‧惡人粗語箭難透‧反成讚歎微妙華‧名稱花鬘極悅\n"+
		"意。」又云‧「忍為巧處成色身‧功德端嚴相好飾。」謂有情邪行不退利他‧從能摧壞眾多\n"+
		"善根忿恚怨敵而為救護‧下劣為害亦能堪忍‧是極悅意莊嚴之具。諸難行者破煩惱逼惱"
		,
		/*===========================第 287 頁===========================*/
		"最勝之力‧能滅害心大火之水‧諸暴惡人以邪行箭不能透鎧‧微妙色身具金色相‧奪諸眾\n"+
		"生眼觀意思‧是能造此黠慧巧師‧以如此等眾多勝利而為讚歎。入行論云‧「若勵摧忿勃‧\n"+
		"此現後安樂。」若能恆常修習堪忍不失歡喜‧故於現法一切時中常得安樂。於當來世破\n"+
		"諸惡趣生妙善趣‧畢竟能與決定勝樂‧故於現後悉皆安樂。此等勝利皆由忍生‧於此因果\n"+
		"關係乃至未得堅固猛利定解之時‧當勤修學。\n"+
		"　　瞋恚過患中‧不現見之過患者‧入行論云‧「千劫所集施‧供養善逝等‧此一切善行‧一\n"+
		"恚能摧壞。」此是如其聖勇所說錄於入行‧曼殊室利遊戲經說‧摧壞百劫所積眾善。入中\n"+
		"論亦說‧「由起剎那忿恚意樂‧能摧百劫修習施戒波羅蜜多所集諸善。」須瞋何境者‧或\n"+
		"說菩薩或說總境‧前者與入中論所說符合‧如云‧「由瞋諸佛子‧百劫施戒善‧剎那能摧\n"+
		"壞。」生恚之身者‧入中論釋說‧「菩薩生瞋且壞善根‧況非菩薩而瞋菩薩。」境為菩薩隨\n"+
		"知不知‧見可瞋相隨實不實‧悉如前說能壞善根。總其能壞善根‧非是定須瞋恚菩薩‧集學\n"+
		"論云‧「聖說一切有教中亦云‧諸比丘‧見此比丘以一切支禮髮爪塔‧發淨心否。如是‧大德。\n"+
		"諸比丘‧隨此覆地下過八萬四千踰繕那乃至金輪‧盡其中間所有沙數‧則此比丘應受千"
		,
		/*===========================第 288 頁===========================*/
		"倍爾許轉輪王位。」乃至「具壽鄔波離來世尊所‧恭敬合掌安住一面‧白世尊言‧世尊說\n"+
		"此比丘善根如是廣大‧世尊‧如此善根何能微薄銷滅永盡。鄔波離‧若於同梵行所而為瘡\n"+
		"患‧為瘡患已我則不見有如是福‧鄔波離‧此大善根由彼微薄銷滅永盡。鄔波離‧故於枯樹\n"+
		"且不應起損害之心‧況於有識之身。」壞善根義‧有諸智者作如是說‧摧壞先善速疾感果\n"+
		"之功能‧令果久遠‧先當出生瞋等之果‧非後遇緣不自生果‧以世間道皆不能斷所斷之種‧\n"+
		"定不能斷煩惱種故。然此理不定‧如諸異生‧以四對治力‧淨治不善所獲清淨‧雖非斷種‧然\n"+
		"後遇緣其異熟果定不生故。又已感異熟善不善業‧雖非斷種‧然後遇緣亦定不生異熟果\n"+
		"故。又加行道得頂忍時‧未斷邪見及惡趣因不善種子‧然遇緣時‧亦定不起邪見及惡趣故。\n"+
		"又如前引「諸業於生死隨重‧」隨先熟一善不善業‧暫遮餘業成熟之位‧僅以此義不能\n"+
		"立為壞善不善‧亦未說故。又異熟暫遠‧不能立為壞善根義‧若不爾者‧應說一切有力不善\n"+
		"業‧皆壞善根故。故於此中清辯論師如前所說‧以四種力淨治不善‧及由邪見損害之心摧\n"+
		"壞善根‧俱如敗種‧雖遇助緣而不發芽‧後雖遇緣亦不能生果。又如前說‧雖以四力淨所造\n"+
		"罪而得清淨‧而與發生上道遲緩無相違義。故有一類‧雖壞布施護戒之果圓滿身財‧然不"
		,
		/*===========================第 289 頁===========================*/
		"能壞修習能捨及能斷心作用等流‧後仍易起施戒善根。又有一類‧雖壞施戒作用等流同\n"+
		"類相續‧然未能壞發生圓滿身資財等。又有一類如前所說‧若不瞋恚授記菩薩‧一劫所能\n"+
		"圓滿道證‧由起瞋心自相續中已有之道‧雖不棄捨‧然一劫中進道遲緩。總之如淨不善‧非\n"+
		"須盡淨一切作用‧故壞善根亦非壞盡一切作用‧此極重要。唯應依止佛陀聖教‧及依教之\n"+
		"正理而善思擇‧故當善閱經教而善思擇。如是能引極非可愛粗猛異熟‧及能滅除餘業所\n"+
		"引最極可愛無量異熟‧是為非現見之過患。\n"+
		"　　現法過患者‧意不調柔心不靜寂。又諸喜樂‧先有失壞後不可得‧睡不安眠‧心失堅固\n"+
		"平等而住。若瞋恚重‧雖先恩養忘恩反殺‧諸親眷屬厭患棄捨‧雖以施攝亦不安住等。入行\n"+
		"論云‧「若持瞋箭心‧意不受寂靜‧喜樂不可得‧無眠不堅住。有以財供事‧恩給而依止‧彼反\n"+
		"於瞋恚‧恩主行弒害。由瞋親友厭‧施攝亦不依‧總之有瞋恚‧全無安樂住。」本生論亦云‧\n"+
		"「忿火能壞妙容色‧雖飾莊嚴亦無美‧縱臥安樂諸臥具‧忿箭刺心而受苦。忘失成辦自利\n"+
		"益‧由忿燒惱趣惡途‧失壞名稱及義利‧猶如黑月失吉祥。雖諸親友極愛樂‧忿墮非理險惡\n"+
		"處‧心於利害失觀慧‧多作乖違心愚迷。由忿串習諸惡業‧百年受苦於惡趣‧如極損他來復"
		,
		/*===========================第 290 頁===========================*/
		"讎‧怨敵何有過於此。此忿為內怨‧我如是知已‧士夫誰能忍‧令此張勢力。」此等過患皆從\n"+
		"忿起乃至未得決定了解應當修習。如入行論云‧「無如瞋之惡‧無如忍難行‧故應種種理‧\n"+
		"殷重修堪忍。」由見勝利過患為先‧應以多門勤修堪忍。初句之理由‧如入中論釋云‧「如\n"+
		"大海水‧非以秤量能定其量‧其異熟限亦不能定。故能如是引非愛果‧及能害善‧除不忍外‧\n"+
		"更無餘惡最為強盛。」若僅生最大非愛異熟而不壞善根‧則非如此最大惡故。然能雙具\n"+
		"引大異熟及壞善根所有惡行‧除瞋而外餘尚眾多‧謂誹謗因果所有邪見‧及謗正法‧並於\n"+
		"菩薩尊長等所起大輕蔑‧生我慢等‧如集學論應當了知。\n"+
		"<b><s>　第三忍差別分三‧<n>一</n>耐怨害忍‧<n>二</n>安受苦忍‧<n>三</n>思擇法忍。　初耐怨害忍分二‧<n>一</n>破除不忍怨所作\n"+
		"　害‧<n>二</n>破除不喜怨家富盛喜其衰敗。　初中分二‧<n>一</n>破除不忍障樂作苦‧<n>二</n>破除不忍障利等三作\n"+
		"　毀等三。　初中分二‧<n>一</n>顯示理不應瞋‧<n>二</n>顯示理應悲愍。　初中分三‧<n>一</n>觀察境‧<n>二</n>有境‧<n>三</n>所依瞋非\n"+
		"　應理。　　今初</s></b>\n"+
		"　　初中有四。一觀察有無自在不應瞋者。應當觀察‧於能怨害應瞋之因相為何。如是觀\n"+
		"已‧覺彼於自欲作損害意樂為先‧次起方便遮我安樂‧或於身心作非愛苦。為彼於我能有"
		,
		/*===========================第 291 頁===========================*/
		"自在不作損害‧強作損害而瞋恚耶‧抑無自在由他所使而作損害故瞋恚耶。若如初者瞋\n"+
		"不應理‧他於損害無自在故。謂由宿習煩惱種子境界現前‧非理作意‧因緣和合起損害心‧\n"+
		"縱不故思‧此諸因緣亦能生故。若彼因緣有所缺少‧則故思令生‧亦定不生故。如是由諸因\n"+
		"緣起損害欲‧由此復起損害加行‧由此加行生他苦故‧此補特伽羅無少主宰。以他亦隨煩\n"+
		"惱自在‧如煩惱奴而隨轉故。若他自己全無自在‧為餘所使作損害者‧極不應瞋。譬如有人‧\n"+
		"為魔所使隨魔自在‧於來解救饒益自者‧反作損害行捶打等。彼必念云‧此為魔使‧自無主\n"+
		"宰故如是行‧不少瞋此‧仍勤勵力令離魔惱。如是菩薩見諸怨家作損害時‧應如是思‧此為\n"+
		"煩惱魔使無主‧故如是行‧不少瞋此補特伽羅‧須更發心為欲令其離煩惱故‧我應勤修諸\n"+
		"菩薩行。如四百論云‧「雖忿由魔使‧醫師不瞋怪‧能仁見煩惱‧非具惑眾生。」月稱論師亦\n"+
		"云‧「此非有情過‧此是煩惱咎‧智者善觀已‧不瞋諸有情。」入行論中雖說多理‧然唯於此\n"+
		"易生定解‧對治瞋恚最為有力。菩薩地說修唯法想‧堪忍怨害與此義同‧故於此上乃至定\n"+
		"解當勤修習。若諸有情能有主宰皆應無苦‧以此諸苦非所願故‧有自在故。又諸有情若為\n"+
		"猛利煩惱激動‧尚於最極愛惜自身而作損害‧或跳懸岩‧或以棘刺及刀劍等‧而自傷害‧或"
		,
		/*===========================第 292 頁===========================*/
		"斷食等‧況於他人能不損哉‧應如是思滅除瞋恚。入行論云‧「一切皆他使‧他主自無主‧知\n"+
		"爾不應瞋‧一切如化事。」又云‧「故見怨或親‧為作非理時‧謂此因緣生‧思已當樂住。若由\n"+
		"自喜成‧皆不願苦故‧則一切有情‧皆應無有苦。」又云‧「若時隨惑轉‧自愛尚自殺‧爾時於\n"+
		"他身‧何能不為損。」\n"+
		"　　第二觀是客現及是自性皆不應瞋者。損他之過不出二事‧謂是否有情之自性‧若是\n"+
		"自性瞋不應理‧如不應瞋火燒熱性。若是客現亦不應瞋‧如虛空中有煙等現‧不以煙過而\n"+
		"瞋虛空‧應如是思滅除瞋恚。入行論云‧「若於他惱害‧是愚夫自性‧瞋彼則非理‧如瞋燒性\n"+
		"火。若過是客來‧有情性仁賢‧若爾瞋非理‧如瞋煙蔽空。」\n"+
		"　　第三觀其直間由何作損皆不應瞋者。若瞋直接發生損害能作害者‧應如瞋恚補特\n"+
		"伽羅瞋刀杖等。若瞋間接令生損害能作害者‧如刀杖等為人所使‧其人復為瞋恚所使而\n"+
		"作損害‧應憎其瞋。如云‧「杖等親為害‧若瞋能使者‧此亦為瞋使‧定應憎其瞋。」故不瞋杖‧\n"+
		"亦不應憎能使之人‧若瞋能使‧理則亦應瞋其瞋恚。不如是執‧即是自心趣非理道‧故應定\n"+
		"解一切道理悉皆平等‧令意不瞋補特伽羅‧如不瞋杖‧此未分別杖與能使有無怨心者‧由"
		,
		/*===========================第 293 頁===========================*/
		"前所說破自在理應當了知。\n"+
		"　　第四觀能發動作害之因不應瞋者。受由怨害所生苦時‧若是無因不平等因則不生\n"+
		"苦‧要由隨順眾因乃生。此因是宿不善業故‧由自業力發動能害令無自主‧故自所招不應\n"+
		"憎他‧作是念已應怪自致‧於一切種破除瞋恚。如那落迦所有獄卒‧是由自己惡業所起為\n"+
		"自作害。如云‧「我昔於有情‧曾作如是害‧故害有情者‧我理受此損。」又云‧「愚夫不願苦‧\n"+
		"愛著眾苦因‧由自罪自害‧豈應憎於他。譬如諸獄卒‧及諸劍葉林‧由自業所起‧為當憎於誰。\n"+
		"由我業發動‧於我作損害‧此作地獄因‧豈非我害他。」霞婆瓦云‧「若云非我所致‧實是顯\n"+
		"自全無法氣。」\n"+
		"　　觀察有境不應瞋者。若於怨害發生瞋恚‧是因於苦不能忍者誠為相違‧以不能忍現\n"+
		"在微苦‧極力引生惡趣無量大苦因故‧故應自念我極愚癡而自羞恥‧勵防莫瞋。如云‧「於\n"+
		"現在微苦‧我且不能忍‧何不破瞋恚‧地獄眾苦因。」其怨所生苦‧是我宿世惡業之果‧由受\n"+
		"此故盡宿惡業‧若能堪忍不造新惡‧增長多福。他似不顧自法退衰‧為淨我罪而行怨害‧故\n"+
		"於怨害應視其恩。如本生論云‧「若有不思自法衰‧為淨我惡而行損‧我若於此不堪忍‧忘"
		,
		/*===========================第 294 頁===========================*/
		"恩何有過於此。」入中論云‧「許為盡昔造‧諸不善業果‧害他忿招苦‧如反下其種。」如為\n"+
		"醫重病當忍針灸等方便‧為滅大苦而忍小苦‧最為應理。\n"+
		"　　觀察所依不應瞋者。一觀能害因及有過無過‧如云‧「他器與我身‧二者皆苦因‧由器\n"+
		"與身出‧為應於誰瞋‧如人形大瘡‧痛苦不耐觸‧愛盲我執此‧損此而瞋誰。」又云‧「有由愚\n"+
		"行害‧有因愚而瞋‧其中誰無過‧誰是有過者。」二觀自所受者‧若諸聲聞唯行自利‧不忍而\n"+
		"瞋且不應理。何況我從初發心時‧誓為利樂一切有情‧修利他行‧攝受一切有情。修利他行\n"+
		"攝受一切諸有情者‧如是思惟發堪忍心‧博朵瓦云‧「佛聖教者謂不作惡‧略有怨害不修\n"+
		"堪忍‧即便罵為‧此從根本破壞聖教‧由此即是自捨律儀。聖教根本由此破壞‧雖總聖教非\n"+
		"我等有‧自失律儀是滅自者。」又云‧「如翻鞍牛縛尾而跳鞍反擊腿‧若緩鞦落始得安樂‧\n"+
		"若於怨害而不緩息‧為其對敵反漸不安。」\n"+
		"　　第二理應悲愍者。謂當至心作是思惟‧一切有情無始生死‧無未為我作父母等親屬\n"+
		"友善‧又是無常命速分離‧常為三苦之所苦惱‧為煩惱魔之所狂魅‧滅壞自己現後利義‧我\n"+
		"當哀愍‧何可瞋恚及報怨害。"
		,
		/*===========================第 295 頁===========================*/
		"<b><s>　破除不忍障利等三作毀等三分二‧<n>一</n>破除不忍障譽等三‧<n>二</n>破除不忍作毀等三‧　初中分三‧<n>一</n>\n"+
		"　思惟譽等無功德之理‧<n>二</n>思惟有過失之理‧<n>三</n>故於破此應當歡喜。　　今初</s></b>\n"+
		"　　若他讚我稱我稱譽‧全無現法延壽無病等‧及無後世獲福德等二種利益。故彼失壞\n"+
		"若不喜者則無屋用‧沙屋傾塌愚童涕哭與我今者等無有異‧應自呵責而不貪著。如云‧\n"+
		"「讚稱及承事‧非福非長壽‧非力非無病‧非令身安樂‧我若識自利‧彼利自者何。」又云‧\n"+
		"「若沙屋傾塌‧兒童極痛哭‧如是失讚譽‧我心如愚童。」第二讚譽等者‧於諸非義令心散\n"+
		"亂‧壞滅厭離‧令嫉有德‧退失善事‧如是思已則於彼等令心厭離。如云‧「讚等令我散‧彼壞\n"+
		"厭離心‧嫉妬諸有德‧破壞圓滿事。」第三如是令我退失譽稱及利敬者‧是於惡趣救護於\n"+
		"我‧斬除貪縛遮趣苦門‧如佛加被‧如是思已‧應由至心滅瞋生喜。如云‧「故若有現前‧壞我\n"+
		"譽等者‧彼豈非於我‧救護墮惡趣。我為求解脫‧無須利敬縛‧若有解我縛‧我何反瞋彼。我欲\n"+
		"趣眾苦‧如佛所加被‧閉門而不放‧我何反瞋彼。」\n"+
		"　　第二破除不忍作毀等三者。心非有體非他能害‧若直害身間損於心‧毀等於身亦不\n"+
		"能損‧既於身心二俱無損故應歡喜‧如是思已斷除憂悒‧憂悒若滅‧瞋不生故。亦如論云‧"
		,
		/*===========================第 296 頁===========================*/
		"「意非有形故‧誰亦不能壞‧由耽著於身‧故身為苦損。毀訾及粗語‧並其惡名稱‧於身若無\n"+
		"害‧心汝何故瞋。」霞惹瓦云‧「若於康壟巴‧內鄔蘇巴‧照巴三人‧任說何語與向土石‧全無\n"+
		"差別‧故得安樂‧後時諸人耳根薄弱‧故無安樂。」若對馨敦說某作是言‧答曰‧「暗中訶罵\n"+
		"國王‧汝犯離間應當懺悔。」有謂慧金剛瑜伽師云‧「人說我等為伏後者。」答云‧「人不\n"+
		"於人作言說事‧又於何事。」次云‧「速斷離間。」若作是念‧由毀訾等則餘補特伽羅於我\n"+
		"不喜故不歡喜‧若餘不喜我‧於我有損可為實爾‧然此於自全無所損‧故應斷除不歡喜心。\n"+
		"如云‧「餘不喜於我‧此於現後世‧俱不損於我‧何故我不樂。」若作是念‧雖他不喜無損於\n"+
		"我‧然由依此‧即能障礙從他人所獲得利養‧故於毀訾毀謗傳惡名者而發憎憤。所得利養\n"+
		"須置現世‧瞋他之惡隨逐而行‧故無利養速疾死沒‧與以邪命長時存活‧前者為勝。設獲利\n"+
		"養長時存活‧然於死亡終無免脫終須有死‧至臨終時‧先經百年受用安樂‧與唯一年受用\n"+
		"安樂‧二者相等‧唯為念境‧爾時苦樂無差別故。譬如夢中受樂百年與唯須臾領受安樂‧二\n"+
		"睡醒時‧樂與不樂全無差別。如是思惟‧若於利敬能破貪著‧則於毀訾揚惡名等不生憂悒‧\n"+
		"以不求於他顯我殊勝‧雖不顯揚喜無退故。亦如論云‧「能障利養故‧若我不喜此‧我利置"
		,
		/*===========================第 297 頁===========================*/
		"此世‧諸惡則堅住。我寧今死歿‧不邪命長活‧我縱能久住‧終是死苦性。夢受百年樂‧若至於\n"+
		"醒時‧與受須臾樂‧若至於醒時。醒已此二者‧其樂皆不還‧壽長短二者‧臨終唯如是。設多得\n"+
		"利養‧長時受安樂‧亦如被盜劫‧裸體空手行。」\n"+
		"　　第二破除不喜怨敵富樂‧喜其衰損者。本為利樂諸有情故發菩提心‧今於有情自獲\n"+
		"安樂反起瞋恚。又云惟願一切有情皆當成佛‧今見彼等略有下劣利養恭敬‧反生憂惱極\n"+
		"為相違。故應於他幾大富樂‧斷除嫉妬至心歡喜。若不爾者‧則菩提心利樂有情唯假名故。\n"+
		"如云‧「為樂諸有情‧而發菩提心‧有情自獲樂‧何故反瞋彼。云令諸有情‧成佛三界供‧見下\n"+
		"劣利敬‧何故起憂惱。若汝所應養‧當由汝供給‧親友得自活‧不喜豈反瞋。不願眾生樂‧豈願\n"+
		"得菩提‧故若憎他富‧豈有菩提心。若他從施獲‧或利在施家‧此俱非汝有‧施不施何關。」怨\n"+
		"家衰敗而生歡喜‧及暴惡心願其失敗‧僅由此心於怨無損‧唯令自苦。設能損他‧然亦俱害‧\n"+
		"思此過患‧當一切種而正滅除。如云‧「設怨有不喜‧汝有何可樂‧僅由汝希願‧豈為損他因。\n"+
		"縱由汝願成‧他苦汝何喜‧若謂滿我心‧損失豈過此。彼煩惱漁夫‧利鉤之所執‧我於地獄鑊‧\n"+
		"定受獄卒煎。」如是若於障礙我樂及我親樂為作非樂‧並於怨家所有盛事‧一向視為不"
		,
		/*===========================第 298 頁===========================*/
		"可樂相‧由此生憂‧憂增發瞋。若能破其一向不喜‧則止其憂‧由憂息故‧瞋則不生。故應以前\n"+
		"所顯正理‧於此破其一向不喜‧由眾多門滅除瞋恚‧以其過失最重大故。能滅教授亦即上\n"+
		"說佛子正理‧要與煩惱而興駁難‧向內摧壞第一仇敵瞋恚之理。是故若能以觀察慧善為\n"+
		"思擇‧以多正理而正破除‧則能遮止多類瞋恚‧由眾多門發生堪忍‧能得堅固微妙習氣‧以\n"+
		"是由其無垢正理‧於正教義獲定解故。有捨觀慧思擇修者‧即捨此等菩薩一切廣大妙行‧\n"+
		"當知即是自他暇身受取心要無上障礙‧猶如毒蛇應當遠離。\n"+
		"<b><s>　註‧菩薩饒益有情戒略有十一相︰（一）‧謂諸菩薩於諸有情能引義利彼彼事業‧與作助伴‧於\n"+
		"　諸有情隨所生起疾病等苦‧瞻侍病等‧亦作助伴。（二）‧又諸菩薩‧依世出世種種義利‧能為有情\n"+
		"　說諸法要‧先方便說先如理說‧後令獲得彼彼義利。（三）‧又諸菩薩於先有恩諸有情所‧善守知\n"+
		"　恩隨其所應現前酬於墮種種獅子虎狼鬼魅王賊水火等畏諸有情類。皆能救護‧令離如是諸怖\n"+
		"　令離如是諸怖畏處。（五）‧又諸菩薩‧於諸喪失報。（四）‧又諸菩薩‧財寶親屬諸有情類‧善為開\n"+
		"　解令離愁憂。（六）‧又諸菩薩‧於有匱乏資生眾具諸有情類‧施與一切資生眾具。（七）‧又諸菩\n"+
		"　薩‧隨順道理‧正與依止‧如法御眾。（八）‧又諸菩薩‧隨順世間事務言說‧呼召去來‧談論慶慰‧隨時\n"+
		"　往赴‧從他受取飲食等事。以要言之‧遠離一切能引無義違意現行‧於所餘事心皆隨轉。（九）‧又\n"+
		"　諸菩薩若隱若露‧顯示所有真實功德‧令諸有情歡喜進學。（十）‧又諸菩薩於有過者‧內懷親昵\n"+
		"　利益安樂增上意樂‧調伏訶責治罰驅擯‧為欲令其出不善處‧安置善處。(十一)‧又諸菩薩以神通\n"+
		"　力‧方便示現那落迦等諸趣等相‧令諸有情厭離不善‧方便引令入佛聖教‧歡喜信樂生希有心‧勤\n"+
		"　修正行。</s></b>\n"+
		"<b>菩提道次第廣論卷十一終</b>"
		,
		/*===========================第 299 頁===========================*/
		"<b>菩提道次第廣論卷十二</b>\n"+
		"<b><s>　第二引發安受苦忍分三‧<n>一</n>必須安受苦之理‧<n>二</n>引發此之方便‧<n>三</n>處門廣釋。　　今初</s></b>\n"+
		"　　如入行論云‧「樂因唯少許‧苦因極繁多。」我等恆有眾苦隨逐‧故以苦為道不可不\n"+
		"知‧若不爾者‧如集學論說‧或生瞋恚或於修道而生怯弱‧即能障礙修善行故。此復有苦是\n"+
		"由他起。亦有諸苦‧無論於道若修不修由宿業起。又有一類如下所說‧由修善行始得發起‧\n"+
		"若不修善則不發生。如是若由宿業及現前緣增上力故決定起者‧此等暫時無能遮止‧起\n"+
		"已必須安然忍受。若不能忍則反於此原有苦上‧由自分別更生心苦極難堪忍。若能安忍\n"+
		"雖根本苦未能即退‧然不緣此更生內心憂慮等苦。若於此上更持餘苦助道方便‧則苦極\n"+
		"微而能堪忍‧是故引發安受苦忍極為切要。\n"+
		"<b><s>　第二引發方便分二‧<n>一</n>有苦生時破除專一執為不喜‧<n>二</n>顯示其苦理應忍受。　　今初</s></b>\n"+
		"　　若已生苦有可治者‧是則其意無須不喜‧若不可治縱不歡喜亦無利益‧非但無益且\n"+
		"有過患。若太嬌愛‧雖於微苦亦極難忍‧若不嬌愛‧其苦雖大亦能忍故。如云‧「若有可治者‧"
		,
		/*===========================第 300 頁===========================*/
		"有何可不喜‧若已無可治‧不喜有何益。」又云‧「寒熱及風雨‧病縛捶打等‧我不應太嬌‧若\n"+
		"嬌苦反增。」\n"+
		"<b><s>　第二顯示其苦理應忍受分三‧<n>一</n>思惟苦之功德‧<n>二</n>思惟能忍眾苦難行之功德‧<n>三</n>從微漸修無難\n"+
		"　之理。　　今初</s></b>\n"+
		"　　功德有五‧謂若無苦‧則於苦事不希出離‧故有驅意解脫功德。由苦逼迫壞諸高慢‧故\n"+
		"有除遣傲慢功德。若受猛利大苦受時‧則知其苦從不善生‧不愛其果‧須止其因‧故有羞恥\n"+
		"作惡功德。由苦逼惱希求安樂‧若求安樂須修善因‧故有歡喜修善功德。由比我心度餘有\n"+
		"情‧知皆是苦‧於諸漂流生死海者‧能發悲愍。以上諸德及此所例諸餘功德‧自應先知數數\n"+
		"修心‧謂此諸苦是所願處。如云‧「無苦無出離‧故心應堅忍。」又云‧「又苦諸功德‧謂以厭\n"+
		"除慢‧悲愍生死者‧羞惡而喜善。」\n"+
		"<b><s>　第二思惟能忍眾苦難行之德分二‧<n>一</n>思解脫等諸大勝利‧<n>二</n>思能遮止無量大苦所有勝利。</s></b>\n"+
		"<b><s>　　　今初</s></b>\n"+
		"　　我昔流轉生死之時‧為求微劣無義欲故‧雖知有苦尚能輕蔑非一大苦‧作感當來無"
		,
		/*===========================第 301 頁===========================*/
		"量苦因‧忍受非一無義大苦。況我今者‧為求引發自他無量利益安樂‧尚應故知忍受過前\n"+
		"百千俱胝倍數大苦‧而修善行‧況輕於彼‧應數思惟令心堅固‧入行論云‧「為欲曾千返‧受\n"+
		"燒等地獄‧然於自他利‧我悉未能辦。現無爾許苦‧能成諸大利‧為除眾生苦‧於苦唯應喜。」\n"+
		"思惟往昔於自他利俱無所成‧尚能忍受爾許難行‧今為引發極大利義‧於諸微苦何故不\n"+
		"忍。故雖有苦‧然有此利‧我實善得‧如是思惟令心高起。又由惡友之所誑惑‧尚能趣向無義\n"+
		"惡途‧忍諸苦行‧謂跳三尖矛及炙五火等。又為世間微劣事故‧能強忍受務農徇利戰競等\n"+
		"事‧非一大苦‧如是思已當於苦行而發無畏。\n"+
		"　　思能遮止無量大苦所有勝利者‧如有一人是應殺犯‧若截手指能免殺罪發大歡喜‧\n"+
		"如是若由人間小苦‧總能脫離無邊生死‧別能永斷那洛迦等惡趣眾苦‧極為善哉。若能善\n"+
		"思現前久遠二苦差別‧則於難行能生心力全無所畏。如云‧「若截殺人手‧能脫豈非善‧若\n"+
		"以人間苦‧離獄豈非善。」\n"+
		"　　從微漸修無所難者。如云‧「若習不易成‧此事定非有‧故修忍小苦‧大苦亦能忍。」若\n"+
		"被忍甲受苦意樂‧雜諸小苦漸次修習‧則忍苦力漸能增廣。集學論亦云‧「此中若修小苦"
		,
		/*===========================第 302 頁===========================*/
		"為先‧則於大苦及極大苦而能串習。譬如一切有情由串習力‧於諸苦上妄起樂想‧如是若\n"+
		"於一切苦上‧安住樂想而漸串習‧則亦能住安樂之想。」又生此想‧復如猛利請問經云‧\n"+
		"「應當捨離‧如樹棉心。」華嚴亦云‧「童女‧汝為摧伏一切煩惱故‧應當發起難行之心。」\n"+
		"謂須心力最極堅穩‧非心微薄之所能成。故若先發堅強志力‧則諸大苦亦成助伴‧譬如勇\n"+
		"士入陣戰時見自出血‧以此反能助其勇志。若先未聞如是之法‧雖聞云我不能行此自輕\n"+
		"蔑者‧則苦雖微亦能成彼退道之緣‧譬如怯夫‧雖見他血亦自驚倒。如云‧「有若見自血‧反\n"+
		"增其堅勇‧有雖見他血‧亦驚慌悶絕‧此由心堅固‧怯弱之所致。」\n"+
		"　　處門廣釋者。若須安忍所生苦者‧為當忍受由何生苦。此分八處‧依止處者‧所謂衣服\n"+
		"飲食坐具臥具病緣醫藥供身什物‧是能增長梵行之依‧此等諸物若得粗尠‧他不恭敬‧稽\n"+
		"留乃與‧不應憂鬱‧當忍由此所生眾苦。世法處者‧衰毀譏苦‧壞法壞‧盡法盡‧老法老‧病法病‧\n"+
		"死法死‧如是九種是為世法‧依此一切或依一分所生眾苦‧應善思擇而忍受之。威儀處者‧\n"+
		"行住坐臥是四威儀‧第一第三晝夜恆時‧從諸障法淨修其心‧由此生苦悉當忍受‧終不非\n"+
		"時脅著床座草敷葉敷。攝法處者‧供事三寶‧供事尊長諮受諸法‧既諮受已為他廣說‧大音"
		,
		/*===========================第 303 頁===========================*/
		"讚誦‧獨處空閒無倒思惟‧修習瑜伽作意所攝若止若觀‧為七攝法‧於此劬勞所生眾苦悉\n"+
		"當忍受。乞活處者‧剃鬚髮等誓受毀形‧受持裁染壞色之衣‧從其一切世間遊涉兢攝住故\n"+
		"別行餘法。捨務農等從他所得而存濟故‧依他存活‧不應受用集所獲故‧盡壽從他求衣服\n"+
		"等‧斷穢行故‧盡壽遮止人間諸欲。捨離歌舞笑戲等故‧及離與諸親友同齡歡娛等故‧盡壽\n"+
		"遮止人間嬉戲‧為七乞活‧由依此等所生眾苦應當忍受。勤劬處者‧勤修善品‧劬勞因緣所\n"+
		"生眾苦悉當忍受。利有情處者‧謂十一事‧從此生苦皆應忍受。現所作處者‧謂出家者‧便有\n"+
		"營為衣缽等業‧諸在家者‧則有無罪營農經商仕王等業‧從此生苦悉當忍受。如是八處所\n"+
		"生眾苦‧隨何苦起‧皆應別別精進不廢正趣菩提‧已正趣入不令成其退轉障礙‧令意全無\n"+
		"不喜而轉。\n"+
		"　　第三引發思勝解忍中勝解之境‧略有八種。一淨信境者謂三寶功德‧二現證境者謂\n"+
		"無我真實‧三希樂境者謂諸佛菩薩廣大神力‧此復有三‧謂神通力‧六波羅蜜多力及俱生\n"+
		"力。四五取捨境者‧謂諸妙行諸惡行因及此所招愛非愛果‧此分為二。六七所修境者‧謂大\n"+
		"菩提是應得義及菩薩學一切諸道‧是能得彼所有方便‧此亦分二。八聞思隨行境者‧謂所"
		,
		/*===========================第 304 頁===========================*/
		"知境‧卓壟巴師說為無常等‧然力種性品說十二分教等正法‧為第八種或應如是。勝解之\n"+
		"理者‧謂如實知此諸境已‧無所違逆數數思惟。安受眾苦及思擇法俱分八類者‧如菩薩地\n"+
		"所說而錄‧特於思法此說極廣。\n"+
		"　　修此等時如何行者。謂隨修一能堪忍時‧皆令具足六種殊勝‧具足六種波羅蜜多‧唯\n"+
		"除令他安立於忍‧是忍施外餘如前說。\n"+
		"　　第五此等攝義者。謂應隨念發菩提心‧為行依止而修行者‧是欲安立一切有情於漏\n"+
		"盡忍所有根本‧故須令此漸次增廣‧大地諸忍作所願境而勤修習。諸初發業所應學忍善\n"+
		"了知已‧如理修學。如於所說有所違越‧應當精勤而令還出‧若修此時捨而不修‧恆為非一\n"+
		"大罪所染‧於餘生中亦極難修‧最為殊勝諸菩薩行。若能視為勝道扼要‧諸能行者現前修\n"+
		"行‧未能行者亦能於上淨修意樂‧則如妙手問經所說‧以少功力及微小苦‧而能圓滿忍辱\n"+
		"波羅蜜多。\n"+
		"<b><s>　學習精進波羅蜜多分五‧<n>一</n>精進自性‧<n>二</n>趣入修習精進方便‧<n>三</n>精進差別‧<n>四</n>正修行時應如何修‧<n>五</n>\n"+
		"　此等攝義。　　今初</s></b>"
		,
		/*===========================第 305 頁===========================*/
		"　　緣善所緣勇悍為相‧入行論云‧「進謂勇於善。」菩薩地說為攝善法及利有情‧其心\n"+
		"勇悍無有顛倒‧及此所起三門動業。\n"+
		"　　第二趣入修習精進方便者。謂應多思精進勝利不進過患‧此若串習精進起故。其勝\n"+
		"利者‧勸發增上意樂會云‧「能除諸苦及冥暗‧是能永斷惡趣本‧諸佛所讚聖精進‧此是恆\n"+
		"常應依止。此世所有諸工巧‧及出世間諸巧業‧若發精進非難得‧智者誰厭精進力。若有趣\n"+
		"佛菩提者‧彼見昏睡諸過失‧常發精進而安住‧我為策彼而說此。」莊嚴經論亦云‧「資糧\n"+
		"善中進第一‧謂依此故彼後得‧精進現得勝樂住‧及世出世諸成就。精進能得三有財‧精進\n"+
		"能得善清淨‧精進度越薩迦耶‧精進得佛妙菩提。」又云‧「具進受用無能勝‧具進煩惱不\n"+
		"能勝‧具進厭患不能勝‧具進少得不能勝。」菩薩地亦云‧「唯有精進是能修證菩薩善法\n"+
		"最勝之因‧餘則不爾‧故諸如來稱讚精進‧能證無上正等菩提。」攝波羅蜜多論亦云‧「若\n"+
		"具無厭大精進‧不得不證皆非有。」又云‧「非人皆喜饒利彼‧能得一切三摩地‧晝夜諸時\n"+
		"不空度‧功德資糧無劣少‧獲得諸義過人法‧如青蓮華極增長。」過患者‧海慧請問經云‧\n"+
		"「有懈怠者‧菩提遙遠最極遙遠‧諸懈怠者無有布施乃至無慧‧諸懈怠者無利他行。」念"
		,
		/*===========================第 306 頁===========================*/
		"住經亦云‧「誰有諸煩惱‧獨本謂懈怠‧若有一懈怠‧此無一切法。」若無精進隨懈怠轉‧一\n"+
		"切白法悉當虧損‧退失一切現時畢竟士夫義利。\n"+
		"<b><s>　精進差別分二‧<n>一</n>正明差別‧<n>二</n>發生精進之方便。　初中有三‧<n>一</n>擐甲精進‧<n>二</n>攝善法精進‧<n>三</n>饒益有\n"+
		"　情精進。　　今初</s></b>\n"+
		"　　菩薩地說‧「謂諸菩薩於發精進加行之前‧其心勇悍‧先應如是擐意樂甲。若為除一\n"+
		"有情苦故‧以千大劫等一晝夜‧集為百千俱胝倍數三無數劫‧唯住有情那洛迦中乃能成\n"+
		"佛‧我亦勇悍為正等覺非不進趣‧發精進已終不懈廢‧況時較短其苦極微‧如是名為擐甲\n"+
		"精進。若有菩薩於此精進‧少發勝解少生淨信亦名堅固‧尚能長養為求無上大菩提故‧發\n"+
		"起無量精進之因‧何況成就如是精進。於求菩提饒益有情‧無有少分難行事業‧可生怯劣\n"+
		"難作之心。」若能修習如是意樂‧定能醒覺大乘種性所有堪能‧故應修習。攝波羅蜜多論\n"+
		"云‧「設等生死前後際‧成為極長大晝夜‧集此為年成長劫‧以盡大海水滴量。發一最勝菩\n"+
		"提心‧須以此相漸集餘‧一一資糧悲無厭‧無諸懈廢修菩提。自心莫思流轉苦‧而擐無量穩\n"+
		"固甲‧住戒悲性諸勇識‧是為最初所應取。」此亦是說擐甲精進。又如無盡慧經所說‧「設"
		,
		/*===========================第 307 頁===========================*/
		"從無始生死以來‧現在以前為一晝夜‧三十晝夜而為一月‧於十二月計為一年‧經十萬年\n"+
		"始發一次菩提之心見一次佛‧如是等一殑伽沙數‧始能知一有情心行。以如是理‧須知一\n"+
		"切有情心行‧亦無怯弱而擐誓甲‧為無盡甲。」是為無上擐甲精進。總之若能引發少分如\n"+
		"此意樂‧速能圓滿無邊資糧‧淨無量障而成最勝不退轉因‧如於長劫能生喜樂‧如是亦能\n"+
		"速當成佛。若於無邊妙行及於極長時等‧全無勇悍‧唯樂短時速當成佛‧反於成佛極為遙\n"+
		"遠‧以能障礙諸菩薩眾發最殊勝大志力故。為何義故‧如是擐甲發勤精進‧其中有二‧攝善\n"+
		"法精進者‧謂為正引發六種波羅蜜多故‧修彼加行。饒益有情精進者‧謂於十一事‧如其所\n"+
		"應而發精進。\n"+
		"　　第二發生精進之方便者。如前所說‧二種資糧一切白法‧由依此故生住增長‧故修精\n"+
		"進極為重要。此亦唯見寂天菩薩論說‧易解便修最圓滿故‧當說此宗。\n"+
		"<b><s>　此中分四‧<n>一</n>捨離障礙精進違緣‧<n>二</n>修積順緣護助資糧‧<n>三</n>依上二緣發勤精進‧<n>四</n>由此身心堪能\n"+
		"　之理。　初中分二‧<n>一</n>明所治品‧<n>二</n>修斷彼方便。　　今初</s></b>\n"+
		"　　不入道者略有二類‧一雖見能修而不趣入‧二怯弱不入‧謂我豈能如是修習。雖尚有"
		,
		/*===========================第 308 頁===========================*/
		"餘能不能修未嘗思擇而不趣者‧然此是說求解脫者‧彼非此說。初中有二‧一推延懈怠‧謂\n"+
		"念後時有暇能修。二雖非如是‧然於庸常諸下劣事‧貪著覆蔽。如入行論云‧「說其所治品‧\n"+
		"懈怠‧耽惡事‧自輕而退屈。」能生懈怠之因者‧謂諸懶惰味著微樂‧愛睡眠樂‧不厭生死。如\n"+
		"云‧「懶惰受樂味‧愛習近睡眠‧不厭生死苦‧當生諸懈怠。」有釋前二句文‧謂明如何生起\n"+
		"之相。\n"+
		"　　修斷彼方便分三‧初破除推延懈怠者‧略有三種‧謂已得之身速當壞滅‧命終之後墮\n"+
		"諸惡趣‧如此人身極難再得。由修此三能除執為有暇懈怠‧引發恆覺無暇之心。此三於前\n"+
		"下士之時‧已廣宣說。二破除貪著惡劣事業者‧應觀正法‧是能出生現後無邊喜樂之因‧無\n"+
		"義狂談掉等散亂‧是能失壞現前大利‧引發當來無義眾苦無依之處‧修習對治而正滅除。\n"+
		"如云‧「棄妙善正法‧無邊歡喜因‧汝何故反喜‧苦因散掉等。」三破除退屈或自輕者‧如是\n"+
		"破除推延耽惡事已‧雖於正法能起勇悍‧然非以此便為喜足‧應於大乘精勤修學‧故應除\n"+
		"遣於彼怯弱‧謂念如我何能修證。此中分三‧於所應得破除退屈‧於能得方便破除退屈‧於\n"+
		"所安住修道處所破除怯弱。"
		,
		/*===========================第 309 頁===========================*/
		"　　所得佛者。謂是永盡一切過失‧畢竟圓滿一切功德‧我修一德斷一過失且極艱難‧故\n"+
		"我豈能獲如是果。若實發起如此退怯‧已捨發心過患極重‧設未實起‧亦應從初滅不令起。\n"+
		"破除道理者‧應作是念策舉其心‧佛薄伽梵定量士夫‧是諦語者是實語者‧不虛妄語不顛\n"+
		"倒語‧彼尚記說蚊虻等類能證菩提‧何況我今生在人中身報賢善‧有智慧力觀擇取捨。故\n"+
		"我若能精進不廢‧何故不能證得菩提。如云‧「不應自退怯‧謂不證菩提‧如來諦語者‧作此\n"+
		"諦實說。所有蚊虻蜂‧如是諸蟲蛆‧彼發精進力‧證無上菩提。況我生人中‧能知利非利‧不捨\n"+
		"菩提行‧何不證菩提。」又於往昔過去諸佛及現在佛並未來佛‧此等亦非先已成佛次修\n"+
		"諸道‧初唯如我‧由漸昇進而得成佛及當成佛‧由如是思破除怯弱。寶雲經云‧「菩薩應念\n"+
		"所有如來應正等覺‧謂諸已現等覺‧今現等覺‧當現等覺‧此等皆以如是方便‧如是修道‧如\n"+
		"是精進‧已現等覺‧今現等覺‧當現等覺。」乃至說云‧「此諸如來亦非皆是成如來已而現\n"+
		"等覺‧故我亦當於其無上正等菩提而現等覺‧我亦應發共同一切有情精進‧普緣一切有\n"+
		"情精進‧如是如是策勵尋求。」無邊功德讚云‧「雖諸已得善逝位‧亦曾墮諸極下處‧佛墮\n"+
		"險時不自輕‧不應自輕壯亦怯。」生此怯弱是由善知諸佛功德無有邊際‧果隨因行‧故修"
		,
		/*===========================第 310 頁===========================*/
		"道時‧須無量門引發功德‧及無量門滅除過失。次觀自身而生怯弱‧若謂諸佛無量功德於\n"+
		"修行時‧僅由專懇修學一分微少功德即能成就‧於道生此顛倒了解‧則於現在全無所怯。\n"+
		"然此非是賢善之相‧是於修道之理未獲定解‧或雖少有散渙了解‧然皆未曾親切修持‧總\n"+
		"覺容易障覆所致。若至實行雖略顯示道之首尾粗概次第滿分之體‧生恐懼云‧若須如是\n"+
		"誰復能修而捨棄故。霞惹瓦亦云‧「未曾實行諸菩薩行‧如看射箭總覺甚易全無怯弱‧現\n"+
		"在之法無完善者‧故不致到怯弱自輕之地‧若善圓滿恐必多起怯懼自輕。」此言極實。\n"+
		"　　於能得方便破除怯退者。謂念成佛須捨手足等‧我不能爾‧如此之苦應須堪忍。即不\n"+
		"修行自任運住‧流轉生死‧亦曾多受斫裂刺燒此等大苦‧不可說數‧然亦未能成辦自利。為\n"+
		"求菩提難行之苦‧較其前苦尚無一分‧然能成辦自他大利。如云‧「若謂捨手等‧是我所怖\n"+
		"畏‧是未察輕重‧愚故自恐怖。無量俱胝劫‧曾多受割截‧刺燒及解裂‧然未證菩提。我今修菩\n"+
		"提‧此苦有分齊‧為除腹內病‧如受割身苦。諸醫以小苦‧能治令病癒‧故為除眾苦‧小苦應堪\n"+
		"忍。」又捨身者‧初怖畏時非可即捨‧先於布施漸次學習‧至於自身全無貪著‧大悲心力開\n"+
		"發之時‧若有大利方可施捨‧故正捨時全無難行。如云‧「如此治療法‧勝醫且不用‧以柔和"
		,
		/*===========================第 311 頁===========================*/
		"儀軌‧治無量大病。導師先令行‧惠施蔬菜等‧習此故而後‧自肉漸能施。若時於自身‧覺如諸\n"+
		"菜葉‧爾時捨肉等‧於此有何難。」是故有說波羅蜜乘‧須捨身命故生逼惱是難作道。今此\n"+
		"教典善為破除‧謂於發生難行想時不須即捨‧如與菜等極易捨時‧方可捨故。\n"+
		"　　於所安住修道處所破除怯弱者。謂念成佛須於生死受無量生‧爾時生死眾苦逼惱‧\n"+
		"故我不能修如是行。應如是思‧菩薩由其已斷諸惡以因遮故‧必不能生苦受之果‧堅固通\n"+
		"達‧生死如幻悉無自性‧故心無苦‧若其身心安樂增盛‧雖處生死無厭患義。如云‧「斷惡故\n"+
		"無苦‧善巧故無憂‧謂由邪分別‧罪惡害身心。福令身安樂‧智故心亦安‧利他處生死‧悲者何\n"+
		"所厭。」又云‧「故遍除疲厭‧騎菩提心馬‧從樂而趣樂‧有智誰退屈。」如是雖延無量時劫\n"+
		"不應怯弱‧唯時長久非厭因故。謂苦極重‧雖時短促亦生厭離‧無苦安樂‧時雖久遠無所厭\n"+
		"故。寶鬘論云‧「重苦雖時短‧難忍況久遠‧無苦而安樂‧無邊時何害。此中身無苦‧意苦從何\n"+
		"有‧唯悲世間苦‧由此而久住。故謂佛久遠‧智者無退屈‧為盡過集德‧恆勤修資糧。」又念成\n"+
		"佛必須圓滿無邊資糧‧此極難作故我不能‧亦莫怯退。若為利益無邊有情‧求證諸佛無邊\n"+
		"功德而為發起‧住無量劫‧欣樂修集無邊資糧而受律儀‧則於一切‧若睡未睡心散不散‧乃"
		,
		/*===========================第 312 頁===========================*/
		"至有此律儀之時‧福恆增長量等虛空‧故無邊資糧非難圓滿。即前論云‧「如一切諸方‧地\n"+
		"水火風空‧無邊如是說‧有情亦無邊。菩薩普悲愍‧此無邊有情‧欲度諸苦厄‧安立於佛位。如\n"+
		"是堅住者‧從正受戒已‧隨其眠不眠‧及放逸而住。如有情無邊‧恆集無邊福‧無邊福非難‧證\n"+
		"無邊德佛。若住無量時‧為無量有情‧求無量菩提‧而修無量善。菩提雖無量‧以此四無量‧資\n"+
		"糧非久遠‧如何不得證。」是故若由最極猛利大慈大悲‧及菩提心衝動其意‧為利有情‧願\n"+
		"於短時速成佛者‧極為希有。然若未近此之方隅‧僅由見於極長時劫‧須正修學無邊諸行\n"+
		"及多難行‧便作是念誰能如是‧故妄說云求速近道‧此於願心間接損害‧正損行心‧令大乘\n"+
		"種漸趣劣弱‧故於成佛反極遙遠。以與龍猛無著決擇如來密意‧最極增長菩提心力所有\n"+
		"道理極相違故。\n"+
		"　　如是若僅怯弱而住‧全無所益‧反漸怯劣‧故應善知諸能修證菩提方便‧策舉其心‧則\n"+
		"辦諸利如在掌內。如本生論云‧「怯弱無益悅匱乏‧是故不應徒憂惱‧若依能辦利聰叡‧雖\n"+
		"極難事亦易脫。故莫恐怖莫憂惱‧如其方便辦所作‧智者威堅而策舉‧辦一切利如在掌。」\n"+
		"聖者無著數數說為‧「當具二事‧一雖善了知於廣大法學習道理‧應無怯弱‧二於下劣功"
		,
		/*===========================第 313 頁===========================*/
		"德不應喜足。」然現在人‧若生少分相似功德‧或生少分真實功德‧便覺已進極大道位‧計\n"+
		"唯修此便為滿足。若為智者知道扼要‧依於教理善為開曉‧謂此雖是一分功德‧然唯以此\n"+
		"全無所至。果能了解意必怯退‧是故能於一分功德不執為足‧更求上勝‧及知須學無邊學\n"+
		"處而無怯弱‧極為稀少。\n"+
		"<b><s>　第二積集順緣護助資糧分四‧<n>一</n>發勝解力‧<n>二</n>發堅固力‧<n>三</n>發歡喜力‧<n>四</n>暫止息力。　　今初</s></b>\n"+
		"　　諸論中說‧欲為進依‧此中勝解即是欲樂。須發此者‧如云‧「我從昔至今‧於法離勝解‧\n"+
		"感如此困乏‧故誰棄法解‧佛說一切善‧根本為勝解。」勝解如何而起者‧如云‧「又此之根\n"+
		"本‧恆修異熟果。」此說修習從黑白業‧生愛非愛諸果道理。諸論又說信為欲依‧以從二種\n"+
		"深忍之信‧能引取捨二種欲故。此是思惟諸總業果‧及特思惟諸菩薩行所有勝利‧及越諸\n"+
		"行所有過患諸因果等。如是勝解大乘入大乘門‧即是誓除自他一切過失‧誓引自他一一\n"+
		"功德。然一一過及其習氣究竟清淨‧一一功德畢竟圓滿‧必須經歷多劫修習‧不見我有淨\n"+
		"除過失引發功德一分精進‧我實徒耗有暇之身‧如是思惟自行策發。如云‧「我應除自他‧\n"+
		"無量諸過失‧然盡一一過‧須經諸劫海。未見我有此‧斷過精進分‧墮無量苦處‧我心何不裂。"
		,
		/*===========================第 314 頁===========================*/
		"我應勤引發‧自他眾功德‧然修一一德‧須歷經劫海。我終未能起‧修此德一分‧我將難得身‧\n"+
		"空棄實奇哉。」\n"+
		"　　堅固力者。謂於何事發起精進‧即於彼事究竟不退。此初不應率爾而行‧當善觀察‧見\n"+
		"其能辦次乃進趣‧若不能者則莫趣入‧與其既行中間廢捨‧莫若最初不趣為勝。其因相者‧\n"+
		"以於中間棄捨誓願‧若成串習‧由此等流‧則餘生中亦棄所受學處等故。於現法中增長眾\n"+
		"惡‧於餘生中增長苦果。又因先思作此事故‧未修餘善‧退捨先作其果下劣‧即此一事亦未\n"+
		"究竟‧故其所作終無圓滿。總之誓作何事‧其事未成亦障餘事。由其等流‧令其誓願所受律\n"+
		"儀‧亦不堅固。如云‧「先應觀加行‧應作不應作‧未作為第一‧作後不應退。餘生亦成習‧當增\n"+
		"諸惡苦‧障餘及果劣‧此亦未能辦。」是故願令誓願究竟‧應修三慢‧如云‧「於業惑功能‧三\n"+
		"事應我慢。」其業慢者‧謂自修道全不賴他為作助伴‧唯應自修。如云‧「謂我應自為‧此即\n"+
		"事業慢。」親友書亦云‧「解脫唯依於自修‧非他於此能助伴。」此是念其我當自修‧不希\n"+
		"望他‧與慢相似‧假名為慢。功能慢者‧謂諸眾生隨煩惱轉‧尚不能辦自己利義‧況能利他‧念\n"+
		"我能引自他利義而勤修行。如云‧「此世隨惑轉‧無能引自利‧眾生非如我‧故我應修此。」"
		,
		/*===========================第 315 頁===========================*/
		"又此諸人於下劣業且勤不捨‧我今此業能引妙果何故不為‧作是思已而正修習。如云‧\n"+
		"「餘尚勤劣業‧我如何閒住。」然修此二‧非輕蔑他而自憍慢‧謂應觀為可悲愍相‧無慢雜\n"+
		"糅。如云‧「非以慢修此‧自無慢為勝。」由念我能餘則不能‧與慢相似假名為慢。煩惱慢者‧\n"+
		"謂一切種輕毀煩惱‧我當勝此‧終不使此有勝於我‧為欲摧伏諸所治品‧令心勇悍令心堅\n"+
		"穩。如云‧「我當勝一切‧不使誰勝我‧諸佛獅子兒‧應住此我慢。」若不如是而退弱者‧障品\n"+
		"雖小亦能為害。如云‧「若遇死毒蛇‧烏亦如鵬鳥‧若我太軟弱‧小罪亦為損‧怯劣棄功用‧豈\n"+
		"能脫匱乏。」霞惹瓦云‧「棄法之樂‧較往昔樂全無過上‧於現法中若棄正法‧應思當來所\n"+
		"受諸苦無有邊際。若自不能勤加功用‧煩惱亦必不覺悲愍‧對治不說汝不能修‧我自圓滿‧\n"+
		"諸佛菩薩亦不能救。」若能生起如前我慢‧障品雖大不能為障‧是故應須發起慢心。如云‧\n"+
		"「若起慢功用‧障大亦難勝‧故心應堅固‧摧伏諸罪惡。」若不爾者‧修行之人為罪所勝‧猶\n"+
		"願戰勝三界煩惱‧實為智者所恥之處。如云‧「我為罪所勝‧勝三界可笑。」此由輕毀諸煩\n"+
		"惱故‧欲為摧伏‧故假名為煩惱我慢。諸作釋者雖有異說‧然覺此說與論相符。如是應斷希\n"+
		"望於他‧當擐誓甲願我自作‧此復覺其非餘所能‧唯我始能自負其任。如是見已‧正修之時"
		,
		/*===========================第 316 頁===========================*/
		"令心堅固‧唯應向外摧伏煩惱‧不令煩惱向內摧伏‧更思中途棄捨誓願所有過失。善思擇\n"+
		"已‧隨所作事‧一切誓願悉願究竟‧乃至未獲堅穩以來淨修其心。\n"+
		"　　發歡喜力者。如是由其猛利欲樂勝解之力‧精進未生能令生起。又令已生不退之因‧\n"+
		"謂由成就堅固之力或我慢力。最初入時歡喜而入‧已趣入時‧於其事業不欲斷絕無飽意\n"+
		"樂者‧即歡喜力‧故應引發。應發何等無飽之理‧如云‧「此於所作業‧如欲遊戲樂‧應著其事\n"+
		"業‧喜此業無飽。」謂應勵力發起喜心‧如同小兒遊戲之業‧無飽足心。又如樂果無所飽滿‧\n"+
		"其因之業亦應無飽‧如諸俗人於安樂果能不能得‧尚有猶豫且策勵轉‧況行此業決定能\n"+
		"生安樂之果。如云‧「成樂否無定‧尚為樂作業‧若業定感樂‧不修云何樂。」又以此理亦不\n"+
		"應飽足‧如云‧「諸欲如刀蜜‧尚且無飽足‧況福感樂果‧寂靜何故飽。」如鋒刀蜜雖亦略有\n"+
		"甜味可嘗‧但若舐之必能割舌‧可愛欲塵雖與現前少分安樂‧然生現後極大痛苦‧其受用\n"+
		"者尚無飽足。況諸資糧能與無罪現前久遠無邊安樂‧何應飽足。如是思已‧應當發生無飽\n"+
		"意樂‧故為圓滿所修善業‧乃至未生如日中時‧日熾諸象趣向可意蓮池之心‧應善修習。如\n"+
		"云‧「為圓滿業故‧如日中熾象‧遇池而入池‧亦應趣其業。」"
		,
		/*===========================第 317 頁===========================*/
		"　　暫止息力者。發勤精進身心疲勞須暫止息‧若不爾者則極厭離‧能障後時發精進故。\n"+
		"休息無間仍發精進‧前事究竟不應以此便為喜足‧應於上勝更發精進。如云‧「若時力衰\n"+
		"乏‧為後故暫捨‧為趣後後故‧善竟即應捨。」此後所說極為重要‧若以前德而為喜足‧則能\n"+
		"障礙修證眾多勝功德故。此又顯示發精進規‧謂應俱斷‧太為熾燃‧功用過猛及太散緩‧當\n"+
		"恆相續如瀑流水。吉祥敬母云‧「修殊勝德時‧尊曾無急緩‧故尊諸勝德‧前後無差別。」博\n"+
		"朵瓦亦云‧「如席摩主巴之逐盜者無益‧應如絳巴之逐盜者‧初先預備‧次乃至未及盜處\n"+
		"而追‧如是緩追‧又須耐久。譬若全不停息‧速猛而進‧走至極乏‧坐不能起‧等同未進。」\n"+
		"<b>菩提道次第廣論卷十二終</b>"
		,
		/*===========================第 318 頁===========================*/
		"<b>菩提道次第廣論卷十三</b>\n"+
		"　　如是了知精進三種違緣‧修習對治。其未生修持‧能令生起之順緣‧謂勝解力。若已生\n"+
		"者能令不退之因‧謂堅固力。修彼業時不欲斷絕者‧謂歡喜力。更以息捨力勤發精進。若於\n"+
		"此理已得善巧‧則於精進當發欣樂之力‧茲當宣釋。\n"+
		"　　第三發勤精進斷所斷時‧如云‧「如與慣戰敵‧鬥劍於陣前‧當避煩惱劍‧返擊煩惱\n"+
		"敵。」如慣戰智者與諸怨敵鬥劍等時‧不應專謀害他‧當善二事‧謂須善避他來擊刺‧及返\n"+
		"害他。行者亦爾‧與煩惱鬥時‧一須善防避煩惱來傷自心‧二須依止對治更進害他。若不爾\n"+
		"者‧雖以對治滅除一分煩惱作用‧然餘煩惱‧則又劫奪一分善法‧或令心中起一大罪‧損利\n"+
		"平均‧則諸善行極難生故。喻如欲修法者‧覺以先知為要‧唯於了解執為堅實極力尋求‧此\n"+
		"以多聞雖能除遣無知之愚‧若不防慎諸餘煩惱‧即於爾時染多惡行‧致令身心極不調順。\n"+
		"又如念云‧調伏身心要於多聞‧若專重其修不防愚敵‧不聞不學正法‧即自所受律儀進止\n"+
		"之處‧亦極愚蒙‧則亦恆為眾罪侵害。又如臨陣手劍失落‧恐被他殺‧無間拾取。如是與煩惱"
		,
		/*===========================第 319 頁===========================*/
		"鬥時‧若失明記取捨進止所緣行相憶念之劍‧恐墮惡趣‧亦須無間依止正念。如云‧「臨陣\n"+
		"劍失落‧畏怖速拾取‧如是落念劍‧畏地獄速取。」龍猛菩薩亦說此念極為重要‧如云‧「大\n"+
		"王佛善說‧念身為共道‧故應勤守念‧失念壞諸法。」又所念境先以慧別‧次乃念取‧以念無\n"+
		"擇境力故。慧須分別何法者‧謂總諸經中所說一切應進止之處‧尤以自所受律儀中應取\n"+
		"應捨。若能於彼住念正知‧其所修法乃能圓滿‧若唯於住心所緣修念正知‧全無所益。又如\n"+
		"陣中‧先必勵力令劍不失‧設有所失無間急取‧是因實畏所殺‧非僅空言故。諸修道者‧先恐\n"+
		"失落明記取捨所有正念‧設有所失無間能修者‧亦因心中實畏忘失念時‧為罪染著墮惡\n"+
		"趣果‧非虛言故。能生此心‧尤以修習業果為要‧吾等若未知此為甚深教授‧則為斷絕道中\n"+
		"精髓‧聰叡所愛功德之本。若爾何須於微小罪見大怖畏‧無間滅除不令相續耶。答譬如毒\n"+
		"箭略傷於身‧以此不久毒遍全身‧故當速割。如是惡行略傷心時‧若捨不顧速遍全心‧實非\n"+
		"微小速能廣大‧故於最初須滅令不生‧設已生起無間應斷。如云‧「如毒依於血‧速能遍全\n"+
		"身‧如是罪得便‧亦能遍全心。」若爾欲勝煩惱陣者‧云何依止念正知耶。如云‧「如執滿缽\n"+
		"油‧執劍住其後‧溢則畏其殺‧禁者如是勵。」謂應如是策勵廣如迦旃延那因緣‧應當了知。"
		,
		/*===========================第 320 頁===========================*/
		"如是策勵之時‧總諸惡行‧特見睡等懈怠之因現在前者‧應不忍受迎面遏止。如云‧「如蛇\n"+
		"入懷中‧故應急起立‧如是睡懈生‧皆應速遏止。」非但斷除‧應於犯罪心生不喜‧謂我往昔\n"+
		"如是轉故‧乃至現在漂流生死。尤以正受菩薩律儀‧而反安住學處障品極可訶責。及願今\n"+
		"後於如是罪定不令生‧防護當來‧於彼二心應多修習。如云‧「一一罪生時‧應當自訶責‧必\n"+
		"不令更生‧恆思如是行。」應勵修學能相續生有力正念最深之因‧謂與善師善友共住及\n"+
		"應依止多聞等因。如云‧「於此等時中‧謂當串習念‧此因能遇師‧或行應理事。」總須多聞\n"+
		"善辨菩薩學處取捨‧次於所知法義‧一切威儀‧恆依正念發勤精進‧故於所精進處要無錯\n"+
		"誤。\n"+
		"　　第四身心由此堪能之理。謂自在之力‧如不放逸品說‧必須善學菩薩學處‧及受已不\n"+
		"學過患極重‧當視煩惱猶如仇敵‧於諸難行莫覺為擔‧應發心力視為莊嚴。於未修業前先\n"+
		"修此等‧破除身心於諸善事無堪能性一切怯弱‧學菩薩行令成輕利。如云‧「定於修業前‧\n"+
		"令一切有力‧憶不放逸論‧令自成輕利。」如是勵力能發何等精進耶。謂如樹棉‧去來飄動\n"+
		"隨風而轉‧自內身心於善勇悍‧隨勇悍轉‧此後精進能善成辦。由生精進乃能成辦一切資"
		,
		/*===========================第 321 頁===========================*/
		"糧。如云‧「如樹棉去來‧隨風飄動轉‧如是勇悍轉‧由是事皆成。」又諸難行唯應策勵不應\n"+
		"棄捨‧如吉祥敬母云‧「不修難行業‧不獲難得位‧故佛不自顧‧令精進增長。」\n"+
		"　　第四正修此時應如何行。隨發何精進‧皆當具足六種殊勝及六波羅蜜多。精進施者‧\n"+
		"謂自住精進而安立他‧餘如前說。\n"+
		"　　第五此等攝義。應當隨念‧發菩提心為諸行依而勤修習‧則於精進為欲安立諸有情\n"+
		"故‧策發修學漸令增長。次於大地所發精進修為願境‧於初發業所行精進隨力勤學‧尤應\n"+
		"斷除精進不共所治諸怯弱等。又於所得菩提及為一切有情與樂拔苦‧經極長時‧集無邊\n"+
		"資糧‧行無量難行‧先當勇悍擐精進誓甲。妙手問經說‧「若略發此廣大意樂‧即已積集廣\n"+
		"大資糧。」故當勤學。若不學者‧不能增長種性堪能‧恆為眾多惡行染著‧於餘生中亦極難\n"+
		"學諸菩薩行。如是知已‧雖尚未能如實修學‧然心亦應趣向彼品‧隨力隨能發勤精進‧如妙\n"+
		"手問經說‧則於餘生少以功力無諸苦難‧速能圓滿精進波羅蜜多。\n"+
		"<b><s>　學習靜慮波羅蜜多分五‧<n>一</n>靜慮自性‧<n>二</n>修彼方便‧<n>三</n>靜慮差別‧<n>四</n>正修彼時應如何行‧<n>五</n>此等攝義。\n"+
		"　　　今初</s></b>"
		,
		/*===========================第 322 頁===========================*/
		"　　住所緣境心不散亂‧善心一境性。如菩薩地云‧「謂諸菩薩於菩薩藏聞思為先‧所有\n"+
		"妙善世出世間心一境性‧心正安住或奢摩他品‧或毘缽舍那品‧或雙運道俱通二品‧當知\n"+
		"即是菩薩靜慮自性。」入行論云‧「既發精進已‧意當住等持。」\n"+
		"　　第二修彼方便。謂當思惟‧修習靜慮所有勝利及不修過患‧奢摩他時茲當廣說。\n"+
		"　　第三靜慮差別。如前所引就自性分二‧謂世出世。就品有三‧就作業分‧謂身心現法樂\n"+
		"住靜慮‧引發功德靜慮‧饒益有情靜慮。初謂住定即能引生身心輕安所有靜慮。二謂諸靜\n"+
		"慮能引神通解脫遍處及勝處等‧共諸聲聞所有功德。三謂有靜慮能引十一種饒益有情\n"+
		"事。\n"+
		"　　第四正修彼時應如何行。隨修何善三摩地‧皆當具足六種殊勝‧六波羅蜜多。自住靜\n"+
		"慮亦安立他‧是靜慮施‧餘如前說。\n"+
		"　　第五此等攝義。隨念發心為諸行依而正修習‧則於無漏靜慮‧為欲安立一切有情‧策\n"+
		"勵修學。此堅固增長已‧以地上諸靜慮作所願境。雖未能生圓滿靜慮‧亦應時時精進不捨‧\n"+
		"隨力學習心一境性諸三摩地。若不爾者‧恆違學處罪所染著‧於餘生中亦極難學菩薩等"
		,
		/*===========================第 323 頁===========================*/
		"持所有學處。若能學者‧即於現法亦少散亂心‧所修善行勢力強盛‧當來亦如妙手問經說‧\n"+
		"身心喜樂‧靜慮波羅蜜多極易圓滿。於奢摩他時當廣解釋‧故此不說。\n"+
		"<b><s>　學習般若波羅蜜多分五‧<n>一</n>慧之自性‧<n>二</n>生慧方便‧<n>三</n>慧之差別‧<n>四</n>正修慧時應如何行‧<n>五</n>此等攝義。\n"+
		"　　　今初</s></b>\n"+
		"　　慧謂於所觀事能揀擇法‧此處是說通達五明處等慧。如菩薩地云‧「謂能悟入一切\n"+
		"所知‧及已悟入一切所知揀擇諸法‧普緣一切五明處轉‧一內明‧二因明‧三醫方明‧四聲明‧\n"+
		"五工巧明‧當知即是菩薩慧之自性。」能悟入慧者是未得地前慧‧已悟入者是得地慧。\n"+
		"　　第二生慧方便。謂當思惟生慧功德及未生之過失。其有無通達如實無我性慧之功\n"+
		"德過失‧毘缽舍那時茲當廣說‧今當略說所餘德失。先說功德‧此中慧是現後一切功德根\n"+
		"本者‧如龍猛菩薩云‧「慧為見不見‧一切功德本‧為辦此二故‧應當攝受慧。明是求法義‧及\n"+
		"大解脫本‧故應先敬持‧大般若佛母。」慧如施等五度之眼者‧如攝頌云‧「若時為慧所攝\n"+
		"持‧爾時獲眼得此名‧如畫事畢若無眼‧未畫眼來不得值。」於餘功德皆須慧者‧譬如妙金\n"+
		"所作莊嚴雖已殊妙‧若更嵌飾帝青等寶‧尤為可意。如是從施乃至靜慮‧五種金莊嚴具‧若"
		,
		/*===========================第 324 頁===========================*/
		"以揀擇理非理慧鈿寶嵌飾‧更為希有。由此能令施等五法成清淨故。猶如意識‧能於眼等\n"+
		"五根之境‧分別德失而為進止。如吉祥勇云‧「此施等福德‧若有妙慧力‧如諸金莊嚴‧嵌寶\n"+
		"尤光顯。慧於彼彼義‧增廣功德力‧如根於自境‧由意顯其力。」如是信等根中以慧為主‧若\n"+
		"有慧主‧則善了知施信等德‧慳等過失。次乃善巧盡諸煩惱‧增長功德所有方便。如云‧「信\n"+
		"等根中慧為主‧如餘根中須意識‧有此為主知德失‧亦能善巧斷煩惱。」又諸菩薩將自身\n"+
		"肉施諸求者‧如從藥樹而取‧無慢怯等分別變異‧亦因智慧現證真實。又由慧故‧能觀生死\n"+
		"涅槃所有衰損‧為利他故‧修學尸羅能令戒淨。由慧通達忍與不忍功德過失‧令心調伏則\n"+
		"邪行眾苦‧無能奪轉。由慧善知為應精進事‧即勤修彼道極昇進。又住真實靜慮所有最勝\n"+
		"喜樂‧亦是由慧依止正理之所引發‧故淨施等五法以慧為依。如云‧「菩薩開慧眼‧雖施自\n"+
		"身肉‧如從藥樹取‧無別無高下。」又云‧「慧見三有獄‧勝解度世間‧持戒非自利‧何況為三\n"+
		"有。」又云‧「慧者有忍德‧怨敵莫能害‧如調伏象王‧堪多業差別‧唯勤墮苦邊‧有慧成大\n"+
		"利。」又云‧「諸已趣歧途‧集過重罪染‧惡人豈能成‧靜慮妙喜樂。」又二功德似有相違‧由\n"+
		"是慧故能令無違。譬如菩薩作轉輪王‧王四大洲‧然能不隨欲塵遷轉‧是由具足慧臣之力。"
		,
		/*===========================第 325 頁===========================*/
		"如是雖生猛利慈心‧見諸有情極可悅意‧然無少分貪欲和雜染。見有情苦‧雖生恆常猛利\n"+
		"難忍大悲‧然無懈怠憂惱蔽覆不樂善行。又雖具足歡喜無量‧心於所緣全無散動。又雖具\n"+
		"足大平等捨‧然於眾生所有義利剎那不捨‧此皆由慧成‧以慧力故‧滅除此等力均之障。如\n"+
		"云‧「菩薩具王位‧根境如天物‧性不變非理‧是慧臣德力。慈心純利他‧然無貪薰染‧悲不忍\n"+
		"他苦‧不憂懈低劣。雖喜無散動‧捨不棄利他‧諸德所治品‧由慧滅故妙。」又如讚應讚云‧\n"+
		"「不棄捨法性‧亦隨順世俗。」謂諸相縛所執之事‧雖微塵許亦不可得‧於此法性獲大定\n"+
		"解而不棄捨‧然與世俗內外因緣各別生果‧所獲定解無違隨順。又諸餘人認為極相違事‧\n"+
		"然具慧者皆能隨順令無所違。如前論云‧「若開若遮止‧佛語或有定‧或是不決定‧然皆不\n"+
		"相違。」謂大小乘及經咒中‧見有眾多開遮不同‧若以一人雙修二事‧尋求無邊經論密意\n"+
		"時‧諸愚無慧雖覺相違‧然諸智者實見無違‧亦是慧之所作。如是無慧覺為相違‧及有慧者\n"+
		"見不相違事雖有無邊‧然二諦建立及經論中互相開遮眾多不同‧以慧分辨意趣無違‧即\n"+
		"是智慧無上功德。一切功德皆從慧生者‧如云‧「世間圓滿從慧生‧如母育子有何奇‧善逝\n"+
		"十力超勝力‧一切無等最勝事‧及餘一切功德聚‧皆依如是慧因生。世間藝術及勝藏‧所有"
		,
		/*===========================第 326 頁===========================*/
		"如眼諸經典‧救護覺慧及咒等‧種種建立法差別。眾多異門解脫門‧彼彼利益世間相‧大力\n"+
		"佛子所顯示‧此等皆從慧力生。」\n"+
		"　　無慧過患中‧施等無慧如無眼目‧攝頌云‧「俱胝庾他無導盲‧路且無知豈入城‧五度\n"+
		"無慧如無眼‧無導非能證菩提。」是故施等不能清淨‧亦復不能獲得正見‧如云‧「無慧求\n"+
		"果報‧施體不能淨‧利他為勝施‧餘唯為增財。」又云‧「無破闇慧光‧不能成淨戒‧多由無慧\n"+
		"故‧尸羅成濁染。」又云‧「慧倒心混亂‧不信住忍德‧不樂觀善惡‧如無德王名。」又云‧「智\n"+
		"者所稱讚‧無餘最細深‧欲未障直道‧無慧不能往。」又云‧「心不勤修慧‧其見不能淨。」王\n"+
		"名稱者‧謂如無德之王‧名稱一揚後仍退失。乃至未發大慧光明‧愚癡黑闇終不可滅‧慧發\n"+
		"即滅。故於發慧應隨力能精勤修習。如云‧「由發大慧光明力‧猶如出現大日光‧眾生身中\n"+
		"黑闇覆‧悉皆除遣唯餘名。」又云‧「故應盡自一切力‧於如是慧勤修習。」愚癡之因‧謂近\n"+
		"惡友‧懈怠懶惰極重睡眠‧不樂觀擇‧不解方廣‧未知謂知‧起增上慢‧上品邪見‧或生怯弱‧念\n"+
		"我不能‧不樂親近諸有智者。如云‧「懈怠懶惰近惡友‧隨睡眠轉不觀擇‧不信能仁最勝智‧\n"+
		"邪慢所覆而輕問。心劣自耽以為因‧不信親近有智士‧並其邪妄分別毒‧及諸邪見為癡"
		,
		/*===========================第 327 頁===========================*/
		"因。」故又云‧「恭敬承事可親師‧為引慧故求多聞。」謂應親近智者‧隨自力能而求多聞‧\n"+
		"若不爾者‧聞所成慧思所成慧皆不得生‧是則不知修何法故。若有多聞‧由思所聞法義‧能\n"+
		"生思慧‧從此能生廣大修慧。如吉祥勇云‧「寡聞生盲不知修‧彼無多聞何所思‧故應精勤\n"+
		"求多聞‧因此思脩生廣慧。」慈尊亦云‧「三輪諸分別‧是名所知障‧慳等諸分別‧是為煩惱\n"+
		"障。除慧無餘因‧能斷此二障‧聞為勝慧本‧故聞為第一。」集學論云‧「應忍求多聞‧次當住\n"+
		"林藪‧精勤修等引。」自釋中云‧「不能忍者‧則由厭患‧不能堪耐‧退失聞等。無多聞者‧則不\n"+
		"能知靜慮方便‧淨惑方便‧故應無厭而求多聞。」那羅延問經云‧「善男子‧若具多聞能生\n"+
		"智慧‧若有智慧能滅煩惱‧若無煩惱魔不得便。」是故聖道最勝命根謂擇法慧。慧無上因‧\n"+
		"謂於無垢經論勤求多聞‧以諸教理善為成立。\n"+
		"　　然諸欲修法者‧尚不能知聞為必須者。是由於修時不能定解‧必須觀慧思擇而修‧反\n"+
		"顛倒解‧不須多聞過失所致‧故自愛者‧應棄此過猶如惡毒。大瑜伽師云‧「覺瓦‧欲成佛\n"+
		"一切種智者‧不於牛負量經函辦其所作‧而將掌許若講若藏‧皆無所成。」樸窮瓦開啟經\n"+
		"卷安置枕前曰‧「我等是學者故‧縱未能看‧應於此等而發願心‧若不知法云何能修。」慬"
		,
		/*===========================第 328 頁===========================*/
		"哦之弟子送博朵瓦時‧三云‧「汝等快樂‧」次云‧「能得依止我如天覆地之知識‧不須於\n"+
		"他更起口水‧無須細看酣暢淋漓之本釋‧事業微少‧不勞思業果內心安泰‧以多咒法成多\n"+
		"事業令心飽滿。」霞惹瓦云‧「乃至未成佛求學無完‧至成佛時始得完畢。」迦摩瓦云‧「若\n"+
		"謂修法何須求知‧是自失壞‧我寡聞者易生此失‧易說修行不須求知。然修法者‧實定須知‧\n"+
		"縱於此短壽未能圓滿‧須不失暇身‧相續多聞。若謂修者不須‧說者乃須‧說說法師易生此\n"+
		"罪‧以修者尤須故。」如是修者慧及慧因多聞‧不容或少‧應獲廣大定解‧然此定解於未知\n"+
		"修時‧必須觀察修者極難生起‧雖自許為受持三藏之法師‧亦多認為修之前導‧或僅為佐\n"+
		"證‧非實教授。由此因緣‧說欲速成佛則須勤修‧欲利聖教則須多聞‧內自修與利聖教別執\n"+
		"為二‧此是矛盾最大狂言‧以聖教中‧除教證法別無聖教。前者是令了知修行之軌‧後者是\n"+
		"令知已予以實行‧故修行能無錯謬者‧即是最勝住持聖教。又能無錯住持修證之聖教‧必\n"+
		"依無錯了解教法故。故先知多法者‧修時即應修彼法義‧不可忘失。若先未知亦勿怯退‧當\n"+
		"隨慧力而求多聞。復非聽聞此法‧別修他法‧即所修處而求聞思‧故又不應唯修一分‧定應\n"+
		"依止‧初業菩薩所修圓滿道之次第。若慧劣弱即令修彼‧若慧廣大或初雖微劣‧由修習故"
		,
		/*===========================第 329 頁===========================*/
		"增廣之時‧將此道次漸為增廣‧能與一切清淨經論相屬而修‧亦非定須別求多聞。故凡圓\n"+
		"滿無錯教授‧略亦能攝一切經咒大小諸乘道之宗要。若廣開解亦能遍入一切教法‧未獲\n"+
		"如斯教授之時‧於少分修易生喜足‧然於聖教全體修行宗要‧難獲定解。故應親近良師‧淨\n"+
		"持尸羅‧數聞教授。每日四次修習所緣‧至誠祈禱師長本尊。又由多門積集資糧淨除業障。\n"+
		"若能勤修此圓滿因‧其慧倍復殊勝增長‧乃能生起澈底定解。如先覺云‧「先所聞法令心\n"+
		"總現‧數數思惟稱量觀察‧若忘其法專學持心‧則無助伴。」故上修者是上法師‧中品修者\n"+
		"是中法師‧凡所修法即知彼法。若由是思定解堅固‧則諸惡友唱說‧善惡一切思惟‧皆是分\n"+
		"別悉應棄捨者‧自知法中無如是語‧良師不許‧便能不隨彼轉。若無此解有信無慧‧見哭則\n"+
		"哭‧見笑則笑‧隨他所說覺為真實‧猶如流水隨引而轉。\n"+
		"<b><s>　第三慧之差別分三‧<n>一</n>通達勝義慧‧<n>二</n>通達世俗慧‧<n>三</n>通達饒益有情慧。　　今初</s></b>\n"+
		"　　謂由總相覺悟‧或由現量覺悟無我實性。第二通達世俗慧‧謂善巧五明處慧。如莊嚴\n"+
		"經論云‧「若不勤學五明處‧聖亦難證一切智‧故為調伏及攝他‧並自悟故而勤學。」謂為\n"+
		"調伏未信聖教者故‧應求聲明及因明處。為欲饒益已信者故‧應求工巧及醫方明。為自悟"
		,
		/*===========================第 330 頁===========================*/
		"故應求內明‧此是別義。又此一切皆為成佛故求‧是為通義。第三通達饒益有情慧‧通達能\n"+
		"引有情現法後法無罪義利。\n"+
		"　　第四正修慧時應如何行。發三慧時‧應令具足六種殊勝‧及具六種波羅蜜多‧自住慧\n"+
		"已‧立他於慧是為慧施‧餘如前說。\n"+
		"　　第五此等攝義。雖有現證空性之慧‧若無大菩提心‧仍非菩薩之行‧故應增長大菩提\n"+
		"心為行所依‧地上慧度修所願境‧其能圓滿無上妙智資糧所有方便‧謂發三慧‧現應勵力\n"+
		"而求多聞。若不爾者‧違越學處罪所染著‧諸餘生中亦不樂多聞。不能學習菩薩學處。若於\n"+
		"現法勤修開發智慧方便‧能遮現法不學之罪‧如妙手問經所說‧餘生亦能速疾圓滿般若\n"+
		"波羅蜜多。如是經咒二道棟梁‧六度之中‧修習靜慮之次第‧尚似略存‧修餘五度之次第‧皆\n"+
		"已隱沒‧故於修行攝要及引發定解之方便‧略為宣說。諸大經論所說‧修習緣如所有及盡\n"+
		"所有般若自性毘缽舍那之次第‧及修習靜慮自性‧奢摩他之次第‧後當廣釋。凡菩薩成佛‧\n"+
		"皆依六度而得成佛。菩薩地中‧於六度一一之後‧皆珍重宣說‧故應了知‧此是過去未來現\n"+
		"在諸菩薩眾共行之道‧此六即是一切白法大海‧故是修行宗要無上大嗢柁南。如菩薩地"
		,
		/*===========================第 331 頁===========================*/
		"云‧「如是六種波羅蜜多‧菩薩為證無上正等菩提果故‧精勤修集‧是大白法溟‧名大白法\n"+
		"海‧是一切有情一切種類圓滿之因‧名為涌施大寶泉池。又即如是所集無量福智資糧‧更\n"+
		"無餘果可共相稱‧唯除無上正等菩提。」\n"+
		"<b><s>　第二四攝成熟他相續分五‧<n>一</n>四攝自性‧<n>二</n>立四之理由‧<n>三</n>四攝之作業‧<n>四</n>攝受眷屬須依四攝‧<n>五</n>略\n"+
		"　為解說。　　今初</s></b>\n"+
		"　　布施如前六度時說‧愛語者謂於所化機開示諸度。利行者如所教義令所化機如實\n"+
		"起行‧或令正受。同事者謂教他所修自亦應修與他同學。如莊嚴經論云‧「施同示勸學‧自\n"+
		"亦隨順轉‧是為愛樂語‧利行及同事。」\n"+
		"　　第二立四之理由。何故定為四攝耶‧答謂攝受眷屬令修善行‧須先使歡喜‧此必先須\n"+
		"施以資財饒益其身。既歡喜已‧令修道時‧先須令知云何應修‧此由愛語宣說正法‧除其無\n"+
		"知斷其疑惑‧令其無倒受持法義。既了知已‧由其利行令修善行。若自不修而為他說應取\n"+
		"應捨‧彼不信受反作是難‧且不自修何為教他‧汝今尚須為他所教‧若自實行他便信受‧謂\n"+
		"教我等所修之善‧彼自亦修‧若修此善定能利益安樂我等‧先未修者能新修行‧已修行者"
		,
		/*===========================第 332 頁===========================*/
		"堅固不退‧故須同事。如云‧「能利他方便‧令取令修行‧如是令隨轉‧四攝事應知。」\n"+
		"　　第三四攝之作業。以此四攝於所化機何所作耶。謂由布施故‧令成聞法之器‧以於法\n"+
		"師生歡喜故。由愛語故‧能令信解所說之法‧以於法義令正了解斷疑惑故。由利行故‧如教\n"+
		"修行。由同事故‧已修不退長時修行。如云‧「由初為法器‧第二令勝解‧由三使修行‧第四成\n"+
		"淨修。」\n"+
		"　　第四攝受眷屬須依四攝。佛說此為成辦一切眾生義利賢善方便‧故攝徒眾應須依\n"+
		"此。如云‧「諸攝眷屬者‧當善依此理‧能辦一切義‧讚為妙方便。」\n"+
		"　　第五略為解說。愛語有二‧一隨世儀軌語‧謂遠離顰蹙‧舒顏平視‧含笑為先‧慰問諸界\n"+
		"為調適等‧隨世儀軌慰悅有情。二隨正法教語‧謂為利益安樂有情‧依能引發信戒聞捨慧\n"+
		"等功德‧宣說正法。又於能殺害怨敵之家‧無穢濁心說利益語。於極鈍根心無疑慮‧誓受疲\n"+
		"勞‧為說法語‧令攝善法。於其諂詐欺二師等‧行邪惡行諸有情所‧無恚惱心說利益語‧於此\n"+
		"難行愛語‧亦當修學。又於相續未熟‧欲斷諸蓋向善趣者‧為說先時所應作法‧謂施及戒。又\n"+
		"於已離蓋‧相續成熟心調善者‧為說增進四聖諦法。又在家出家多放逸者‧為令安住不放"
		,
		/*===========================第 333 頁===========================*/
		"逸行‧無倒諫誨。又疑惑者為斷疑故‧為說正法論議決擇‧是為一切門愛語。\n"+
		"　　利行略有二種‧一未成熟者能令成熟‧二已成熟者能令解脫。又分三種‧一於現法利‧\n"+
		"勸導利行‧謂勸令如法招集守護增長財位。二於後法利勸導利行‧謂正勸導棄捨財位‧清\n"+
		"淨出家乞求自活‧由此定獲後法安樂‧不必獲得現法安樂。三於現法後法利勸導利行‧謂\n"+
		"正勸導在家出家‧趣向世間出世離欲‧由此現法能令獲得身心輕安‧於後法中或生淨天\n"+
		"或般涅槃。又應修行難行利行‧一於往昔未種善根者‧難令行善。二現有廣大圓滿財位者‧\n"+
		"難行利行‧由其安住大放逸處故。三諸已串習外道見者‧難行利行‧由憎聖教‧愚癡邪執不\n"+
		"解理故。又應修行漸次利行‧謂於劣慧者‧先令修行粗淺教授。若成中慧‧轉中教授。成廣大\n"+
		"慧為說深法‧隨轉幽微教授教誡。\n"+
		"　　同事者‧謂於何義勸他安住‧即於此義自當安住若等若增。如是隨作何事‧先應緣於\n"+
		"有情義利‧定不應離利他意樂‧然其加行則先自調伏。如無邊功德讚云‧「有未自調伏‧雖\n"+
		"說正理教‧違自語而行‧不能調伏他。尊知此義故‧心念諸眾生‧自未調伏時‧暫勤自調伏。」\n"+
		"　　又四攝事可攝為二‧謂以財攝及以法攝。財施為初‧餘三屬法‧法為所緣正行清淨之"
		,
		/*===========================第 334 頁===========================*/
		"法‧如云‧「由財及以法‧謂所緣法等‧由此二攝門‧說為四攝事。」又此即是三世一切菩薩\n"+
		"利他方便‧故是共道。如云‧「已攝及當攝‧現攝悉皆同‧是故此即是‧成熟有情道。」又菩薩\n"+
		"行總有無邊‧然大嗢柁南即是六度四攝‧以諸菩薩唯二所作‧一自內成熟成佛資糧‧二為\n"+
		"成熟他有情相續‧六度四攝即能成辦此二事故。如菩薩地云‧「由諸波羅蜜多能自成熟\n"+
		"一切佛法‧由諸攝事能成熟他一切有情‧當知略說菩薩一切善法作業。」故於此中略說\n"+
		"彼二‧若欲廣知‧應於菩薩地中尋求。又此根本後得時‧應如何行者‧如尊者云‧「六波羅蜜\n"+
		"等‧菩薩廣大行‧由本後瑜伽‧堅修資糧道。」謂初業菩薩受菩薩戒‧住資糧道‧根本後得皆\n"+
		"不出六度‧故六度中有是根本定時所修‧有者是於後得時修。謂靜慮自性奢摩他‧及慧度\n"+
		"自性毘缽舍那一分‧是於根本定時所修。前三波羅蜜多及靜慮般若一分‧是後得時修。精\n"+
		"進俱通根本後得‧忍中一分定思深法於定時修。如尊者云‧「起根本定時‧遍觀一切法‧修\n"+
		"幻等八喻‧能淨後分別。應正學方便‧於根本定時‧應恆常修習‧止觀分平等。」若由未習如\n"+
		"是希有難行諸行‧聞時憂惱‧應念菩薩於最初時亦不能行‧然由先知所作願境漸次修習‧\n"+
		"久習之後‧不待功用能任運轉‧故其串習極為切要。若見現前不能實行‧即便棄捨全不修"
		,
		/*===========================第 335 頁===========================*/
		"心‧是極稽留清淨之道。如無邊功德讚云‧「若由聞何法‧令世間生怖‧尊亦於此法‧久未能\n"+
		"實行。然尊習其行‧時至任運轉‧是故諸功德‧不修難增長。」故受菩薩律儀者‧定無方便不\n"+
		"學諸行‧未如儀軌受行心者‧亦當勵力修欲學心。若於諸行勇樂修學‧次受律儀極為堅固‧\n"+
		"故應勤學。上士道次第中‧已說淨修願心‧及學菩薩總行道之次第。\n"+
		"<b>菩提道次第廣論卷十三終</b>"
		,
		/*===========================第 336 頁===========================*/
		"<b>菩提道次第廣論卷十四</b>\n"+
		"<b><s>敬禮勝尊具大悲者足。</s></b>\n"+
		"　　第二別學後二波羅蜜多‧謂修奢摩他毘缽舍那‧如其次第‧即是靜慮及慧波羅蜜多\n"+
		"之所攝故。\n"+
		"<b><s>　此中分六‧<n>一</n>修習止觀之勝利‧<n>二</n>顯示此二攝一切定‧<n>三</n>止觀自性‧<n>四</n>理須雙修‧<n>五</n>次第決定‧<n>六</n>各別\n"+
		"　學法。　　今初</s></b>\n"+
		"　　大小二乘世出世間一切功德‧皆止觀之果。如解深密經云‧「慈氏‧若諸聲聞‧若諸菩\n"+
		"薩‧若諸如來‧所有世間及出世間一切善法‧應知皆是此奢摩他毘缽舍那所得之果。」若\n"+
		"謂止觀‧豈非已得修所成者身中功德‧今說彼一切功德皆止觀之果‧云何應理。答‧如下所\n"+
		"說真實止觀‧實是已得修所成之功德‧則大小乘一切功德‧非盡彼二之果。然以善緣心一\n"+
		"境性‧諸三摩地‧悉皆攝為奢摩他品‧及凡揀擇如所有性盡所有性諸妙善慧‧悉皆攝為毘\n"+
		"缽舍那品。故密意說三乘所有一切功德‧皆止觀之果‧無相違過。又於此義‧修信大乘經亦"
		,
		/*===========================第 337 頁===========================*/
		"密意說云‧「善男子由此異門‧說諸菩薩盡其所有大乘信解大乘出生‧應知皆是無散亂\n"+
		"心‧正思法義之所出生。」無散亂心‧謂奢摩他品心一境性‧正思法義‧謂毘缽舍那品妙觀\n"+
		"察慧‧故大小乘一切功德‧皆以觀慧思擇而修及於所緣心一境性‧二所成辦‧非唯止修或\n"+
		"唯觀修一分而成。如解深密經云‧「眾生為相縛‧及為粗重縛‧要勤修止觀‧爾乃得解脫。」\n"+
		"言粗重者‧謂心相續中所有習氣‧增長內心顛倒堪能‧相者謂於外境前後所生顛倒習氣。\n"+
		"般若波羅蜜多教授論說‧前者為觀所斷‧後者為止所斷。此上是引有止觀名者所有勝利‧\n"+
		"餘未說止觀名者‧凡說靜慮般若勝利‧其義同故‧應知皆是止觀勝利。\n"+
		"　　第二顯示此二攝一切定。譬如一樹‧雖有無邊枝葉花果‧然總攝彼一切扼要厥為根\n"+
		"本。如是經說大小乘無邊三摩地‧然總攝一切之宗要厥為止觀。如解深密經云‧「如我所\n"+
		"說‧無量聲聞菩薩如來‧有無量種勝三摩地‧當知一切皆此所攝。」故欲求定者‧不能尋求\n"+
		"無邊差別‧應求一切等持總聚止觀二品‧一切時中恆應修學。如修次下編云‧「世尊雖說\n"+
		"諸菩薩眾無量無數等持差別‧然止觀二品‧能遍一切勝三摩地‧當說止觀雙運轉道。」修\n"+
		"次中編亦云‧「由此二品能攝一切三摩地故‧諸瑜伽師一切時中應修止觀。」"
		,
		/*===========================第 338 頁===========================*/
		"　　第三止觀自性分二。初奢摩他自性‧如解深密經云‧「即於如是善思惟法‧獨處空間\n"+
		"內正安住‧作意思惟‧復即於此能思惟心‧內心相續作意思惟‧如是正行多安住故‧起身輕\n"+
		"安及心輕安‧是名奢摩他。如是菩薩能求奢摩他。」義謂隨所定解十二分教中‧五蘊等義\n"+
		"為所緣境‧由念正知‧令能緣心於所緣境‧相續安住而不散亂。故心於境能任運住‧若時生\n"+
		"起身心輕安所有喜樂‧此三摩地即奢摩他。此由內攝其心不散所緣即能生起‧不要通達\n"+
		"諸法真實。\n"+
		"　　二毘缽舍那自性‧即前經云‧「彼由獲得身心輕安為所依故‧捨離心相‧即於如所善\n"+
		"思惟法內‧三摩地所行影像觀察勝解‧即於如是勝三摩地所行影像所知義中‧能正思擇\n"+
		"最極思擇‧周遍尋思周遍伺察‧若忍若樂若覺若見若觀‧是名毘缽舍那。如是菩薩能善巧\n"+
		"毘缽舍那。」此經宣說毘缽舍那是觀察慧‧最極明顯無可抵賴‧傳說支那堪布見已謗云‧\n"+
		"「此是經否不得而知‧」用足毀踏。因彼妄計一切分別皆執實相‧要棄觀慧全不作意‧乃\n"+
		"為修習甚深法義‧不順此經故用足毀‧現見多有隨此派者。聖無著說‧「正思擇者謂思擇\n"+
		"盡所有性‧最極思擇謂思擇如所有性‧以有分別慧作意取諸相時名周遍尋思‧真實觀時"
		,
		/*===========================第 339 頁===========================*/
		"名周遍伺察。」尋謂粗思‧伺謂細察‧取諸相者非執諦實‧是明了境相‧由是思擇如所有性\n"+
		"盡所有性‧皆有周遍尋思及周遍伺察。\n"+
		"　　寶雲經說義同深密‧如云‧「奢摩他者謂心一境性‧毘缽舍那者謂正觀察。」慈尊於\n"+
		"莊嚴經論云‧「應知諸法名‧總集為止道‧應知妙觀道‧思擇諸法義。」又云‧「正住為所依‧\n"+
		"心安住於心‧及善思擇法‧應知是止觀。」依定住心說名為止‧善擇法慧說名為觀。前經密\n"+
		"意作是解已‧令更不能別解經義‧菩薩地云‧「於離言說唯事唯義所緣境中繫心令住‧離\n"+
		"諸戲論‧離心擾亂想作意故‧於諸所緣而作勝解‧於諸定相令心內住安住等住‧廣說乃至\n"+
		"一趣等持‧是名奢摩他。云何毘缽舍那‧由奢摩他熏修作意‧即於如先所思惟法思惟其相‧\n"+
		"如理簡擇‧最極簡擇‧極簡擇法‧廣說乃至覺明慧行‧是名毘缽舍那。」此與前說極相隨順‧\n"+
		"此文雙解經意及慈尊意‧故於前文所明止觀應生定解。修次中編亦云‧「外境散亂‧既止\n"+
		"息已‧於內所緣恆常相續任運而轉‧安住歡喜輕安之心‧是名奢摩他。即由安住奢摩他時‧\n"+
		"思擇真實‧是名毘缽舍那。」般若波羅蜜多教授論云‧「盡所有性如所有性無分別影像\n"+
		"者‧是止所緣。盡所有性如所有性有分別影像者‧是觀所緣。」此說於如所有性盡所有性"
		,
		/*===========================第 340 頁===========================*/
		"不分別住名奢摩他‧思擇二境名毘缽舍那。解深密經云‧「世尊‧幾是奢摩他所緣‧告曰一\n"+
		"種‧謂無分別影像。幾是毘缽舍那所緣‧告曰一種‧謂有分別影像。幾是俱所緣‧告曰有二‧謂\n"+
		"事邊際所作成辦。」集論於事邊際‧開說如所有性及盡所有性之二。寂靜論師如前所說\n"+
		"止觀皆能俱緣如所有性盡所有性。是故止觀非就所緣境相而分‧既有通達空性之止‧亦\n"+
		"有不達空性之觀。若能止心於外境轉‧住內所緣即說名止‧增上觀照即名勝觀。\n"+
		"　　有說內心無分別住‧無明了相說名為止‧有明了力說名為觀‧此不應理。以與佛經及\n"+
		"慈尊無著之論‧並修次第等諸廣決擇止觀相者‧說於所緣心一境性勝三摩地名奢摩他‧\n"+
		"於所知義正揀擇慧名毘缽舍那皆相違故。又無分別心有無明了之力者‧是因三摩地有\n"+
		"無沈沒之差別‧以此為止觀之差別‧極不應理‧以一切奢摩他定皆須離沈‧凡離沈沒三摩\n"+
		"地中‧心皆定有明淨分故。故緣如所有性之定慧‧是就內心證與未證二無我性隨一而定‧\n"+
		"非就其心住與不住‧明了安樂無分別相‧而為判別‧以心未趣向無我真實者‧亦有無量明\n"+
		"樂無分別三摩地故。雖未獲得實性見解‧但若執心令無分別‧現可生起。故未解空性‧生無\n"+
		"分別定無少相違‧若能由此久攝其心‧以攝心力風生堪能‧身心法爾能生喜樂‧故生喜樂"
		,
		/*===========================第 341 頁===========================*/
		"亦不相違。喜樂生已‧即由喜樂受相明了力令心明了‧故說一切明了安樂無分別定‧皆證\n"+
		"真性全無確證。諸證空性妙三摩地‧雖有明樂無所分別‧諸未趣向空性之定‧亦有極多明\n"+
		"了安樂及無分別‧故應善辨二定差別。\n"+
		"　　第四理須雙修。修止觀一種何非完足必雙修耶‧答‧譬如夜間‧為觀壁畫而燃燈燭‧若\n"+
		"燈明亮無風擾動‧乃能明見諸像‧若燈不明‧或燈雖明而有風動‧是則不能明見諸色。如是\n"+
		"為觀甚深義故‧亦須定解真義無倒妙慧‧及心於所緣‧如欲安住而無擾動‧乃能明見真實。\n"+
		"若僅具有心不散亂無分別定‧然無通達實性妙慧‧是離能見實性之眼‧於三摩地任何薰\n"+
		"修‧然終不能證真實性。若雖有見能悟無我真實性義‧然無正定‧令心專一堅固安住‧則無\n"+
		"自在‧為分別風之所動搖‧亦定不能明見實義‧是故雙須止觀二品。如修次中編云‧「唯觀\n"+
		"離止如風中燭‧瑜伽師心於境散亂不能堅住‧不生明了智慧光明‧故當雙修。」大般涅槃\n"+
		"經云‧「聲聞不見如來種性‧以定力強故‧慧力劣故。菩薩雖見而不明顯‧慧力強故‧定力劣\n"+
		"故。唯有如來遍見一切‧止觀等故。由止力故如無風燭‧諸分別風不動心故‧由觀力故‧永斷\n"+
		"一切諸惡見網‧不為他破。」月燈經云‧「由止力無動‧由觀故如山。心無散亂‧安住所緣‧是"
		,
		/*===========================第 342 頁===========================*/
		"修止迹。證無我義‧斷我見等一切惡見‧敵不能動猶如山王‧是修觀迹。故於此二應知差\n"+
		"別。」\n"+
		"　　又於未成奢摩他前‧雖以觀慧觀無我義‧心極動搖如風中燭‧無我影像且不明顯‧若\n"+
		"成止後而善觀察‧則已滅除極動過失‧方能明了無我影像。故毘缽舍那不散動心‧是從無\n"+
		"分別奢摩他生‧通達實義非從止生。譬如燈能照色‧是從前念燈火而生‧非從遮風帳幔等\n"+
		"起‧燈固不動‧則從幔生。若心無掉沈不平等相‧住奢摩他定‧次以慧觀能證真實。故正攝法\n"+
		"經密意說云‧「由心住定‧乃能如實了知真實。」修次初編云‧「心動如水無止為依‧不能\n"+
		"安住非等引心‧不能如實了知真義‧故世尊說由心住定‧乃能如實了知真實。」\n"+
		"　　又成就奢摩他已‧非僅能遮‧正觀無我性慧動搖過失‧即修無常業果‧生死過患慈悲\n"+
		"菩提心等‧凡此一切修觀慧時‧於所緣境散亂過失‧亦皆能遣。各於所緣無散亂故‧所修眾\n"+
		"善皆有大力‧未得止前多是散心‧故所修善皆悉微劣。如入行論云‧「諸人心散亂‧住煩惱\n"+
		"齒中。」又云‧「雖經長時修‧念誦苦行等‧心散亂所作‧佛說無義利。」\n"+
		"　　如是成就無分別定‧心於所緣不餘散者‧義為令心於善所緣‧成就堪能如欲而住‧此"
		,
		/*===========================第 343 頁===========================*/
		"復繫心於一所緣即能安住‧欲令起時須於無邊善所緣境‧如欲而轉‧如通利溝引諸流水。\n"+
		"故成止後‧更須修集緣如所有及盡所有妙慧‧施心戒心忍辱精進淨信及厭離等‧無邊眾\n"+
		"善‧滅無邊失。若唯安住一所緣境者‧是未了知修止之義‧不能增長廣大善行。如是若捨行\n"+
		"品觀品妙觀察慧‧唯修三摩地心一境性‧其利極小。又於無我義‧若無觀慧引生恆常猛利\n"+
		"定解‧緣如所有性毘缽舍那‧唯久修習正奢摩他‧僅能壓伏現行煩惱‧終不能斷煩惱種子‧\n"+
		"故非唯修止‧亦定應修觀。如修次中編云‧「諸瑜伽師若唯修止‧唯能暫伏煩惱現行‧不能\n"+
		"斷障‧以未發生智慧光明‧則定不能壞隨眠故。」解深密經云‧「由靜慮故‧降伏煩惱‧由般\n"+
		"若故‧斷諸隨眠。」三摩地王經云‧「雖善修正定‧不能破我想‧後為煩惱亂‧如外道修定。若\n"+
		"觀法無我‧觀已善修習‧是證涅槃因‧非餘能寂滅。」菩薩藏經亦云‧「若未聞此菩薩法門‧\n"+
		"亦未聽聞聖調伏法‧唯三摩地而得喜足‧為憍慢轉墮增上慢‧不能解脫生老病死愁嘆苦\n"+
		"憂及諸衰惱‧不能解脫六道輪迴‧不能解脫諸大苦蘊。」如來於此密意說云‧「從他聽聞\n"+
		"解脫老死‧故欲斷諸障發淨智者‧應依奢摩他而修妙慧。」寶積經云‧「住戒能得定‧得定\n"+
		"能修慧‧由慧得淨智‧智淨戒圓滿。」修信大乘經云‧「善男子‧若諸菩薩不住於慧‧我不說"
		,
		/*===========================第 344 頁===========================*/
		"彼能信大乘‧能生大乘。」\n"+
		"　　第五次第決定。如入行論云‧「當知具止觀‧能摧諸煩惱‧故應先求止。」謂先修止‧次\n"+
		"依止故‧乃修妙觀。若作是念‧修次初編云‧「此二所緣無定‧」此說止緣無有決定。前文亦\n"+
		"說‧止所緣中俱有法及法性‧故先了解無我深義‧緣彼而修‧則心無散亂之止及緣空性之\n"+
		"觀同時俱起‧何必先求奢摩他已‧次乃修觀耶。答‧此說觀前先修止者‧非說引生正見通達\n"+
		"無我須先修止。雖無止者‧亦能生正見故。又此正見內生強力之感覺‧亦不須以止為先‧以\n"+
		"無止者‧僅以觀慧數數思擇‧此亦能生強力感覺‧無所違故。若相違者‧則修無常生死過患\n"+
		"菩提心等‧引生強力之感覺‧皆須依止。太為過失‧理相等故。\n"+
		"　　若爾‧觀前修止為何耶。如解深密經說‧若以觀慧而修思擇‧最極思擇‧乃至未起身心\n"+
		"輕安‧爾時但是毘缽舍那相應作意‧生輕安已乃名妙觀。故先未得止者‧僅以觀慧而修思\n"+
		"擇‧終不能發身心輕安所有喜樂。若得止已‧後以觀慧思擇而修‧輕安乃生‧故觀須止因‧下\n"+
		"當廣說。故若非僅由住一境‧即以觀慧思擇之力‧若能引發輕安之時‧乃是成辦毘缽舍那。\n"+
		"雖緣空性為境‧若但由其住一所緣‧引生輕安‧仍未能出修止之法‧非此即得毘缽舍那。又"
		,
		/*===========================第 345 頁===========================*/
		"未得止者‧先求了解無我之義‧次緣此義數數思擇‧由此思擇不能得止。若不思擇安住而\n"+
		"修‧由此為依雖可得止‧然除修止之外‧而無修觀之法‧更須修觀。故仍未出先修止已次修\n"+
		"勝觀決定次第。若不以思擇引發輕安‧建立為觀者‧則先修止次乃修觀‧全無正理。若不如\n"+
		"是次第而修‧亦不應理。解深密經說‧要依奢摩他乃修毘缽舍那。又「依前而生後」說六\n"+
		"度中靜慮與般若之次第及依增上定學‧而生增上慧學之次第‧皆先修止而後修觀。又如\n"+
		"前引菩薩地文‧聲聞地亦說‧當依奢摩他而修毘缽舍那。中觀心論及入行論修次三編智\n"+
		"稱論師寂靜論師等‧皆說先修奢摩他已‧後修勝觀。故印度少數論師‧有說無須別求正奢\n"+
		"摩他‧最初即以觀慧思擇‧亦能引生毘缽舍那者‧違諸大轍所造論典‧非諸智者可憑信處。\n"+
		"　　又此止觀次第‧是就新生之時應如是修‧若先已生‧則無決定次第‧亦可先修毘缽舍\n"+
		"那‧次修奢摩他。何故集論說有先得勝觀而未得止‧彼應依觀而勤修止耶‧答‧此非說未得\n"+
		"第一靜慮未到定所攝之止‧是說未得第一靜慮三摩地以上之止。此復是說證四諦已‧次\n"+
		"依此觀‧而修第一靜慮以上之止。本地分云‧「又已如實善知從苦至道‧然未能得初靜慮\n"+
		"等‧於此無間住心‧更不擇法‧是依增上慧而修增上心。」又為便於立言說故‧於九住心通"
		,
		/*===========================第 346 頁===========================*/
		"說為止‧思擇等四通說名觀。然真實止觀如下所說‧要生輕安乃可安立。\n"+
		"<b><s>　第六各別學法分三‧<n>一</n>學奢摩他法‧<n>二</n>學毘缽舍那法‧<n>三</n>學雙運法。　初又分三‧<n>一</n>修止資糧‧<n>二</n>依止\n"+
		"　資糧修奢摩他‧<n>三</n>修已成就奢摩他量。　　今初</s></b>\n"+
		"　　諸瑜伽師先集資糧‧即是速易成止之因。其中有六‧一住隨順處‧住具五德之處‧一易\n"+
		"於獲得‧謂無大劬勞得衣食等。二處所賢善‧謂無猛獸等兇惡眾生‧及無怨等之所居住。三地\n"+
		"土賢善‧謂非引生疾病之地。四伴友賢善‧謂具良友戒見相同。五具善妙相‧謂日無多人夜靜\n"+
		"聲寂。如莊嚴經論云‧「具慧修行處‧易得賢善處‧善地及善友‧瑜伽安樂具。」二少欲‧不貪\n"+
		"眾多上妙衣服等事。三知足‧雖得微少粗弊衣等常能知足。四斷諸雜務‧皆當斷除行貿易\n"+
		"等諸惡事業‧或太親近在家出家‧或行醫藥算星相等。五清淨尸羅‧於別解脫及菩薩律‧皆\n"+
		"不應犯性罪遮罪破壞學處‧設放逸犯‧速生追悔如法悔除。六斷除貪欲等諸惡尋思‧於貪\n"+
		"欲等當修殺縛等現法過患及墮惡趣等當來過患‧又生死中愛非愛事‧皆是無常可破壞\n"+
		"法‧此定不久與我分離‧何為於彼而起貪等。由是修習‧能斷貪等諸惡尋思‧此如修次中編\n"+
		"之意‧於聲聞地應當廣知。"
		,
		/*===========================第 347 頁===========================*/
		"　　如是六法能攝正定‧未生新生‧生已不退‧安住增長因緣宗要。尤以清淨尸羅‧觀欲過\n"+
		"患‧住相順處為其主要。善知識敦巴云‧「我等唯覺是教授過‧專求教授‧然定不生‧是未安\n"+
		"住資糧所致。」言資糧者‧即前六法。又前四度‧即是第五靜慮資糧。修次初編云‧「若能不\n"+
		"著利等諸欲‧善住尸羅‧性忍眾苦‧勤發精進‧速能引發正奢摩他。故解深密經等‧亦說施等\n"+
		"為後後因。」道炬論云‧「失壞止支分‧雖勵力修習‧縱經多千年‧不能成正定。」故真欲修\n"+
		"止觀定者‧應勵力集聲聞地中正奢摩他十三資糧‧極為主要。\n"+
		"<b><s>　第二依止資糧修奢摩他分二‧<n>一</n>加行‧<n>二</n>正行。　　今初</s></b>\n"+
		"　　修如前說加行六法‧尤應久修大菩提心。又應淨修共中下士所緣自體‧為菩提心之\n"+
		"支分。\n"+
		"<b><s>　第二正行分二‧<n>一</n>身何威儀而修‧<n>二</n>正釋修習之次第。　　今初</s></b>\n"+
		"　　如修次中編下編所說‧於安樂具身具八法‧足者‧謂全跏趺‧如毘盧遮那佛坐‧或半跏\n"+
		"趺。眼者‧謂不應太開亦非太閉‧垂注鼻端。身者‧謂非過後仰莫太前屈‧端身內念。肩者‧謂平\n"+
		"齊而住。頭者‧莫揚莫低莫歪一方‧自鼻至臍正直而住。齒與唇者‧隨自然住。舌者‧令抵上齒。"
		,
		/*===========================第 348 頁===========================*/
		"息者‧內外出入莫令有聲‧粗猛急滑‧必使出入無所知覺‧全無功用徐徐而轉。聲聞地說於\n"+
		"佛所許‧或床或座或草敷上‧結跏趺坐‧有五因緣‧一善歛其身速發輕安‧由此威儀順生輕\n"+
		"安故。二由此宴坐能經久時‧以此威儀不極令身疾疲倦故。三由此威儀不共外道‧及異論\n"+
		"故。四由此威儀令他見已極信敬故。五由此威儀佛佛弟子‧共所開許共依止故。正觀如是\n"+
		"五因緣故‧結跏趺坐。端正身者為令不生昏沈睡眠‧先應令身具八威儀‧尤於調息如說善\n"+
		"修。\n"+
		"　　第二正釋修習之次第。諸道次第‧多依辨中邊論所說‧由八斷行‧斷五過失‧修奢摩他。\n"+
		"善知識拉梭瓦所傳之教授‧更於彼上‧加聲聞地所說六力‧四種作意‧及九住心‧德稱大師\n"+
		"道次第云‧「四作意中‧攝九住心及斷六過八對治行‧是為一切正定方便‧眾多契經及莊\n"+
		"嚴經論‧辨中邊論‧無著菩薩瑜伽師地論‧中觀宗三編修次等‧開示修靜慮之方便中一切\n"+
		"皆同。若能先住正定資糧‧以此方便勵力修習‧決定能得妙三摩地。現在傳說修靜慮之甚\n"+
		"深教授中‧全不見此方便之名‧若不具足正定資糧及無此方便‧雖長時修定終不成。」此\n"+
		"語是於諸大教典修定方法‧得清淨解。又總三乘修道次第‧無著菩薩於五分中極廣決擇‧"
		,
		/*===========================第 349 頁===========================*/
		"故彼為最廣開示修行之論‧然於一處廣說之事‧餘則從略。止觀二法‧攝決擇說於聲聞地\n"+
		"應當了知‧故聲聞地最為廣者。慈尊則於莊嚴經論辨中邊論‧說九住心及八斷行‧獅子賢\n"+
		"論師蓮花戒論師寂靜論師等‧印度智者隨前諸論‧亦多著有修定次第‧又除緣佛像空點\n"+
		"種子形等‧所緣不同外‧其定大體‧前諸大論與咒所說‧極相隨順。尤於定五過失及除過方\n"+
		"便等經反較詳‧然能依彼大論修者‧幾同晝星。將自心垢責為論過‧謂彼唯能開闢外解‧妄\n"+
		"執開示心要義理別有教授。於彼所說修定次第‧正修定時‧竟為何似‧全無疑惑。然此教授\n"+
		"一切修行‧前後皆取大論所出‧故於此處修定方法‧亦取大論而為宣說。\n"+
		"<b><s>　此又分二‧<n>一</n>引生無過三摩地法‧<n>二</n>依彼引生住心次第。　初又分三‧<n>一</n>繫心所緣先如何修‧<n>二</n>住\n"+
		"　所緣時應如何修‧<n>三</n>住所緣後應如何修。　　今初</s></b>\n"+
		"　　若不能滅不樂修定‧樂定障品所有懈怠‧初即於定不令趣入‧縱一獲得亦不能相續‧\n"+
		"速當退失‧故滅懈怠為初切要。若能獲得身心輕安‧喜樂增廣‧晝夜行善能無疲厭‧懈怠盡\n"+
		"除‧然生輕安‧須於能生輕安之因妙三摩地‧恆發精進。然生精進‧須於正定具足恆常猛利\n"+
		"希欲‧欲樂之因‧須由觀見正定功德生堅信心‧故應先思正定功德‧數修信心。此等次第‧修"
		,
		/*===========================第 350 頁===========================*/
		"者觀之極顯決定‧故應認為最勝宗要。辨中邊論云‧「即所依能依‧及所因能果。」所依謂\n"+
		"欲勤所依故‧能依謂勤或名精進‧欲因謂信深忍功德‧勤果謂輕安。此中所修正定功德‧謂\n"+
		"由獲得奢摩他已‧現法樂住‧身心喜樂‧及由獲得身心輕安‧於善所緣心如欲轉。又由息滅\n"+
		"於顛倒境散亂無主‧則諸惡行皆不得生‧隨所修善皆有強力。又止為依‧能引神通變化等\n"+
		"德‧尤由依止‧能生通達如所有性毘缽舍那‧速疾能斷生死根本。若能思惟此諸功德‧則於\n"+
		"修定增長勇悍‧生勇悍故恆樂修定‧極易獲得勝三摩地‧得已不失能數修習。\n"+
		"<b><s>　第二住所緣時應如何修分二‧<n>一</n>明心住之所緣‧<n>二</n>心於所緣如何安住。　初又分二‧<n>一</n>總建立所\n"+
		"　緣‧<n>二</n>明此處之所緣。　初又分三‧<n>一</n>正明所緣‧<n>二</n>顯示何等補特伽羅應緣何境‧<n>三</n>顯示所緣異門。\n"+
		"　　　今初</s></b>\n"+
		"　　如世尊言‧修瑜伽師有四所緣‧謂周遍所緣‧淨行所緣‧善巧所緣‧淨惑所緣。周遍所緣\n"+
		"復有四種‧謂有分別影像‧無分別影像‧事邊際性‧所作成辦。就能緣心立二影像‧初是毘缽\n"+
		"舍那所緣‧二是奢摩他所緣。言影像者‧謂非實所緣自相‧唯是內心所現彼相。由緣彼相正\n"+
		"思擇時‧有思擇分別故‧名有分別影像。若心緣彼不思擇住‧無思擇分別故‧名無分別影像。"
		,
		/*===========================第 351 頁===========================*/
		"又此影像為何所緣之影像耶‧謂是五種淨行所緣‧五種善巧所緣‧二種淨惑所緣之影像。\n"+
		"就所緣境立事邊際‧此有二種‧如云唯爾更無餘事‧是盡所有事邊際性‧如云實爾非住餘\n"+
		"性‧是如所有事邊際性。其盡所有性者‧謂如於五蘊攝諸有為‧於十八界及十二處攝一切\n"+
		"法‧四諦盡攝所應知事‧過此無餘。如所有性者‧謂彼所緣實性真如理所成義。就果安立所\n"+
		"作成辦‧謂於如是所緣影像‧由奢摩他毘缽舍那‧作意所緣‧若修若習若多修習‧遠離粗重\n"+
		"而得轉依。\n"+
		"　　淨行所緣者。由此所緣能淨貪等增上現行‧略有五種‧謂不淨‧慈愍‧緣起‧界別‧阿那波\n"+
		"那。緣不淨者‧謂緣毛髮等三十六物‧名內不淨‧及青瘀等名外不淨。是於內心所現不淨非\n"+
		"可愛相‧任持其心。慈謂普緣親怨中三‧等引地攝‧欲與利益安樂意樂。即由慈心行相‧於彼\n"+
		"所緣任持其心‧名曰緣慈‧是於心境俱說為慈。緣緣起者‧謂唯依三世緣起之法‧生唯法果‧\n"+
		"除法更無實作業者‧實受果者‧即於是義任持其心。緣界差別者‧謂各別分析地水火風空\n"+
		"識六界‧即緣此界任持其心。緣阿那波那者‧謂於出入息‧由數觀門住心不散。\n"+
		"　　善巧所緣亦有五種。謂善巧蘊‧界‧處‧緣起及處非處。蘊謂色等五蘊‧蘊善巧者‧謂能了"
		,
		/*===========================第 352 頁===========================*/
		"知除蘊更無我及我所。界謂眼等十八界‧界善巧者‧謂知諸界從自種生‧即知因緣。處謂眼\n"+
		"等十二處‧處善巧者‧謂知內六處為六識增上緣‧知外六處為所緣緣‧知無間滅意為等無\n"+
		"間緣。緣起謂十二有支‧緣起善巧者‧謂知緣起是無常性苦性無我性。處非處者‧謂從善業\n"+
		"生可愛果是名為處‧從不善業生可愛果是名非處‧處非處善巧者即如是知。此即善巧緣\n"+
		"起‧其中差別‧此是了知各別之因。又以此等作奢摩他所緣之時‧謂於蘊等所決定相‧任持\n"+
		"其心一門而轉。\n"+
		"　　又淨惑者‧謂唯暫傷煩惱種子及永斷種。初所緣者‧謂觀欲地乃至無所有處下地粗\n"+
		"相‧上地靜相。第二所緣‧謂四諦中無常等十六行‧又以此等作奢摩他所緣之時‧謂於諸境\n"+
		"所現影像‧隨心決定任持其心不多觀察。\n"+
		"　　修次中編說三種所緣。謂十二分教‧一切皆是隨順趣向臨入真如‧總攝一切安住其\n"+
		"心。或緣蘊等總攝諸法‧或於見聞諸佛聖像安住其心。其於蘊等住心之法‧謂先了知一切\n"+
		"有為五蘊所攝‧次於五蘊漸攝有為‧即緣五蘊任持其心。譬如觀擇而修‧能生觀慧。如是攝\n"+
		"略而修‧亦引生勝三摩地‧攝心所緣而不流散‧此即對法論之教授。如是亦應了知界處攝"
		,
		/*===========================第 353 頁===========================*/
		"一切法‧漸攝於彼任持其心。\n"+
		"　　又‧淨行所緣‧上品貪行等易除貪等‧依此易得勝三摩地‧故是殊勝所緣。善巧所緣‧能\n"+
		"破離彼諸法之補特伽羅我‧隨順引生通達無我毘缽舍那‧故是極善奢摩他所緣。淨惑所\n"+
		"緣‧能總對治一切煩惱‧故義極大。遍滿所緣‧離前所緣非更別有‧故當依殊勝奢摩他所緣\n"+
		"修三摩地。有緣塊石草木等物而修定者‧自顯未達妙三摩地所緣建立。又有說於所緣住\n"+
		"心‧皆是著相‧遂以不繫所緣無依而住‧謂修空性。此是未解修空之現相。當知爾時若全無\n"+
		"知‧則亦無修空之定。若有知者‧為知何事‧故亦定有所知‧有所知故‧即彼心之所緣‧以境與\n"+
		"所緣所知‧是一義故。是則應許‧凡三摩地皆是著相‧是故彼說不應正理。又是否修空‧須觀\n"+
		"是否安住通達實性之見而修‧非觀於境有無分別‧下當廣說。又說安住無所緣者‧彼必先\n"+
		"念「我當持心‧必令於境全不流散。」次持其心。是則緣於唯心所緣‧持心不散‧言無所緣\n"+
		"與自心相違。故明修定諸大教典‧說多種所緣‧義如前說‧故於住心之所緣‧應當善巧。又修\n"+
		"次論說‧奢摩他所緣無定‧道炬論說隨一所緣者‧義謂不須定拘一種所緣差別‧非說凡事\n"+
		"皆作所緣。"
		,
		/*===========================第 354 頁===========================*/
		"　　二顯示何等補特伽羅應緣何事。若貪增上‧乃至尋思增上補特伽羅‧如聲聞地引頡\n"+
		"隸伐多問經云‧「頡隸伐多‧若有比丘勤修觀行‧是瑜伽師。若唯有貪行‧應於不淨緣安住\n"+
		"其心‧若唯有瞋行‧應於慈愍‧若唯癡行‧應於緣性緣起‧若唯有慢行‧應於界差別安住其\n"+
		"心。」又云‧「若唯有尋思行‧應於阿那阿波那念安住其心‧如是名為於相稱緣安住其\n"+
		"心。」聲聞地云‧「此中若是貪瞋癡慢及尋思行補特伽羅‧彼於最初‧唯應先修淨行所緣\n"+
		"而淨諸行‧其後乃能證得住心。又彼所緣各別決定‧故於所緣定應勤修。」故於所緣定應\n"+
		"勤學‧若是等分或是薄塵補特伽羅‧於前所緣隨樂攝心‧無須決定。聲聞地云‧「等分行者‧\n"+
		"隨其所樂精勤修習‧唯為住心非為淨行‧如等分行者‧薄塵行者‧當知亦爾。」貪等五增上\n"+
		"者‧謂先餘生中於貪等五‧已修已習已多修習‧故於下品貪等五境‧亦生猛利長時貪等。等\n"+
		"分行者‧謂先餘生中於貪等五不修不習不多修習‧然於彼法未見過患‧未能厭壞‧故於彼\n"+
		"境無有猛利長時貪等‧然貪等五非全不生。薄塵行者‧謂先餘生中於貪等五不修習等‧見\n"+
		"過患等‧故於眾多美妙上品可愛境等貪等徐起‧於中下境全不生起。又增上貪等經極長\n"+
		"時‧等分行者‧非極長時‧薄塵行者‧速證心住。善巧所緣為何補特伽羅之所勤修‧如頡隸伐"
		,
		/*===========================第 355 頁===========================*/
		"多問經云‧「頡隸伐多‧若有比丘勤修觀行‧是瑜伽師。若愚一切諸行自相‧或愚我有情命\n"+
		"者生者能養育者‧補特伽羅事‧應於蘊善巧安住其心。若愚其因應於界善巧‧若愚其緣應\n"+
		"於處善巧‧若愚無常苦空無我應於緣起處非處善巧安住其心。」此五所緣正滅愚癡。淨\n"+
		"惑所緣為何補特伽羅安住其心‧亦如前經云‧「若樂離欲界欲‧應於諸欲粗性‧諸色靜性‧\n"+
		"若樂離色界欲‧應於諸色粗性‧無色靜性‧安住其心。若樂通達及樂解脫遍一切處薩迦耶\n"+
		"事‧應於苦諦集諦滅諦道諦‧安住其心。」此諸所緣‧通於毘缽舍那思擇修習‧及奢摩他安\n"+
		"住修習二種所緣‧非唯奢摩他之所緣。然因有是新修奢摩他之所緣‧有是奢摩他生已勝\n"+
		"進所緣‧故於修止所緣中說。\n"+
		"　　三顯示所緣異門。正定所緣攝持心處‧即前所說心中所現所緣之影像。其名異門‧如\n"+
		"聲聞地云‧「即此影像亦名三摩地相‧亦名三摩地所行境界‧亦名三摩地方便‧亦名三摩\n"+
		"地門‧亦名作意處‧亦名內分別體‧亦名光影‧如是等類‧當知名為所知事同分影像諸名差\n"+
		"別。」\n"+
		"<b>菩提道次第廣論卷十四終</b>"
		,
		/*===========================第 356 頁===========================*/
		"<b>菩提道次第廣論卷十五</b>\n"+
		"　　二明此處所緣者。已說如是多種所緣‧今當緣何而修止耶。答如前經說‧無有限定‧須\n"+
		"各別緣‧以補特伽羅有差別故。尤其上品貪行者等修奢摩他時‧所緣各別決定。若不爾者‧\n"+
		"縱或能得奢摩他相應三摩地‧然不能得實奢摩他。若不久修淨行所緣‧尚說不得正奢摩\n"+
		"他‧況全棄捨淨行所緣。多尋思者尤應修息。若是等分補特伽羅‧或是薄塵補特伽羅‧於前\n"+
		"所說諸所緣中‧隨意所樂作所緣處。又修次第中下二編‧依於現在諸佛現住三摩地經及\n"+
		"三摩地王經‧說緣佛像修三摩地。覺賢論師說多所緣‧如云‧「止略有二‧謂向內緣得及向\n"+
		"外緣得。內緣有二‧謂緣全身及依身法‧緣身又三‧謂即緣身為天形像‧緣骨鏁等不淨行相‧\n"+
		"緣骨杖等三昧耶相。緣依身法又有五種‧謂緣息緣細相緣空點緣光支緣喜樂。向外緣者\n"+
		"亦有二種‧謂殊勝平庸‧殊勝又二‧謂緣佛身語。」道炬論釋亦引此文。\n"+
		"　　其緣佛身攝持心者。隨念諸佛故能引生無邊福德‧若佛身相明顯堅固‧可作禮拜供\n"+
		"養發願等‧積集資糧之田及悔除防護等淨障之田‧故此所緣最為殊勝。又如三摩地王經"
		,
		/*===========================第 357 頁===========================*/
		"說‧臨命終時隨念諸佛不退失等功德‧若修咒道於本尊瑜伽尤為殊勝‧有如是等眾多義\n"+
		"利。又此勝利及思佛之法‧廣如現在諸佛現住三摩地經所明。又如修次下編所說‧定應了\n"+
		"知‧因恐文繁‧茲不俱錄。故求所緣既能成就勝三摩地‧餘諸勝事兼能獲得‧如是乃為方便\n"+
		"善巧。\n"+
		"　　當以何等如來之像為所緣耶‧答‧如修次下編云‧「諸瑜伽師‧先當如自所見所聞如\n"+
		"來形像安住其心修奢摩他。當常思惟如來身像黃如金色‧相好莊嚴‧處眾會中‧種種方便\n"+
		"利益有情。於佛功德發生願樂‧息滅昏沈掉舉等失‧乃至明見如住面前‧應於爾時勤修靜\n"+
		"慮。」三摩地王經云‧「佛身如金色‧相好最端嚴‧菩薩應緣彼‧心轉修正定。」如此所說而\n"+
		"為所緣。此復有二‧謂由覺新起及於原有令重光顯‧後易生信又順共乘‧故於原有令相明\n"+
		"顯。\n"+
		"　　先求持心所緣處者。謂先當求一若畫若鑄極其善妙大師之像‧數數觀視善取其相‧\n"+
		"數數修習令現於心‧或由尊長善為曉喻‧思所聞義令現意中求為所緣‧又所緣處非是現\n"+
		"為畫鑄等相‧要令現為真佛形相。有說置像於前目睹而修‧智軍論師善為破之‧以三摩地"
		,
		/*===========================第 358 頁===========================*/
		"非於根識而修‧要於意識而修。妙三摩地親所緣境‧即是意識親所緣境‧須於意境攝持心\n"+
		"故。又如前說是緣實境之總義‧或影像故。影像亦有粗細二分‧有說先緣粗分‧待彼堅固次\n"+
		"緣細分‧自心亦覺粗分易現起故‧應先從粗像為所緣境。\n"+
		"　　尤為要者‧謂如下說乃至未得如欲定時‧不可多遷異類所緣修三摩地。若換眾多異\n"+
		"類所緣修三摩地‧反成修止最大障礙。故於修定堪資定量之瑜伽師地論及三編修次等‧\n"+
		"皆說初修定時‧依一所緣而修‧未說遷變眾多所緣。聖勇論師於修靜慮時顯此義云‧「應\n"+
		"於一所緣‧堅固其意志‧若轉多所緣‧意為煩惱擾。」道炬論云‧「隨於一所緣‧令意住善\n"+
		"境。」說「於一」言是指定詞‧故先應緣一所緣境‧待得止已後乃緣多。修次初編云‧「若\n"+
		"時已能攝其作意‧爾時乃能廣緣蘊處界等差別。如解深密等說瑜伽師緣十八空等‧眾多\n"+
		"差別所緣。」\n"+
		"　　如是初得攝心所緣之量‧謂先次第明了攀緣一頭二臂‧身體餘分及二足相‧其後思\n"+
		"惟身之總體。心中若能現起半分粗大支分‧縱無光明應知喜足‧於彼攝心。此中道理‧若以\n"+
		"此許猶不為足而不持心‧欲求明顯數數攀緣‧所緣雖可略為顯了‧然非僅不得妙三摩地"
		,
		/*===========================第 359 頁===========================*/
		"令心安住‧且障得定。又若所緣雖不明顯‧然於半分所緣持心‧亦能速得妙三摩地‧次令明\n"+
		"顯其明易成‧此出智軍論師教授‧極為重要。\n"+
		"　　又所緣境現顯之理‧雖有二種四句之說‧然由補特伽羅種性別故‧種種無定行相現\n"+
		"顯有難有易‧即已現中有明不明‧此二復有堅不堅固。若修密咒天瑜伽時‧天之行相定須\n"+
		"明顯‧乃至未能明顯之時‧須修多種明顯方便。此中佛相若極難現‧於前隨一所緣持心‧以\n"+
		"此主要在得止故。又緣像修‧若像不現任持心者‧不能成辦所樂之義‧故須行相現而持心。\n"+
		"又緣總身像時‧若身一分極其明顯可緣彼分‧若彼復沒仍緣總像‧若欲修黃而現為紅顯\n"+
		"色不定‧或欲修坐而現為立形色不定‧或欲修一而現為二數量不定‧或欲修大而現為小\n"+
		"形體不定‧則定不可隨逐而轉‧唯應於前根本所緣為所緣境。\n"+
		"<b><s>　第二心於彼所緣如何安住分三‧<n>一</n>立無過規‧<n>二</n>破有過規‧<n>三</n>示修時量。　　今初</s></b>\n"+
		"　　此中所修妙三摩地具二殊勝‧一令心明顯具明顯分‧二專住所緣無有分別具安住\n"+
		"分‧有於此上加樂為三‧餘有加澄共為四者。然澄淨分初殊勝攝‧不須別說。適悅行相喜樂\n"+
		"之受‧是此所修定果‧非初靜慮未到分攝定相應中所能生起。三乘功德最勝依處第四靜"
		,
		/*===========================第 360 頁===========================*/
		"慮三摩地中‧皆無身樂心樂相應而起‧故此不說。極明顯分‧雖於無色地攝少數定中亦不\n"+
		"得生。然如莊嚴經論云‧「靜慮除無色。」除少獲得自在菩薩‧餘諸菩薩皆依靜慮地攝正\n"+
		"定引發功德‧故說明顯殊勝無有過失。昏沈能障如是明顯‧掉舉能障無分別住‧沈掉二法\n"+
		"為修淨定障中上首‧亦即此理。故若不識粗細沈掉及雖識已‧不知淨修勝三摩地破彼二\n"+
		"軌‧況云勝觀‧即奢摩他亦難生起‧故智者求三摩地‧於此道理應當善巧。沈掉乃是修止之\n"+
		"違緣‧違緣及破除之方法皆於下說‧故此當說修止順緣引生三摩地之理。\n"+
		"　　此中三摩地者‧謂心專住所緣‧復須於所緣相續而住。此須二種方便‧一於根本所緣\n"+
		"令心不散‧二於已散未散將散不散如實了知‧初即正念次是正知。如莊嚴經論釋云‧「念\n"+
		"與正知是能安住‧一於所緣令心不散‧二心散已能正了知。」若失正念忘緣而散‧於此無\n"+
		"間棄失所緣‧故明記所緣念為根本。由此正念於所緣境住心之理‧謂如前說明觀所緣。若\n"+
		"能現起最下行相‧令心堅持‧令心策舉‧即此而住莫新思擇。念如集論云‧「云何為念‧於串\n"+
		"習事‧心不忘為相‧不散為業。」此說具足三種差別‧一所緣境之差別‧先未習境‧念則不生‧\n"+
		"故說於串習事‧此中即令現起先所決定所緣之相。行相差別者‧謂心不忘‧即心明記其境‧"
		,
		/*===========================第 361 頁===========================*/
		"此中謂不忘所緣。言不忘者‧非因他問或自思察‧僅能記憶師所教示所緣如此‧是須令心\n"+
		"安住所緣‧相續明記無少散動‧能生散亂其念便失‧故於所緣安住心已‧須起是念已住所\n"+
		"緣‧次不更起重新觀察‧相續將護此心勢力‧是修念心最切要處。作業差別者‧謂從所緣心\n"+
		"不餘散‧如是調心令住所緣。如調象喻‧譬如於一堅牢樹柱‧以多堅索繫其狂象‧次調象師\n"+
		"令如教行‧若行者善‧若不行者‧即以利鉤數數治罰而令調伏。如是心如未調之象‧以正念\n"+
		"索縛於前說所緣堅柱‧若不住者‧以正知鉤治罰調伏漸自在轉。如中觀心論云‧「意象不\n"+
		"正行‧當以正念索‧縛所緣堅柱‧慧鉤漸調伏。」修次中編亦云‧「用念知索‧於所緣樹‧繫意\n"+
		"狂象。」前論說正知如鉤‧後論說如索亦不相違‧正能令心於所緣境相續住者是明記念‧\n"+
		"正知間接亦能令心安住所緣‧謂由正知了知沈掉或將沈掉‧依此能不隨沈掉轉‧令住根\n"+
		"本所緣事故。\n"+
		"　　又如世親菩薩亦說‧念知俱能令心住所緣故‧又說依念生定及說記念如索‧正於所\n"+
		"緣相續繫心。故修念之法即修能引三摩地之主因‧念之行相為定知相‧故修定者若無定\n"+
		"知之相‧唯憨然而住‧心縱澄淨然無明顯定知‧有力之念定不得生‧亦未能破微細之沈‧故"
		,
		/*===========================第 362 頁===========================*/
		"三摩地唯有過失。又全不住像等所緣‧唯修無分別心者‧亦須憶念住心教授‧令心於境全\n"+
		"不分別。次則令心不流不散‧令不流散‧義同正念‧明記所緣‧故仍未出修念之規。如彼修者‧\n"+
		"亦須修習具足定知有力之念。\n"+
		"　　第二破有過規。有此邪執是所應破‧謂「若如前說策舉其心無分別住‧雖無少許沈\n"+
		"沒之過‧掉舉增上‧現見不能相續久住‧若低其舉緩其策‧現見住心速能生起。遂謂此方便\n"+
		"是大教授‧發大音聲唱言善緩即是善修。」此是未辨沈修二法差別之論‧以無過定‧須具\n"+
		"前說二種差別‧非唯令心無分別住一分而足。若謂於境令心昏昧可名為沈‧今無彼暗內\n"+
		"心澄淨‧故三摩地全無過失‧此乃未辨昏沈二法差別之言‧下當廣說。故若太策舉雖能明\n"+
		"了‧由掉增上住分難生‧若太緩慢雖有住分‧由沈增上又不明了‧其不墮入太急太緩‧緩急\n"+
		"適中界限難得‧故極難生俱離沈掉妙三摩地。大德月云‧「若精勤修生掉舉‧若捨精勤復\n"+
		"退沒‧此界等轉極難得‧我心擾亂云何修。」精勤修者謂太策舉‧策則生掉‧若捨策勵太緩\n"+
		"慢者‧心住其內復起退沒。義謂俱離沈掉平等安住‧心於此界平等而轉實屬難得。佛靜釋\n"+
		"云‧「言精勤者‧謂於善品發起勇悍‧策勵而轉。」又云‧「由見掉過捨其精勤‧棄其功用心"
		,
		/*===========================第 363 頁===========================*/
		"於內沈。」悔讚又云‧「若勵力轉起掉舉‧若勵緩息生退沒‧修此中道亦難得‧我心擾亂云\n"+
		"何修。」其釋中云‧「若起功用勵力運轉‧便生掉散摧壞其心‧從功用中心不得住‧若如是\n"+
		"行即是過失。為遮此故‧緩息勵力運轉之心‧棄捨功用‧則由忘所緣等之過失‧令心退沒。」\n"+
		"故說遠離沈掉二邊‧修此中界‧平等運轉妙三摩地極屬難得‧若可太緩則無難故。\n"+
		"　　又說從緩發生沈沒‧則以此理修三摩地‧顯然非理。又極緩心僅明澄分‧猶非滿足須\n"+
		"策勵相‧如無著菩薩云‧「於內住等住中‧有力勵運轉作意。」此於九種住心方便‧初二心\n"+
		"時‧作如是說。修次初編云‧「除沈沒者‧當堅持所緣。」修次中編云‧「次息沈沒‧必須令心\n"+
		"明見所緣。」言心明見‧故非說境略明顯。是說心相極顯極堅‧修念之規此為最要。未能知\n"+
		"此盲修之相‧謂修愈久忘念愈重‧擇法之慧日返愚鈍‧有此多過反自矜為有堅固定。\n"+
		"　　若謂如前以念令心住所緣已‧爾時可否分別觀察於所緣境持未持耶‧答定須觀察。\n"+
		"如修次中編云‧「如是於隨樂所緣安住心已‧後即於此等住其心‧善等住已‧即應於心如\n"+
		"是觀察‧為於所緣心善持耶‧為沈沒耶‧為外散耶。」此非棄捨三摩地已‧如是觀察‧是住定\n"+
		"中觀其住否根本所緣‧若未住者‧當觀隨逐沈掉何轉‧非纔住定時太短促亦非太久。是於"
		,
		/*===========================第 364 頁===========================*/
		"中間時時觀照。若於前心未盡勢力‧修此觀察‧能生心力相續久住‧亦能速疾了知沈掉。\n"+
		"　　然能時時憶念所緣而修者‧心須有力相續運轉正念之因‧故應修念。如聲聞地云‧\n"+
		"「云何心一境性‧謂數數隨念‧同分所緣流注無罪適悅相應‧令心相續‧名三摩地亦名為\n"+
		"善心一境性。何等名為數數隨念‧謂於正法聽聞受持‧從師獲得教授教誡‧以此增上‧令其\n"+
		"定地諸相現前‧於此所緣正念流注隨轉安住。」辨中邊論釋云‧「言念能不忘境者‧謂能\n"+
		"不忘住心教授意言之增語。」故修正念為於所緣滅除忘念‧能滅之明記所緣者‧謂所緣\n"+
		"意言即是數數作意所緣‧譬如恐忘所知少義‧數數憶念即難失忘。故若時時憶念所緣‧是\n"+
		"生有力正念所須。於所緣境攝心不散而正觀察‧是生有力能覺沈掉正知方便。若謂此等\n"+
		"皆是分別而遮止者‧應知難生有力正念正知。\n"+
		"　　第三示修時量。由念令心住所緣境‧應住幾久有無定量。答西藏各派諸師皆說‧「時\n"+
		"短數多。」此中因相‧有說「時短樂修中止‧則於下次愛樂修習‧若時長久則覺厭煩。」有\n"+
		"說「時久易隨沈掉增上而轉‧則極難生無過正定。」聲聞地等諸大論中‧未見明說修時\n"+
		"之量‧修次下編云‧「由是次第或一正時‧或半修時‧或一修時‧乃至堪能爾時應修。」此是"
		,
		/*===========================第 365 頁===========================*/
		"已成奢摩他後‧修勝觀時所說時量‧初修止時想亦同此‧應如是行。若能如前修念正知‧時\n"+
		"時憶念觀察所緣‧時雖略久亦無過失。然初業者‧若時長久多生忘念散亂‧爾時其心或沈\n"+
		"或掉‧非經久時不能速知‧或雖未失念‧然亦易隨沈掉而轉‧沈掉生已不能速知。前能障生\n"+
		"有力記念‧後能障生有力正知‧是則沈掉極難斷除。尤以忘失所緣不覺沈掉‧惡於未忘所\n"+
		"緣不能速疾了知沈掉‧故為對治散亂失念‧修念之法極為重要。若忘念重‧正知羸劣‧不能\n"+
		"速疾了知沈掉則須短小‧若不忘念能速了知沈掉之時‧長亦無過。故密意云‧或一時等‧未\n"+
		"說定時‧總以隨心所能‧故云‧「乃至堪能。」又若身心未生疾病即應安住‧有病不應勉強\n"+
		"而修‧無間放捨除治諸界病難乃修‧是諸智者所許‧如是修者應知亦是修時支分。\n"+
		"<b><s>　第三住所緣後應如何修分二‧<n>一</n>有沈掉時應如何修‧<n>二</n>離沈掉時應如何修。　初又分二‧<n>一</n>修習\n"+
		"　對治不知沈掉‧<n>二</n>修習知已為斷彼故對治不勤功用。　初又分二‧<n>一</n>決擇沈掉之相‧<n>二</n>於正修時\n"+
		"　生覺沈掉正知之方便。　　今初</s></b>\n"+
		"　　掉舉如集論云‧「云何掉舉‧淨相隨轉‧貪分所攝‧心不靜照‧障止為業。」此中有三‧一\n"+
		"所緣‧可愛淨境。二行相‧心不寂靜向外流散‧是貪分中趣境愛相。三作業‧能障其心安住所"
		,
		/*===========================第 366 頁===========================*/
		"緣。於內所緣令心住時‧由貪色聲等之掉舉‧於境牽心令不自在‧貪愛散亂。如悔讚云‧「如\n"+
		"緣奢摩他‧令心於彼住‧惑索令離彼‧貪繩牽趣境。」問‧由餘煩惱‧從所緣境令心流散‧及於\n"+
		"所餘善緣流散是否掉舉‧答‧掉是貪分‧由餘煩惱流散非掉‧是二十隨煩惱中散亂心所。於\n"+
		"善緣流散隨其所應‧是善心心所‧非一切散皆是掉舉。\n"+
		"　　沈者亦譯退弱‧與喪心志之退弱不同。於此沈相‧雪山聚中修靜慮者‧多於「安住不\n"+
		"散‧相不明澄之昏昧‧許之為沈。」此不應理。論說昏昧為沈之因‧二各別故。修次中編云‧\n"+
		"「此中若由昏沈睡眠所蔽‧見心沈沒或恐沈沒。」解深密經云‧「若由昏沈及以睡眠‧或\n"+
		"由沈沒‧或由隨一三摩缽底諸隨煩惱之所染污‧當知是名內心散動。」此說由昏沈及睡\n"+
		"眠力令心沈沒‧名內散動故。集論亦於說隨煩惱散亂之時說其沈沒‧然彼說散亂亦有善\n"+
		"性非定染污。昏沈如集論云‧「云何昏沈謂癡分攝‧心無堪能‧與一切煩惱及隨煩惱助伴\n"+
		"為業。」是癡分中身心沈重無堪能性。俱舍論云‧「云何昏沈‧謂身重性及心重性‧即身無\n"+
		"堪能性及心無堪能性。」沈沒謂心於所緣執持力緩或不極明‧故雖澄淨‧若取所緣不極\n"+
		"明顯即是沈沒。修次中編云‧「若時如盲或如有人趣入闇室或如閉目‧其心不能明見所"
		,
		/*===========================第 367 頁===========================*/
		"緣‧應知爾時已成沈沒。」未見餘論明說沈相。沈沒有二‧謂善與無記。昏是不善或有覆無\n"+
		"記‧唯是癡分。諸大經論皆說除遣沈沒‧思佛像等諸可欣境及修光明相策舉其心‧故心闇\n"+
		"境晦及心力低劣‧皆應滅除。雙具所緣明顯與策舉之力‧唯境明顯及唯心澄清非為完足。\n"+
		"掉舉易了‧唯沈沒相諸大經論多未明說故難了知‧然極重要‧以易於彼誤為無過三摩地\n"+
		"故‧應如修次所說從修驗上細心觀察而求認識。\n"+
		"　　於正修時生覺沈掉正知之方便者。非唯了知沈掉便足‧須於修時能生正知‧如實了\n"+
		"知沈沒掉舉生與未生。又須漸生有力正知‧沈掉生已須生無間能知之正知‧固不待言‧即\n"+
		"於未生將生‧亦須正知預為覺了。修次中下編云‧「見心沈沒或恐沈沒‧」又云‧「見心掉\n"+
		"舉或恐掉舉‧」乃至未生如斯正知‧縱自斷言‧從彼至此中無沈掉‧所修無過‧然非實爾‧以\n"+
		"生沈掉不能知故‧有力正知未生起故。如中邊論云‧「覺沈掉‧」覺了沈掉須正知故。若未\n"+
		"生正知‧凡沈掉生必無所覺‧則雖久修不覺沈掉‧必以微細沈掉耗時。\n"+
		"　　正知云何生耶‧答‧前修念法‧即修正知重要一因。以若能生相續憶念‧即能破除忘境\n"+
		"流散‧亦能遮止沈掉生已久而不覺‧故生沈掉極易覺了。又覺失念之沈掉‧與覺未失念之"
		,
		/*===========================第 368 頁===========================*/
		"沈掉‧二時延促觀心極顯。故入行論密意說云‧「住念護意門‧爾時生正知。」辨中邊論釋\n"+
		"云‧「言正知者由念記言‧覺沈掉者‧謂安住念始有正知‧是故說云由念記言。」餘一因者‧\n"+
		"是正知不共修法‧即令心緣佛像等所取之相‧或緣能取明了等相‧次如前說於修念中‧觀\n"+
		"察於餘散與未散‧任持其心‧即修正知極切要處。入行論云‧「數數審觀察身心諸分位‧總\n"+
		"彼彼即是守護正知相。」由此能生沈掉將生了知正知。由修念法‧是遮散後所起忘念‧應\n"+
		"善辨別。若不爾者‧雜一切心全無分別‧如今後人修習而修‧由混亂因‧三摩地果恐亦如是。\n"+
		"故應順大論細慧觀察修驗決擇‧極為重要‧不應唯恃耐勞。如攝波羅蜜多論云‧「獨修精\n"+
		"進自苦邊‧慧伴將護成大利。」\n"+
		"　　第二修習知已為斷彼故對治不勤功用。修習正念正知之法‧若如前說善修習已‧生\n"+
		"起有力正念正知。由正知故‧極細沈掉皆能覺了‧必無不知沈掉之過。然彼生已‧忍受不修\n"+
		"破除功用‧是三摩地最大過失。若心成習難生遠離沈掉之定‧故生沈掉為斷彼故‧對治不\n"+
		"行應修作行功用之思。\n"+
		"<b><s>　此中分二‧<n>一</n>正明其思滅沈掉法‧<n>二</n>明能生沈掉之因。　　今初</s></b>"
		,
		/*===========================第 369 頁===========================*/
		"　　如集論云‧「云何為思‧令心造作意業‧於善不善無記役心為業。」如由磁石增上力\n"+
		"故‧令鐵隨轉‧如是於善不善無記隨一能令心之心所‧是名為思。此中是說生沈掉時‧令心\n"+
		"造作斷彼之思。\n"+
		"　　為斷沈掉發動心已‧復應如何除沈掉耶。心沈沒者‧由太向內攝‧失攀緣力‧故應作意\n"+
		"諸可欣事‧能令心意向外流散‧謂佛像等極殊妙事‧非生煩惱可欣樂法‧又可作意日月光\n"+
		"等諸光明相。沈沒除已‧即應無間堅持所緣而修。如修次初編云‧「若由昏沈睡眠所覆‧所\n"+
		"緣不顯‧心沈沒時應修光明想‧或由作意極可欣事佛功德等‧沈沒除已仍持所緣。」此不\n"+
		"應修厭患所緣‧由厭令心向內攝故。又以觀慧思擇樂思之境‧亦能除沈。攝波羅蜜多論云‧\n"+
		"「由勤修觀力‧退弱而策舉。」沈沒與退弱者‧謂緣所緣力漸低劣說名沈沒‧太向內攝說\n"+
		"名退弱‧故由策舉力及廣所緣即能除遣。中觀心論云‧「退弱應寬廣‧修廣大所緣。」又云‧\n"+
		"「退弱應策舉‧觀精進勝利。」集學論云‧「若意退弱‧應修可欣而令策舉。」諸大智者同\n"+
		"所宣說‧故除沈沒最要之對治‧謂思惟三寶‧及菩提心之勝利‧並得暇身大利等功德‧令如\n"+
		"睡面澆以冷水頓能清醒‧此須先於功德觀擇修習已生感觸。又沈沒所依之因‧謂昏沈睡"
		,
		/*===========================第 370 頁===========================*/
		"眠‧及能生昏睡之心黑闇相‧若修光明則不依彼而生沈沒‧生已滅除。聲聞地說‧「威儀應\n"+
		"經行‧善取明相數修彼相‧及念佛法僧戒捨天六中隨一‧或以所餘清淨所緣策舉其心‧或\n"+
		"當讀誦顯示昏沈睡眠過患之經論‧或瞻方所及月星等‧或以冷水洗面。」若沈微薄‧或唯\n"+
		"少起勵心正修‧若沈濃厚或數現起‧則應暫捨修三摩地‧如其所應修諸對治‧待沈除已後\n"+
		"乃修習。若心所取內外所緣相不明顯‧內心黑暗隨其厚薄‧若不斷除而修習者‧則其沈沒\n"+
		"極難斷除‧故應數數修能對治諸光明相。聲聞地云‧「應以光明俱心‧照了俱心‧明淨俱心‧\n"+
		"無闇俱心‧修習止觀。汝若如是於止觀道修光明想‧設有最初勝解所緣相不分明‧光明微\n"+
		"小‧由數修習為因緣故‧於其所緣勝解分明光明轉大。若有最初行相分明光明廣大‧其後\n"+
		"轉復極其分明光明極大。」此說最初所緣分明者尚須修習‧況不分明。應取何等光明之\n"+
		"相‧即前論云‧「應從燈明‧或大火明‧或從日輪‧取光明相。」如此之修光明相‧非唯限於修\n"+
		"三摩地‧餘亦應修。\n"+
		"　　掉舉者‧由貪為門‧令心追趣色聲等境‧此應作意諸可厭事‧能令心意向內攝錄‧以此\n"+
		"息滅掉舉無間‧於先所緣應住其心。修次初編云‧「若憶先時喜笑等事‧見心掉舉‧爾時應"
		,
		/*===========================第 371 頁===========================*/
		"當作意思惟諸可厭事‧謂無常等由此能令掉舉息滅‧次應勵力令心仍於前所緣境無作\n"+
		"用轉。」中觀心論云‧「思惟無常等‧息滅掉舉心。」又云‧「觀散相過患‧攝錄散亂心。」集\n"+
		"學論云‧「若掉舉時‧應思無常而令息滅。」故掉舉太猛或太延長‧應暫捨正修而修厭離‧\n"+
		"極為切要。非流散時‧唯由攝錄而能安住‧若掉舉無力則由攝錄令住所緣。如攝波羅蜜多\n"+
		"論云‧「若意掉舉時‧以止而遮止。」經中說云‧「心善安住‧」瑜伽釋為掉舉對治。\n"+
		"　　總之若心掉動‧應於所緣善住其心。若沈沒時於可欣境應善策舉‧如聲聞地云‧「由\n"+
		"是其心於內攝略‧若已下劣或恐下劣‧觀見是已‧爾時隨取一種淨妙舉相‧慇懃策勵慶悅\n"+
		"其心‧是名策心。云何持心‧謂修舉時其心掉動‧或恐掉動觀見是已‧爾時還復於內攝略其\n"+
		"心修奢摩他‧是名持心。」心掉動時‧不應作意淨可欣境‧以是向外散動因故。\n"+
		"　　第二明能生沈掉之因者。本地分云‧「何等沈相‧謂不守根門‧食不知量‧初夜後夜不\n"+
		"勤修行覺寤加行‧不正知住‧是癡行性。耽著睡眠‧無巧便慧‧懈怠俱行欲勤心觀‧不曾修習\n"+
		"正奢摩他‧於奢摩他未為純善‧一向思惟奢摩他相‧其心昏闇‧於所緣境不樂攀緣。」沈沒\n"+
		"相者‧應知是說沈沒之因‧懈怠俱行者通勤心觀。又前論云‧「何等掉相‧謂不守根等四如"
		,
		/*===========================第 372 頁===========================*/
		"前廣說‧是貪行性不寂靜性‧無厭離心‧無巧便慧‧太舉俱行欲等如前‧不曾修舉‧於舉未善\n"+
		"唯一向修‧由其隨一隨順掉法親里尋等動亂其心。」掉舉相者‧謂掉舉因。太舉者‧謂於可\n"+
		"欣境太執其心‧與此俱行欲等四法如前廣說。\n"+
		"　　由是前說未修中間防護根門等四‧於滅沈掉極為利益‧沈掉雖微‧皆以正知正覺了\n"+
		"已‧悉不忍受畢竟滅除。若不爾者‧名「不作行。」辨中邊論說是三摩地過。故若有說微細\n"+
		"掉舉及散亂等初時難斷‧捨而不斷。又謂彼等若無猛利恆常相續‧微劣短促不能造業故\n"+
		"不須斷‧為斷彼故而不作行‧此皆不知修習清淨三摩地法‧詐現為知欺求定者‧以捨慈尊\n"+
		"等所決擇修習三摩地之法故。\n"+
		"　　如是滅沈掉時‧多因掉舉散亂為障先勵斷彼‧由此勵力便能止息粗顯掉散‧獲少安\n"+
		"住。爾時應當勵防沈沒‧勵力防慎沈沒之時‧又有較前微細掉動障礙安住‧為斷彼故又應\n"+
		"策勵‧掉退滅已住分轉增‧爾時又有沈沒現起‧故於斷沈又應勵力‧總散掉時應當錄心‧住\n"+
		"內所緣而求住分‧住分生時勵防沈沒令心明了。此二輾轉修習無過勝三摩地‧不應唯於\n"+
		"澄淨住分全無持力俱行明了而起希求。"
		,
		/*===========================第 373 頁===========================*/
		"　　第二離沈掉時應如何修。如前勤修斷除微細沈沒掉舉‧則無沈掉令不平等‧其心便\n"+
		"能平等運轉‧若功用行是修定過‧於此對治應修等捨。修次中編云‧「若時見心俱無沈掉‧\n"+
		"於所緣境心正直住‧爾時應當放緩功用‧修習等捨如欲而住。」何故作行或有功用為過\n"+
		"失耶‧此由於心掉則攝錄‧沈則策舉‧防護修習。有時沈掉俱不現起‧若仍如前防沈防掉策\n"+
		"勵而修‧反令散亂。如修次後二編云‧「心平等轉‧若仍功用‧爾時其心便當散動。」故於爾\n"+
		"時須知放緩‧此是放緩防慎作用‧非是放捨持境之力。故修等捨‧非是一切無沈掉時‧乃是\n"+
		"摧伏沈掉力時‧若未摧伏沈掉勢力無等捨故。\n"+
		"　　云何為捨‧答‧捨總有三‧一受捨二無量捨三行捨‧此是行捨。此捨自性‧如聲聞地云‧\n"+
		"「云何為捨‧謂於所緣心無染污‧心平等性‧於止觀品調柔正直任運轉性‧及調柔心有堪\n"+
		"能性‧令心隨與任運作用。」謂得此捨時修三摩地‧於無沈掉捨現前時‧當住不發太過功\n"+
		"用。此所緣相‧如前論云‧「云何捨相‧謂由所緣令心上捨及於所緣不發所有太精進。」修\n"+
		"捨之時‧亦如彼云‧「云何捨時‧謂止觀品所有沈掉心已解脫。」如是引發無過三摩地法‧\n"+
		"是依慈尊辨中邊論‧如云‧「依住堪能性‧能成一切義‧由滅五過失‧勤修八斷行。懈怠忘聖"
		,
		/*===========================第 374 頁===========================*/
		"言‧及沈沒掉舉‧不作行作行‧是為五過失。即所依能依‧及所因能果‧不忘其所緣‧覺了沈與\n"+
		"掉‧為斷而作行‧滅時正直轉。」其依住者‧謂為除障品發勤精進‧依此而住‧於此能生心堪\n"+
		"能性勝三摩地。此能成辦勝神通等一切義利‧是神變之足或是所依‧故說「能成一切\n"+
		"義。」\n"+
		"　　云何能生此三摩地‧謂為斷除五過失故‧勤修八行從此因生。五過失者‧謂加行時懈\n"+
		"怠為過‧於三摩地不加行故。勤修定時忘失教授是其過失‧若忘所緣心於所緣不能定故‧\n"+
		"已住定時沈掉為過‧彼二令心無堪能故。沈掉生時不作功用是其過失‧以此不能滅二過\n"+
		"故。離沈掉時行思是過‧修次等說沈掉二過合一為五‧若各分別是六過失。對治此等為八\n"+
		"斷行‧對治懈怠有四‧謂信欲勤安‧對治忘念沈掉不作行作行‧如其次第謂念‧覺了沈掉之\n"+
		"正知‧作行之思‧正住之捨‧廣說如前。此即修定第一教授‧故蓮花戒論師於三編修次及餘\n"+
		"印度諸大論師‧於修定時皆數宣說。道炬論釋於修止時亦引宣說‧道次先覺亦皆說其粗\n"+
		"概次第‧然見樂修定者‧猶未了知應如何修‧故廣決擇。此乃一切以念正知遠離沈掉修三\n"+
		"摩地心一境性共同教授‧不應執此是相乘別法‧非咒所須‧無上瑜伽續中亦說是所共故。"
		,
		/*===========================第 375 頁===========================*/
		"如三補止初章第二品云‧「斷行俱行欲三摩地神足‧謂住遠離‧住於離欲‧住於滅盡‧由正\n"+
		"斷成‧由彼欲故而正修習‧非極下劣及太高舉。」於勤觀心三三摩地亦如是說‧前說正定\n"+
		"妙堪能性‧是神變等功德所依‧猶如足故名為神足。辨中邊論釋等說成此定略有四門‧謂\n"+
		"由猛利欲樂所得及由恆常精進所得。由觀擇境得三摩地‧名欲三摩地‧進三摩地‧觀三摩\n"+
		"地。若心宿有三摩地種‧依彼而得心一境性‧名心三摩地。極下劣者謂太緩慢‧太高舉者謂\n"+
		"太策勵‧義為離彼二邊而修。\n"+
		"<b>菩提道次第廣論卷十五終</b>"
		,
		/*===========================第 376 頁===========================*/
		"<b>菩提道次第廣論卷十六</b>\n"+
		"<b><s>　第二依彼引生住心次第分三‧<n>一</n>正明引生住心次第‧<n>二</n>由六力成辦‧<n>三</n>具四種作意。　　今初</s></b>\n"+
		"　　初中九心。一內住者‧謂從一切外所緣境攝錄其心‧令其攀緣內所緣境‧莊嚴經論云‧\n"+
		"「心住內所緣。」二續住者‧謂初所繫心令不散亂‧即於所緣相續而住‧如云‧「其流令不\n"+
		"散。」三安住者‧謂由忘念向外散時‧速知散已‧還復安置前所緣境‧如云‧「散亂速覺了‧還\n"+
		"安住所緣。」四近住者‧修次初編說‧前安住心是知散斷除‧此近住心是散亂斷已‧勵力令\n"+
		"心住前所緣。般若波羅蜜多教授論說‧從廣大境數攝其心‧令性漸細上上而住‧如云‧「具\n"+
		"慧上上轉‧於內攝其心。」聲聞地說‧「先應念住‧不令其心於外散動。」謂起念力‧令不忘\n"+
		"念於外散動。五調伏者‧謂由思惟正定功德‧令於正定心生欣悅‧如云‧「次見功德故‧於定\n"+
		"心調伏。」聲聞地說‧由色等五境及三毒男女隨一之相‧令心散動‧先應於彼取其過患‧莫\n"+
		"由十相令心流散。六寂靜者‧謂於散亂觀其過失‧於三摩地止息不喜‧如云‧「觀散亂過故‧\n"+
		"止息不欣喜。」聲聞地說‧由欲尋思等諸惡尋思‧及貪欲蓋等諸隨煩惱能擾亂心‧先應於"
		,
		/*===========================第 377 頁===========================*/
		"彼取其過患‧於諸尋思及隨煩惱不令流散。七最極寂靜者‧謂若生貪心憂慼昏沈睡眠等\n"+
		"時‧能極寂靜‧如云‧「貪心憂等起‧應如是寂靜。」聲聞地說‧由失念故‧若起如前所說尋思\n"+
		"及隨煩惱‧隨生尋斷‧能不忍受。八專注一境者‧為令任運轉故而正策勵‧如云‧「次勤律儀\n"+
		"者‧由心有作行‧能得任運轉。」又如聲聞地云‧「由有作行令無缺間‧於三摩地相續而住‧\n"+
		"如是名為專注一趣。」第八心名專注一趣‧即由此名易了其義。九平等住者‧修次中說‧心\n"+
		"平等時當修等捨。般若波羅蜜多教授論說‧由修專注一趣‧能得自在任運而轉。如論云‧\n"+
		"「從修習不行‧」聲聞地說名等持。如云‧「數修數習‧數多修習為因緣故‧得無功用任運\n"+
		"轉道‧由是因緣‧不由加行不由功用‧心三摩地任運相續‧無散亂轉故名等持。」此中九心\n"+
		"之名‧是如修次初編所引‧如云‧「此奢摩他道‧是從般若波羅蜜多等所說。」\n"+
		"　　第二由六力成辦。力有六種‧一聽聞力‧二思惟力‧三憶念力‧四正知力‧五精進力‧六串\n"+
		"習力。此等能成何心者‧一由聽聞力成內住心‧謂唯隨順從他所聞‧於所緣境住心教授‧最\n"+
		"初令心安住內境‧非自數思數修習故。由思惟力成續住心‧謂於所緣先所住心‧由數思惟\n"+
		"將護修習‧初得少分相續住故。由憶念力成辦安住近住二心‧謂從所緣向外散時‧憶先所"
		,
		/*===========================第 378 頁===========================*/
		"緣於內攝錄‧又從最初生憶念力‧從所緣境不令散故。由正知力成辦調伏寂靜二心‧謂由\n"+
		"正知了知諸相諸惡尋思及隨煩惱流散過患‧令於彼等不流散故。由精進力成辦最極寂\n"+
		"靜專注一趣‧雖生微細諸惡尋思及隨煩惱‧亦起功用斷滅不忍‧由此因緣‧其沈掉等不能\n"+
		"障礙妙三摩地‧定相續生。由串習力成等住心‧謂於前心極串習力‧生無功用任運而轉三\n"+
		"摩地故。此等是如聲聞地意‧雖見餘處亦作餘說‧然難憑信。\n"+
		"　　若得第九住心‧譬如讀書至極串熟‧最初發起欲誦之心‧雖於中間心往餘散‧然所讀\n"+
		"誦任運不斷‧如是初念於所緣境‧令心住已‧次雖未能一類相續依念正知‧然三摩地能無\n"+
		"間缺長時流轉‧由其不須功用相續恆依念知‧故名無加行或名無功用。能生此者‧先須一\n"+
		"類功用依念正知‧令沈掉等諸障品法不能障礙‧生三摩地經極長時‧此即第八住心‧此與\n"+
		"第九雖沈掉等三摩地障‧不能為障‧二心相同。然於此心必須無間依念正知‧故名有行或\n"+
		"有功用。能生此者‧須於微細沈掉等法‧隨生隨除而不忍受‧故須第七心。生第七心‧須先了\n"+
		"知諸惡尋思及隨煩惱散亂過患‧由有力正知於彼等上觀察令不流散‧故須第五及第六\n"+
		"心‧此二即是有力正知所成辦故。能生此者‧須於散失所緣境時‧速憶所緣及須最初從所"
		,
		/*===========================第 379 頁===========================*/
		"緣境念不令散‧故須第三及第四心‧以此二心即彼二念所成辦故。又生此者‧須先令心安\n"+
		"住所緣及令住已相續不散‧故應先生初二種心。\n"+
		"　　如是總謂‧先應隨逐所聞教授‧善令心住。次如所住數數思惟‧令略相續將護流轉。次\n"+
		"若失念心散亂時速應攝錄‧忘所緣境速應憶念‧次更生起有力正念‧於所緣境初不令散。\n"+
		"若已成辦有力憶念‧又當生起猛利正知‧觀沈掉等能從所緣散亂過失。次當起功用力‧雖\n"+
		"由微細失念而散‧亦能無間了知斷截。既斷除已‧令諸障品不能為障‧定漸延長。若生此心\n"+
		"策勵修習得修自在‧即能成辦第九住心‧無諸功用勝三摩地。是故未得第九心前‧修瑜伽\n"+
		"師須施功用‧於三摩地安住其心‧得九心已雖不特於住心功用‧然心亦能任運入定。雖得\n"+
		"如是第九住心‧若未得輕安‧如下所說尚不立為得奢摩他‧何況能得毘缽舍那。然得此定‧\n"+
		"有無分別安樂光明而嚴飾者‧誤為已生根本後得共相合糅無分別智。尤有眾多於聲聞\n"+
		"地所說第九住心‧誤為已生無上瑜伽之圓滿次第者‧下當廣說。\n"+
		"　　第三具四種作意。如聲聞地云‧「即於如是九種心住‧當知復有四種作意‧一力勵運\n"+
		"轉‧二有間缺運轉‧三無間缺運轉‧四無功用運轉。於內住等住中‧有力勵運轉作意‧於安住"
		,
		/*===========================第 380 頁===========================*/
		"近住調伏寂靜最極寂靜中‧有有間缺運轉作意‧於專注一趣中有無間缺運轉作意‧於等\n"+
		"持中‧有無功用運轉作意。」此說初二心時‧須勤策勵‧故有力勵運轉作意。次五心時‧由昏\n"+
		"沈掉舉故‧中有間缺不能久修‧故有有間缺運轉作意。第八心時‧昏沈掉舉不能為障‧能長\n"+
		"時修‧故有無間缺運轉作意。第九心時既無間缺‧又不恆常勤依功用‧故有無功用運轉作\n"+
		"意。\n"+
		"　　若爾初二心時‧亦有有間缺運轉‧中五心時亦須力勵‧云何初二不說有間缺運轉作\n"+
		"意‧於中五心不說力勵運轉作意。答‧初二心中心入不入定‧後者極長‧中間五心住定時長‧\n"+
		"故於後者就三摩地障礙立名‧前者不爾。故雖俱有力勵運轉‧然間缺運轉有無不同‧故於\n"+
		"力勵運轉作意‧未說中間五心。如是住前所說資糧‧恆依精進修三摩地‧乃能成辦正奢摩\n"+
		"他。若略修習一次二次‧還復棄捨所修加行‧必不能成‧如攝波羅蜜多論云‧「由無間瑜伽‧\n"+
		"精勤修靜慮‧如數數休息‧鑽木不出火‧瑜伽亦如是‧未得勝勿捨。」\n"+
		"<b><s>　由修成辦奢摩他量分三‧<n>一</n>顯示奢摩他成與未成之界限‧<n>二</n>顯示依奢摩他趣總道軌‧<n>三</n>顯示\n"+
		"　別趣世間道軌。　初又分二‧<n>一</n>顯示正義‧<n>二</n>有作意相及斷疑。　　今初</s></b>"
		,
		/*===========================第 381 頁===========================*/
		"　　若善了知如前所說修定之軌而正修習‧則九住心如次得生。第九心時‧能盡遠離微\n"+
		"細沈掉‧長時修習‧此又不待策勵功用‧相續依止正念正知‧而三摩地能任運轉‧是否已得\n"+
		"奢摩他耶。茲當解釋‧得此定者‧有得未得輕安二類。若未得輕安‧是奢摩他隨順‧非真奢摩\n"+
		"他‧名奢摩他隨順作意。如解深密經云‧「世尊‧若諸菩薩緣心為境內思惟心‧乃至未得身\n"+
		"心輕安‧於此中間所有作意‧當名何等。慈氏‧非奢摩他‧是名隨順奢摩他勝解相應作意。」\n"+
		"莊嚴經論云‧「由習無作行‧次獲得圓滿‧身心妙輕安‧名為有作意。」此說作意即奢摩他‧\n"+
		"聲聞地文至下當說。修次中編云‧「如是修習奢摩他者‧若時生起身心輕安‧如其所欲‧心\n"+
		"於所緣獲得自在‧應知爾時生奢摩他。」此說須具二事‧謂於所緣得自在住及發輕安‧故\n"+
		"修次初編說‧「若時於所緣境不用加行‧乃至如欲心任運轉‧爾時應知是奢摩他圓滿。」\n"+
		"意在已得輕安‧修次中編顯了說故。又辨中邊論說‧八斷行中之捨與此第九心同一宗要‧\n"+
		"但此非足‧彼論亦說須輕安故。般若波羅蜜多教授論云‧「如是菩薩獨處空閒‧如所思義\n"+
		"作意思惟‧捨離意言‧於心所現多數思惟‧乃至未生身心輕安‧是奢摩他隨順作意‧若時生\n"+
		"起‧爾時即是正奢摩他。」此說極顯‧此等一切皆是決擇深密經義。"
		,
		/*===========================第 382 頁===========================*/
		"　　若爾未生輕安以前‧此三摩地何地攝耶。答‧此三摩地欲界地攝‧三界九地隨一所攝‧\n"+
		"而非第一靜慮近分以上定故。又得近分‧決定已得奢摩他故‧於欲地中雖有如此勝三摩\n"+
		"地‧然仍說是非等引地‧而不立為等引地者‧以非無悔歡喜妙樂輕安所引故。如本地分云‧\n"+
		"「何故唯於此等名等引地‧非於欲界心一境性‧謂此等定‧是由無悔歡喜輕安妙樂所引‧\n"+
		"欲界不爾‧非欲界中於法全無審正觀察。」由是因緣未得輕安‧雖三摩地不須一類依止\n"+
		"正念‧能無分別心任運轉‧復能合糅行住坐臥一切威儀‧然是欲界心一境性‧應當了知不\n"+
		"能立為真奢摩他。\n"+
		"　　若爾云何能得輕安‧得輕安已云何而能成奢摩他。答‧應知輕安如集論云‧「云何輕\n"+
		"安‧謂止息身心粗重‧身心堪能性‧除遣一切障礙為業。」身心粗重者‧謂其身心‧於修善行‧\n"+
		"無有堪能隨所欲轉‧能對治此身心輕安者‧由離身心二種粗重‧則其身心於善事轉極有\n"+
		"堪能。又能障礙樂斷煩惱‧煩惱品攝內身粗重。若勤功用斷煩惱時‧其身重等不堪能性‧皆\n"+
		"得遣除‧身獲輕利‧名身堪能。如是能障樂斷煩惱‧煩惱品攝內心粗重‧若勤功用斷煩惱時‧\n"+
		"愛樂運轉攀緣善境‧不堪能性皆得遣除‧心於所緣運轉無滯‧名心堪能。如安慧論師云‧"
		,
		/*===========================第 383 頁===========================*/
		"「身堪能者‧謂於身所作事輕利生起。心堪能者‧謂趣正思惟‧令心適悅輕利之因心所有\n"+
		"法‧由此相應於所緣境無滯運轉‧是故名為心堪能性。」總略應知‧若得輕安‧於斷煩惱起\n"+
		"功用欲‧如行難行‧恆常畏怯身心難轉不堪能性皆得遣除‧身心最極調柔隨轉。如是身心\n"+
		"圓滿堪能‧是從初得三摩地時‧便有微劣少分現起‧次漸增長‧至於最後而成輕安‧心一境\n"+
		"性妙奢摩他。又初微時難可覺了‧後乃易知‧如聲聞地云‧「先發如是正加行時‧若心輕安\n"+
		"若身輕安‧身心調柔微細而轉‧難可覺了。」又云‧「即前所有心一境性‧身心輕安漸更增\n"+
		"長‧由此因果輾轉道理‧而能引發強盛易了心一境性身心輕安。」將發如是眾相圓滿易\n"+
		"了輕安‧所有前相‧謂勤修定補特伽羅‧於其頂上似重而起‧然其重相非不安樂。此生無間‧\n"+
		"即能遠離障礙樂斷諸煩惱品心粗重性‧即先生起能對治彼心輕安性。如聲聞地云‧「若\n"+
		"於爾時不久當起強盛易了心一境性身心輕安‧所有前相‧於其頂上似重而起非損惱相‧\n"+
		"此起無間能障樂斷諸煩惱品心粗重性皆得除滅‧能對治彼心調柔性心輕安性皆得生\n"+
		"起。」次依內心調柔輕安生起力故‧有能引發身輕安因風入身中‧由此風大遍全身分‧身\n"+
		"粗重性皆得遠離‧諸能對治身粗重性‧身輕安性即能生起。此亦由其調柔風力‧遍一切身"
		,
		/*===========================第 384 頁===========================*/
		"狀似滿溢。如聲聞地云‧「由此生故有能隨順起身輕安‧諸風大種來入身中‧由此大種於\n"+
		"身轉時‧能障樂斷諸煩惱品身粗重性‧皆得遣除。能對治彼身輕安性‧遍滿身中狀如滿\n"+
		"溢。」此身輕安謂極悅意內身觸塵‧非心所法‧如安慧論師云‧「歡喜攝持身內妙觸‧應當\n"+
		"了知是身輕安。契經中說‧意歡喜時身輕安故。」此身輕安最初生時‧由風力故身中現起\n"+
		"最極安樂‧由此因緣心中喜樂轉更勝妙‧輕安初勢漸趣微細‧然非輕安一切永盡‧是初強\n"+
		"盛太動其心‧彼漸退已‧如影隨形有妙輕安無諸散動與三摩地隨順而起。心踊躍性亦漸\n"+
		"退減‧心於所緣堅固而住‧遠離喜動不寂靜性乃為獲得正奢摩他。聲聞地云‧「彼初起時‧\n"+
		"令心踊躍令心悅豫‧歡喜俱行令心喜樂‧所緣境界於心中現‧從此已後彼初所起輕安勢\n"+
		"力漸漸舒緩‧有妙輕安隨身而轉‧心踊躍性漸次退減‧由奢摩他所攝持故‧心於所緣相寂\n"+
		"靜轉。」如是生已‧或名得奢摩他‧或名有作意‧始得墮在有作意數。以得第一靜慮近分所\n"+
		"攝正奢摩他‧乃得定地最下作意故。如聲聞地云‧「從是已後‧其初發業修瑜伽師名有作\n"+
		"意‧始得墮在有作意數。何以故‧由此最初獲得色界定地所攝少作意故‧由此因緣名有作\n"+
		"意。」言定地者‧是上二界地之異名。"
		,
		/*===========================第 385 頁===========================*/
		"　　第二分二。初有作意相‧具何相狀能令自他了知是為已得作意‧謂由獲得如是作意‧\n"+
		"則得色地所攝少分定心‧身心輕安心一境性‧有力能修粗靜相道‧或諦相道淨治煩惱‧內\n"+
		"暫持心身心輕安疾疾生起。欲等五蓋多不現行‧從定起時亦有少分身心輕安隨順而轉。\n"+
		"如聲聞地云‧「得此作意初修業者‧有是相狀‧謂已得色界少分定心‧已得少分身心輕安\n"+
		"心一境性‧有力有能善修淨惑所緣加行‧其心相續滋潤而轉‧為奢摩他之所攝護。」又云‧\n"+
		"「於內正住暫持其心‧身心輕安疾疾生起‧不極為諸身粗重性之所逼惱‧不極數起諸蓋\n"+
		"現行。」又云‧「雖從定起出外經行‧而有少分輕安餘勢隨身心轉。如是等類‧當知是名有\n"+
		"作意者清淨相狀。」由得具足如是相狀作意力故‧奢摩他道極易清淨‧謂由奢摩他心一\n"+
		"境性住定之後‧速能引起身心輕安。輕安轉增‧如彼輕安增長之量‧便增爾許心一境性妙\n"+
		"奢摩他‧互相輾轉能增長故。如聲聞地云‧「如如增長身心輕安‧如是如是於所緣境心一\n"+
		"境性‧轉得增長。如如增長心一境性‧如是如是轉復增長身心輕安。心一境性及以輕安‧如\n"+
		"是二法輾轉相依輾轉相屬。」總之若心得堪能者‧風心同轉‧故風亦堪能‧爾時其身‧便起\n"+
		"微妙殊勝輕安。此若生起‧心上便生勝三摩地‧復由此故‧其風成辦殊勝堪能‧故能引發身"
		,
		/*===========================第 386 頁===========================*/
		"心輕安‧仍如前說。\n"+
		"　　第二斷疑者。如是前說第九心時‧不須策勵勤加功用‧心任運轉趣三摩地無諸分別‧\n"+
		"又盡滅除微細沈沒‧具明顯力。又如前身輕安時說‧由其風大堪能力故‧能與身心勝妙安\n"+
		"樂。此三摩地又如前於相狀時說‧貪欲等蓋諸隨煩惱多不現行‧雖從定起不離輕安。若生\n"+
		"具此功德之定‧於五道中立為何道。答‧若生如是妙三摩地‧昔及現在總有多人立為入大\n"+
		"乘道‧尤由隨順生輕安風‧一切身中安樂充滿‧依此身心起大調適。此又具足無諸分別最\n"+
		"極明顯二種殊勝‧故許為無上瑜伽中備諸德相圓滿次第微妙瑜伽。然依慈尊無著等諸\n"+
		"大教典及中觀修次等‧明顯開示修定次第‧定量諸論而觀察之‧此三摩地尚未能入小乘\n"+
		"之道‧何況大乘。聲聞地說‧即修根本第一靜慮觀粗靜相諸世間道‧皆依此定而引發故。外\n"+
		"道諸仙由世間道‧於無所有以下諸地能離欲者‧皆須依此而趣上地。是故此定是內外道\n"+
		"二所共同。或無顛倒達無我見及善覺了三有過失‧厭離生死希求解脫‧由出離心所攝持\n"+
		"者‧是解脫道。若菩提心之所攝持‧亦能轉成大乘之道。如與畜生一摶之食‧所行布施及護\n"+
		"一戒‧若由彼二意樂攝持‧如其次第‧便成解脫及一切智道之資糧。然今非觀察‧由餘道攝"
		,
		/*===========================第 387 頁===========================*/
		"持趣與不趣能證解脫及一切種智道‧是就此定自性觀察為趣何道。又中觀師與唯識師\n"+
		"決擇毘缽舍那所觀境時‧雖有不同‧然總明止觀及於相續生彼證德全無不合。故無著菩\n"+
		"薩‧於菩薩地及攝決擇分集論聲聞地中別分止觀二中‧若修止者說由九心次第引發。此\n"+
		"復於聲聞地決擇最廣‧然不許彼定‧即是修毘缽舍那法。故諸論中離九住心‧別說修毘缽\n"+
		"舍那法‧聲聞地亦別說修觀法故。如是中觀修次及般若波羅蜜多教授論等‧亦以九心為\n"+
		"奢摩他道‧別說毘缽舍那道。慈氏五論所說諸義‧除無著菩薩所解之外更無所餘。故於此\n"+
		"事‧一切大轍同一意趣。\n"+
		"　　若謂聲聞地所說者‧雖有安樂明顯‧然無甚深無分別相‧唯是寂止‧若有無分別即空\n"+
		"三摩地。所言甚深無分別者‧深義云何‧為由觀慧正見決定‧次於其上無分別住耶‧抑不思\n"+
		"擇無分別住耶。初者吾等亦許如此即是空三摩地。若汝許此‧則應分別有無實性見解二\n"+
		"類‧若有彼見補特伽羅‧次住見上修無分別‧是修甚深空三摩地。若無彼見補特伽羅‧唯不\n"+
		"分別而修‧則非修習甚深空性。理應如是分別宣說‧不應宣說凡無思惟一切癡修皆是無\n"+
		"緣‧或於無相或於空性修靜慮師。若謂無論有無了悟空性正見‧但若心無分別‧全不思擇‧"
		,
		/*===========================第 388 頁===========================*/
		"一切止修皆是空定‧則前所引聲聞地說奢摩他品諸三摩地‧雖非所欲亦應許為空三摩\n"+
		"地‧由彼定時除念正知勢力微時‧略起觀察。餘時全不略起分別‧謂此是此非‧故諸能引正\n"+
		"奢摩他妙三摩地。解深密經說緣無分別影像‧聲聞地亦云‧「彼於爾時成無分別影像所\n"+
		"緣‧即於如是所緣影像‧一向一趣安住正念‧不復觀察‧不復思擇‧不極思擇‧不遍尋思‧不遍\n"+
		"伺察。」止觀二中於奢摩他‧作是說故。聲聞地又云‧「又若汝心雖得寂止‧由失念故及由\n"+
		"串習諸相尋思‧隨煩惱等諸過失故‧如鏡中面所緣影像數現在前‧隨所生起‧即更當修不\n"+
		"念作意‧謂先所見諸過患相增上力故‧即於如是所緣境像‧由所修習不念作意‧除遣散滅‧\n"+
		"當令畢竟不現在前。」此亦是於修止時說。諸定量論皆說修奢摩他時‧不觀察修‧唯安住\n"+
		"修‧故許一切不分別修‧皆是修空‧實為智者所應笑處‧尤其說修不念作意皆是修空‧聲聞\n"+
		"地文善為破除。又修次初編云‧「奢摩他自性者‧唯是心一境性‧故此即是一切奢摩他總\n"+
		"相。」慧度教授論云‧「應當遠離緣慮種種心相意言‧修奢摩他。」意言者謂分別此是此\n"+
		"等。又寶雲經說‧奢摩他是心一境性‧已引如是眾多經論‧曾經多次說奢摩他全無分別。故\n"+
		"無分別略有二種‧謂修空無分別及於空性全未悟解諸無分別‧故不應執凡有一切安樂"
		,
		/*===========================第 389 頁===========================*/
		"明顯無分別者‧皆是修空。此等乃是略示方隅‧應善策勵了知慈尊及無著等所解‧修止觀\n"+
		"法。若不爾者‧尚未得止‧便於少分無分別定‧誤為能斷三有根本毘缽舍那。於此起慢‧謂修\n"+
		"無緣‧空度時日‧定欺自他。定量智者所造論中‧說於新修奢摩他時‧唯應止修無分別住‧初\n"+
		"修觀時‧以觀察慧思擇而修。若執一切分別‧皆是實執‧捨此一切‧即違一切定量經論。未得\n"+
		"無謬無我正見‧凡無分別‧皆說是修甚深空義毘缽舍那‧純粹支那堪布修法‧細觀三編修\n"+
		"次第中自當了知。\n"+
		"　　第二顯示依奢摩他趣總道軌。如是已得如前所說無分別三摩地作意‧又有明顯無\n"+
		"分別等殊勝差別‧唯應修此無分別耶。答於相續中引發如此妙三摩地‧是為引生能斷煩\n"+
		"惱毘缽舍那。若不依此‧令生毘缽舍那‧任如何修此三摩地‧尚不能斷欲界煩惱‧況能盡斷\n"+
		"一切煩惱‧故當更修毘缽舍那。此復有二‧一能暫伏煩惱現行‧趣世間道毘缽舍那。二能永\n"+
		"斷煩惱種子‧趣出世道毘缽舍那。除此更無上進方便‧如聲聞地云‧「已得作意諸瑜伽師‧\n"+
		"已入如是少分樂斷‧從此已後唯有二趣更無所餘。何等為二‧一者世間‧二出世間。」如是\n"+
		"已得正奢摩他‧或作意者‧或欲修習世間道毘缽舍那‧或欲修出世道毘缽舍那‧皆於先得"
		,
		/*===========================第 390 頁===========================*/
		"奢摩他道應多修習。如是修故‧所有輕安心一境性皆得增長‧其奢摩他亦極堅固。又應善\n"+
		"巧止觀眾相‧後於二道隨樂何往‧即於彼道發起加行。如聲聞地云‧「彼初修業諸瑜伽師‧\n"+
		"由有作意‧或念我當往世間趣‧或念我當往出世趣。復多修習如是作意‧如如於此極多修\n"+
		"習‧如是如是所有輕安心一境性。經歷彼彼日夜等位轉復增廣。若此作意堅固相續‧強盛\n"+
		"而轉‧發起清淨所緣勝解‧於止觀品善取其相‧彼於爾時或世間道或出世道‧隨所樂往‧即\n"+
		"當於彼發起加行。」其中世間毘缽舍那修粗靜相‧謂觀下地粗性上地靜性。其出世間毘\n"+
		"缽舍那‧聲聞地所說者‧謂於四諦觀無常等十六行相‧主要通達補特伽羅無我正見。\n"+
		"　　若得前說奢摩他作意‧有幾種補特伽羅‧於現法中不趣出世道而趣世間道。如聲聞\n"+
		"地云‧「問‧此中幾種補特伽羅‧即於現法樂往世間道非出世道。答‧略有四種一一切外道‧\n"+
		"二於正法中根性鈍劣先修止行‧三根性雖利善根未熟‧四一切菩薩樂當來世證大菩提\n"+
		"非於現法。」外道瑜伽師一切得如前說奢摩他者‧然於無我無觀察慧觀擇而修‧彼於無\n"+
		"我不信解故‧或唯修此無分別止‧或更進修粗靜行相毘缽舍那‧故唯能往世間之道。又正\n"+
		"法中佛諸弟子‧若是鈍根於奢摩他先多修習‧故不樂修於無我義觀慧思擇‧或雖樂修‧然"
		,
		/*===========================第 391 頁===========================*/
		"不能了真無我義‧故於現法亦唯能往世間之道‧以唯修住分‧或唯能修粗靜行相毘缽舍\n"+
		"那故。又諸利根佛弟子眾‧雖能悟解真無我義‧若諦現觀善根未熟‧則於現法亦不能生諸\n"+
		"出世間無漏聖道‧故名唯往世間道‧非緣無我不能修習毘缽舍那。又菩薩成佛‧雖一生補\n"+
		"處亦必來世‧於最後有從加行道四道俱生‧於一生補處時聖道不起‧故於現法唯往世間\n"+
		"道‧非未通達真無我義。如俱舍論云‧「佛麟喻菩提‧依邊定一坐‧前順解脫分。」此順小乘\n"+
		"教成佛道理‧非無著菩薩自許如是。由是外道修粗靜相道伏煩惱現行‧內佛弟子修無我\n"+
		"義斷煩惱根本‧皆須先得如前所說奢摩他定。故前所說此奢摩他‧是內外道諸瑜伽師伏\n"+
		"斷煩惱所依根本。\n"+
		"　　又大小乘諸瑜伽師亦皆須修此三摩地‧即大乘中若顯密乘諸瑜伽師‧一切皆須修\n"+
		"奢摩他‧故此奢摩他是一切修觀行者‧共所行道最要根本。又咒教所說奢摩他‧唯除少分\n"+
		"所緣差別‧謂緣形像或緣三昧耶相‧或種子字等‧及除少分生定方便差別而外‧其斷懈怠\n"+
		"等三摩地五種過失‧及能對治依止正念及正知等。其次獲得第九住心‧從此引發妙輕安\n"+
		"等‧一切皆共。此三摩地極其寬廣‧故解深密經密意宣說‧大乘小乘一切等持‧皆是止觀三"
		,
		/*===========================第 392 頁===========================*/
		"摩地攝。故欲善巧諸三摩地‧應當善巧止觀二法。\n"+
		"　　生此三摩地奢摩他作意‧義雖多種‧然主要者是為引發毘缽舍那之證德。毘缽舍那\n"+
		"又有二種‧一內外大小乘所共‧能暫伏煩惱現行粗靜行相毘缽舍那‧二唯佛弟子內道別\n"+
		"法‧畢竟斷除煩惱種子‧修習無我真實行相毘缽舍那。前是圓滿支分‧非必不可少‧後是必\n"+
		"不可少之支。故求解脫者‧應生能證無我真實毘缽舍那。以若得前說第一靜慮未到地攝\n"+
		"正奢摩他‧縱未獲得以上靜慮及無色奢摩他‧然即依彼止修習勝觀‧亦能脫離一切生死\n"+
		"繫縛而得解脫。若未通達未能修習無我真實‧僅由前說正奢摩他‧及依彼所發世間毘缽\n"+
		"舍那‧斷無所有下一切現行煩惱得有頂心‧然終不能脫離生死。如讚應讚論中讚置答云‧\n"+
		"「未入佛正法‧癡盲諸眾生‧乃至上有頂‧仍苦感三有。若隨佛教行‧雖未得本定‧諸魔勤看\n"+
		"守‧而能斷三有。」故預流一來‧一切能得聖道毘缽舍那所依之奢摩他‧即前所說第一靜\n"+
		"慮近分所攝正奢摩他。如是當知一切頓證諸阿羅漢‧皆依前說正奢摩他而勤修習毘缽\n"+
		"舍那證阿羅漢‧故若身中未得前說奢摩他定‧必不得生緣如所有或盡所有毘缽舍那真\n"+
		"實證德‧后當廣說。故修無上瑜伽觀行師‧雖不必生緣所有粗靜行相毘缽舍那‧及彼所引"
		,
		/*===========================第 393 頁===========================*/
		"正奢摩他‧然必須生一正奢摩他。初生之時‧亦是生起圓滿二次第中初次第時生。總應先\n"+
		"生正奢摩他‧次即依彼或由粗靜行相毘缽舍那‧漸進諸道乃至有頂‧或由無我真實行相\n"+
		"毘缽舍那‧漸行五道而趣解脫或一切智‧是佛教中總印所印。故隨修何種瑜伽皆不應違\n"+
		"越‧是謂總顯依奢摩他趣上道軌。\n"+
		"<b><s>　第三顯示別趣世間道軌分二‧<n>一</n>顯往粗靜相道先須獲得正奢摩他‧<n>二</n>依奢摩他離欲之理。\n"+
		"　　　今初</s></b>\n"+
		"　　由了相門修粗靜相道‧須得前說正奢摩他‧如莊嚴經論云‧「由此令彼增‧由增極遠\n"+
		"行‧而得根本住。」謂得前說第九住心及諸輕安‧由此增長彼三摩地‧依此引發根本靜慮。\n"+
		"又從第九心乃至未得作意時‧說名作意初修業者。從得作意‧為淨煩惱修習了相作意時‧\n"+
		"名淨煩惱初修業者。故修了相是先已得作意‧如聲聞地云‧「云何作意初修業者‧謂專注\n"+
		"一緣勤修作意‧乃至未得所作作意‧未能觸證心一境性‧是名作意初修業者。云何淨煩惱\n"+
		"初修業者‧謂已證得所修作意‧於諸煩惱欲淨其心‧發起攝受正勤修習了相作意。」第四\n"+
		"瑜伽卷首亦說已得作意‧次修世間及出世間離欲道故。又先具足如前所說正奢摩他‧次"
		,
		/*===========================第 394 頁===========================*/
		"修世間及出世間毘缽舍那‧暫伏永斷煩惱之理‧於餘對法論中未見明顯如此廣說。故昔\n"+
		"善巧大小對法諸先覺等‧於此先修專住一緣正奢摩他及依此故‧暫伏永斷煩惱之理皆\n"+
		"未能顯。若未善解聲聞地義‧便覺靜慮無色最下之道‧是初靜慮之近分‧於彼說有六種作\n"+
		"意‧初是了相。故起誤解謂初生近分攝心‧即了相作意‧若如是計極不應理‧以若未得正奢\n"+
		"摩他‧必不能生初靜慮之近分‧未得近分定不能得奢摩他故。了相作意是觀察修‧由修習\n"+
		"此‧若先未得正奢摩他不能新生故。又如先引本地分說‧欲界心一境性無諸輕安‧解深密\n"+
		"經等說‧未得輕安即不得止。故未得近分即未能得正奢摩他‧故初近分六作意之最初者‧\n"+
		"是修近分所攝毘缽舍那之首‧非初近分之最初‧其前尚有近分所攝奢摩他故。未得初近\n"+
		"分所攝三摩地前‧一切等持‧皆是欲界心一境性。若依諸大教典之義‧得奢摩他者亦極稀\n"+
		"少‧況云能得毘缽舍那。\n"+
		"　　第二依奢摩他離欲之理。唯修前說‧具足明顯無分別等眾多殊勝正奢摩他‧全不修\n"+
		"習二種勝觀‧且不能伏欲界所有現行煩惱‧況能永斷煩惱種子及所知障‧故欲離欲界欲\n"+
		"得初靜慮者‧應依此止而修勝觀。前說修奢摩他‧能伏煩惱現行豈不相違‧答無有過失‧前"
		,
		/*===========================第 395 頁===========================*/
		"依世間毘缽舍那‧悉皆攝為奢摩他而說‧此依二種毘缽舍那前行初禪近分所攝奢摩他\n"+
		"說。能引離欲毘缽舍那略有二種‧謂由諦行相及由粗靜相離欲之理‧此說由其後道離欲。\n"+
		"修此之身‧謂未少得無我正見諸外道眾‧及正法中具足無我見者二所共修。彼修何道而\n"+
		"斷煩惱‧如聲聞地云‧「為離欲界欲勤修觀行‧諸瑜伽師由七作意‧方能獲得離欲界欲。何\n"+
		"等為七‧謂了相‧勝解‧遠離‧攝樂‧觀察‧加行究竟‧加行究竟果作意。」最後作意是證離欲根\n"+
		"本定時所有作意‧即所修果‧前六作意是能修因。\n"+
		"　　若此非由修無我義而斷煩惱‧為決擇修習何義而斷煩惱耶‧雖由此道亦伏欲界餘\n"+
		"惑現行‧然唯說名離欲界欲。故主要者‧謂由修習欲貪對治而斷煩惱‧其欲貪者此為貪欲\n"+
		"五種欲塵‧故能對治‧是於欲塵多觀過患。違貪欲相而善修習‧由此能於欲界離欲‧此雖無\n"+
		"倒了解諸欲過失及初靜慮功德‧而有堅固了相定解‧若先未得正奢摩他‧隨久觀修此二\n"+
		"德失‧然終不能斷除煩惱。又雖已得正奢摩他‧若無明了觀察‧隨修幾久‧亦定不能斷除煩\n"+
		"惱。故須雙修止觀方能斷除‧此一切伏斷煩惱共同建立。如是別思上下諸地功德過失善\n"+
		"了其相‧時為聞成‧時為思成‧故此作意聞思間雜。由如是修超過聞思‧唯有修相一向勝解"
		,
		/*===========================第 396 頁===========================*/
		"粗靜之義‧是名勝解作意。聲聞地云‧「於所緣相修奢摩他毘缽舍那。」第六作意時亦云‧\n"+
		"「修奢摩他毘缽舍那。」初作意時說緣義等六事‧此於餘處毘缽舍那中亦多宣說‧是故\n"+
		"此等雖非修習無我正見‧然是毘缽舍那亦不相違。故此諸作意之時‧是由雙修止觀而斷\n"+
		"煩惱‧修習之理‧謂若分辨粗靜之義數數觀察‧即是修習毘缽舍那‧觀察之後於粗靜義一\n"+
		"趣安住‧即是修習正奢摩他。如是所修初二作意‧是為厭壞對治。如是輾轉修習止觀‧由修\n"+
		"習故‧若時生起欲界上品煩惱對治‧是名遠離作意。又由間雜薰修止觀‧若能伏斷中品煩\n"+
		"惱‧是名攝樂作意。次若觀見能障善行欲界煩惱‧住定出定皆不現行‧不應粗尋便謂我今\n"+
		"已斷煩惱。當更審察‧為我實於諸欲尚未離欲而不行耶‧抑由離欲而不行耶‧作是念已‧為\n"+
		"醒覺故‧隨於一種可愛淨境攀緣思惟‧若見貪欲仍可生起‧為斷彼故喜樂修習‧是名為觀\n"+
		"察作意‧由此能捨未斷謂斷諸增上慢。次更如前於粗靜義別別觀察‧於觀察後安住一趣‧\n"+
		"由善薰修此二事故‧若時生起欲界下品煩惱對治‧是名加行究竟作意。第三第四第六作\n"+
		"意‧是能伏斷煩惱對治。\n"+
		"　　如是若斷軟品煩惱‧即是摧壞一切欲界煩惱現行‧暫無少分而能現起‧然非畢竟永"
		,
		/*===========================第 397 頁===========================*/
		"害種子‧由此能離無所有處以下諸欲‧然尚不能滅除有頂現行煩惱‧何況能得永度生死。\n"+
		"然依靜慮亦能獲得五種神通‧恐繁不錄‧如聲聞地‧極廣宣說‧應當了知。現在無修此等根\n"+
		"本靜慮之理‧故亦無有錯誤引導‧然於此等若真了解‧則於餘定亦斷歧途最為利益。如是\n"+
		"四種靜慮‧四無色定及五神通與外道共‧唯得此定非但不能脫離生死‧反於生死而為繫\n"+
		"縛‧故於奢摩他不應喜足‧更當尋求真無我見毘缽舍那。縱未廣知修初靜慮等根本定法‧\n"+
		"然於前說修奢摩他‧或名作意法定當了知。此是般若波羅蜜多甚深經等所說九種住心‧\n"+
		"中觀修次之所建立‧如前已引。又莊嚴經論及無著菩薩‧於菩薩地大乘對法攝決擇分解\n"+
		"彼意趣。又攝決擇分於止觀二法‧指聲聞地‧故聲聞地解釋最廣。又此諸義‧中觀修次論及\n"+
		"慧度教授論亦曾宣說。又辨中邊論說‧由八斷行斷五過理‧修奢摩他法‧今善觀彼等諸心\n"+
		"要義‧略示一二全無杜撰。現在修靜慮者‧且無此等之名。又有一類先學論時‧雖知其名‧然\n"+
		"未善其義‧後修行時‧見無所須棄而修餘。又有眾多略得止品所攝正定‧便謂已得空三摩\n"+
		"地‧或得內外所共第九住心定‧便謂已得無上瑜伽具眾德相圓滿次第‧及謂已得根本後\n"+
		"得合雜無間無分別智。皆是未能善解之相。若於上說善得定解‧則不因其假說修無所緣‧"
		,
		/*===========================第 398 頁===========================*/
		"無相了義‧美妙名稱而生誤解。若能實知此定之義‧便能了知歧非歧途‧故於此諸定量教\n"+
		"說修三摩地次第‧應當善巧。\n"+
		"<b><s>　經及廣釋論善說修定軌‧　因文簡直故狹慧未能解‧　反謂此經論無無分別教‧\n"+
		"　不於有處求無處求謂得‧　尚且未能辨內外定差別‧　況能善分辨小乘及大乘‧\n"+
		"　顯教與密教三摩地差別‧　見此故顯說大論修定法。　久習大論友莫捨自珍寶‧\n"+
		"　而取他假石願識寶自有‧　佛見除汝學別無教授義‧　讚聞住林樂願觀察彼義‧\n"+
		"　無分別止道修法與修量‧　未得善了解劬勞修定師‧　尚須依智者如實知修法‧\n"+
		"　否則暫休息於教損害小。　慈尊無著論所說修止法‧　為聖教久住故今略解釋。</s></b>\n"+
		"已釋上士道次第中‧學菩薩行‧於奢摩他靜慮自性如何學法。\n"+
		"<b>菩提道次第廣論卷十六終</b>"
		,
		/*===========================第 399 頁===========================*/
		"<b>菩提道次第廣論卷十七</b>\n"+
		"　　如是唯以如前已說正奢摩他‧心於一緣如其所欲安置而住無諸分別‧復離沈沒具\n"+
		"足明顯‧又具喜樂勝利差別‧不應喜足。應於實義‧無倒引發決定勝慧‧而更修習毘缽舍那。\n"+
		"若不爾者‧其三摩地與外道共。唯修習彼‧如外道道‧終不能斷煩惱種子‧解脫三有。如修次\n"+
		"初篇云‧「如是於所緣境心堅固已‧應以智慧而善觀察‧若能發生智慧光明‧乃能永害愚\n"+
		"癡種子。若不爾者‧如諸外道‧唯三摩地不能斷惑。」如經亦云‧「世人雖修三摩地‧然彼不\n"+
		"能壞我想‧其後仍為煩惱惱‧如增上行修此定。」此中說言「雖修三摩地」者‧謂如前說‧\n"+
		"具無分別明等差別妙三摩地‧雖修習此‧然終不能斷除我執‧故云‧「然彼不能壞我想。」\n"+
		"由其我執未能斷故‧其後仍當生諸煩惱‧故云‧「其後仍為煩惱惱。」若爾由修何等‧能得\n"+
		"解脫耶‧即前引經無間又云‧「設若於法觀無我。」謂若觀察無我之法‧能生智慧了無我\n"+
		"義。又云‧「既觀察已若修習。」謂已獲得無我見者‧若能修習無我正見。又云‧「此因能得\n"+
		"涅槃果。」謂此因即能得涅槃果。如由修此能得解脫‧若修餘法能解脫否‧又云‧「由諸餘"
		,
		/*===========================第 400 頁===========================*/
		"因不能靜。」謂除此外而修餘道‧若全無此‧苦及煩惱不能寂靜。此言明顯‧唯無我慧乃能\n"+
		"永斷三有根本。修次論中‧亦引此文破和尚執‧故於此義當獲定解。\n"+
		"　　外道諸仙亦有定通等德‧然由缺乏無我正見‧故終不能略越生死。如是前引菩薩藏\n"+
		"經亦云‧「未知經說諸真實義‧唯三摩地而生喜足‧即便於此起增上慢‧謂是修習甚深義\n"+
		"道‧故終不能解脫生死。故我於此密意說云‧由從他聞解脫生死。」此是大師自取密意顯\n"+
		"了宣說。從他聞者‧謂從他聞解釋無我。又此定為破除邪執‧謂外不從善知識所‧聽聞思惟\n"+
		"無我深義‧內自能生‧故說「從他聞」等。\n"+
		"　　總諸佛語‧有者直顯真實性義‧未直顯者‧亦唯間接令於實性趣向臨入。乃至未發真\n"+
		"實慧光‧不能滅除愚癡黑闇‧發則能除。故唯由其心一境性奢摩他者‧智不能淨‧亦不能滅\n"+
		"愚癡黑闇‧故當尋求達真實性無我空義‧定解智慧。如是思已‧定須求慧‧如修次中篇云‧\n"+
		"「其次成就奢摩他已‧應當修習毘缽舍那。當如是思‧世尊所有一切言教皆是善說‧或有\n"+
		"現前顯示真實‧或有間接趣向真實。若知真實‧便能永離一切見網‧如發光明便除黑闇。唯\n"+
		"奢摩他‧智不能淨‧亦不能遣諸障黑闇。若以智慧善修真實‧即能淨智‧能證真實。唯以智慧"
		,
		/*===========================第 401 頁===========================*/
		"正斷諸障‧是故我當住奢摩他‧而以智慧遍求真實‧不應唯由奢摩他故便生喜足。云何真\n"+
		"實‧謂於勝義一切有事‧由補特伽羅及法二我空性。」又此真實‧是諸度中慧度所證‧非靜\n"+
		"慮等所能通達。莫於靜慮誤為慧度‧更須生慧。如解深密經云‧「世尊‧菩薩以何等波羅蜜\n"+
		"多‧取一切法無自性性。觀自在‧以般若波羅蜜多取。」前引修信大乘經‧亦於此義密意說\n"+
		"云‧「若諸菩薩不住般若信解大乘‧於大乘中隨修何行‧我終不說能得出離。」\n"+
		"<b><s>　第二學習毘缽舍那之法分四‧<n>一</n>依止毘缽舍那資糧‧<n>二</n>毘缽舍那所有差別‧<n>三</n>修習毘缽舍那\n"+
		"　之法‧<n>四</n>由修習故毘缽舍那成就之量。　　今初</s></b>\n"+
		"　　親近無倒了達佛語宗要智者‧聽聞無垢清淨經論‧由聞思慧引發通達真實正見‧是\n"+
		"必不可少毘缽舍那正因資糧。若於實義無決定見‧必不能生通達如所有性毘缽舍那故。\n"+
		"又此正見‧要依了義而善尋求‧不依不了義‧故須先知了不了義所有差別‧乃能解悟了義\n"+
		"經義。此若不依定量大轍解密意論‧如同生盲又無導者而往險處‧故當依止無倒釋論。為\n"+
		"當依止何等釋論‧謂佛世尊於多經續明了授記‧能解深義聖教心藏‧遠離一切有無二邊‧\n"+
		"曰聖龍猛遍揚三處‧應依彼論而求通達空性見解。"
		,
		/*===========================第 402 頁===========================*/
		"<b><s>　此又分三‧<n>一</n>明了義不了義經‧<n>二</n>如何解釋龍猛意趣‧<n>三</n>決擇空性正見之法。　　今初</s></b>\n"+
		"　　諸欲通達真實性者‧須依佛語。然諸佛語由種種機‧意樂增上亦有種種‧當依何等求\n"+
		"深義耶‧謂當依止了義佛語通達真實。若爾何等名為了義‧何等名為不了義耶。答‧此就所\n"+
		"詮安立。詮顯勝義是名了義‧詮顯世俗應知即為不了義經。如無盡慧經云‧「何等名為了\n"+
		"義契經‧何等名為不了義經。若有安立顯示世俗‧此等即名不了義經‧若有安立顯示勝義‧\n"+
		"此等即名了義契經。若有顯示種種字句‧此等即名不了義經‧若有顯示甚深難見難可通\n"+
		"達‧此等是名了義契經。」\n"+
		"　　若由顯示世俗成不了義‧顯示世俗其理云何‧又由顯示勝義而成了義‧顯示勝義復\n"+
		"云何顯。即彼經中明顯宣說‧如彼經云‧「若有由其種種名言‧宣說有我‧有情‧命者‧養者‧士\n"+
		"夫‧補特伽羅‧意生‧儒童‧作者‧受者‧於無我中顯似有我‧此等名為不了義經。若有顯示空性‧\n"+
		"無相‧無願‧無作‧無生‧不生‧無有情‧無命者‧無補特伽羅‧及無我等諸解脫門‧此等是名了義\n"+
		"契經。」此說開示無我及無生等‧斷絕戲論是名了義‧宣說我等是不了義。故亦應知無我\n"+
		"無生等是為勝義‧生等是世俗。三摩地王經云‧「當知善逝宣說空‧是為了義經差別‧若說"
		,
		/*===========================第 403 頁===========================*/
		"有情數取士‧其法皆是不了義。」中觀光明論云‧「是故應知‧唯說勝義是名了義‧與此相\n"+
		"違是不了義。」入一切佛境智慧光明莊嚴經云‧「所有了義是名勝義。」無盡慧經說無\n"+
		"生等是名了義‧故定應知唯無生等說名勝義。故中觀理聚及諸解釋‧應知如實宣說了義‧\n"+
		"以廣決擇離生滅等一切戲論真勝義故。何故如是二種宣說‧而名了義不了義耶‧謂由此\n"+
		"義不能更於餘引轉故名為了義‧或義定了。此義即是真實性義‧過此已去不可引轉‧所決\n"+
		"擇事到究竟故。諸餘補特伽羅除此不可引顯餘義‧由其具足能成量故。如中觀光明論云‧\n"+
		"「何等名為了義‧謂有正量依於勝義增上而說‧此義除此‧餘人不能向餘引故。」由此宣\n"+
		"說之力‧其不了義亦能了解‧謂若此義不可如言而取‧須引餘義釋其密意‧或雖可如言而\n"+
		"取‧然彼非是究竟真實‧除彼更須求彼真實‧故非了義‧或義未了。\n"+
		"　　有作是說‧諸了義經是如實說‧故若彼經宣說無生無補特伽羅等‧應須執為全無有\n"+
		"生補特伽羅。若不爾者應非了義‧以其言聲非如實故。然不應理‧如是說法大師‧現見眾多\n"+
		"了義之經‧遮生等時加勝義簡別。若有一處已加簡別‧於未加者亦應例加‧是共法故。又此\n"+
		"即是彼法真實‧豈能成立如是說者為非了義。若不爾者‧總破生故亦別破句‧故不能立如"
		,
		/*===========================第 404 頁===========================*/
		"是宣說了義之經。故經或論‧若不就其前後所說總體之理‧唯由其中少分語句不可如言\n"+
		"而取義者‧應知不壞為了義經。又若彼語縱可如言而取其義‧然亦不成非不了義。\n"+
		"　　第二如何解釋龍猛意趣。般若經等宣說諸法‧皆無自性無生滅等‧其能無倒解釋經\n"+
		"者厥為龍猛。解彼意趣有何次第。答‧佛護‧清辯‧月稱‧靜命等大中觀師‧皆依聖天為量‧等同\n"+
		"龍猛。故彼父子是餘中觀師所依根源‧故諸先覺稱彼二師名根本中觀師‧稱諸餘者名隨\n"+
		"持中觀師。\n"+
		"　　又有一類先覺知識作如是言‧「就立名言而立名者‧略於二類大中觀師‧謂於名言\n"+
		"許外境者‧名經部行中觀師‧及於名言不許外境者‧名瑜伽行中觀師。就立勝義亦立二名‧\n"+
		"謂許勝義諦現空雙聚‧名理成如幻‧及許勝義諦唯於現境斷絕戲論‧名極無所住。」二中\n"+
		"初者許是靜命論師及蓮花戒等。其如幻及極無所住之名‧印度論師亦有許者。總其印藏\n"+
		"自許為中觀之論師‧雖亦略有如是許者‧然僅決擇龍猛菩薩弟子之中大中觀師有何宗\n"+
		"派‧若諸細流誰能盡說。又其覺慧大譯師云‧「就勝義門所立二宗‧是令愚者覺其希有。」\n"+
		"此說極善‧以彼所說‧唯就理智比量所量之義為勝義諦。理智所量順勝義諦故‧假名勝義。"
		,
		/*===========================第 405 頁===========================*/
		"中觀莊嚴論及光明論俱宣說故。又諸餘大中觀師‧亦不許唯以正理斷除戲論便為勝義\n"+
		"諦‧故非善說。\n"+
		"　　智軍論師云‧「聖父子所造中觀論中‧未明外境有無之理‧其後清辯論師破唯識宗‧\n"+
		"於名言中建立許有外境之宗。次靜命論師依瑜伽行教‧於名言中說無外境‧於勝義中說\n"+
		"心無性‧別立中觀之理。故出二種中觀論師‧前者名為經部行中觀師‧後者名為瑜伽行中\n"+
		"觀師。」次第實爾‧然月稱論師雖於名言許外境有‧然不隨順餘宗門徑‧故不可名經部行\n"+
		"者。如是有說同婆沙師‧亦極非理。雪山聚中後宏教時‧有諸智者於中觀師安立二名‧曰應\n"+
		"成師及自續師。此順明顯句論非出杜撰。故就名言許不許外境定為二類。若就自心引發\n"+
		"定解勝義空性之正見而立名‧亦定為應成自續之二。\n"+
		"　　若爾於此諸大論師應隨誰行‧而求聖者父子意趣。大依怙尊宗於月稱論師派。又此\n"+
		"教授隨行尊者之諸大先覺‧亦於此派為所宗尚。月稱論師於中觀論諸解釋中‧唯見佛護\n"+
		"論師圓滿解釋聖者意趣‧以彼為本‧更多採取清辯論師所有善說‧略有非理亦為破除‧而\n"+
		"正解釋聖者密意。彼二論師所有釋論‧解說聖者父子之論最為殊勝‧故今當隨行佛護論"
		,
		/*===========================第 406 頁===========================*/
		"師月稱論師‧決擇聖者所有密意。\n"+
		"<b><s>　第三決擇空性正見之法分二‧<n>一</n>悟入真實義之次第‧<n>二</n>正決擇真實義。　　今初</s></b>\n"+
		"　　何者名為所應現證實性涅槃及能證得涅槃之方便‧其悟入真實又從何門而悟入\n"+
		"耶。答‧若內若外種種諸法‧實非真實現似真實‧即此一切並諸習氣永寂滅故‧於一切種悉\n"+
		"皆滅盡我我所執‧是為此中所應證得實性法身。如何悟入真實之次第者‧謂先當思惟生\n"+
		"死過患令意厭離‧於彼生死生棄捨欲。次見若未永滅其因‧則終不能得還滅果‧便念何事\n"+
		"為生死本。由求其本‧便於薩迦耶見或曰無明‧為受生死根本之理。須由至心引生定解‧發\n"+
		"生真實斷彼欲樂。次見若滅薩迦耶見‧必賴發生智慧‧通達無彼所執之我‧故見必須破除\n"+
		"其我。次依教理觀察其我‧有則有害‧能成其無而獲定解‧是求解脫者‧不容或少之方便。\n"+
		"　　如是於我我所無少自性獲定見已‧由修此義而得法身。如明顯句論云‧「若諸煩惱\n"+
		"業身作者及諸果報‧此等一切皆非真實‧然如尋香城等惑諸愚夫‧實非真實現真實相。又\n"+
		"於此中何為真實‧於真實義云何悟入耶。茲當宣說‧由內外法不可得故‧則於內外永盡一\n"+
		"切種我我所執‧是為此中真實性義。悟入真實者‧慧見無餘煩惱過‧皆從薩迦耶見生‧通達"
		,
		/*===========================第 407 頁===========================*/
		"我為此緣境‧故瑜伽師當滅我‧此等應從入中論求。」又云‧「修觀行者‧若於真實起悟入\n"+
		"欲‧而欲無餘永斷煩惱及諸過失‧應如是觀何者為此生死之本。彼若如是正觀察已‧則見\n"+
		"生死以薩迦耶見而為其本。又見我是薩迦耶見所緣境界‧由我不可得故‧則能斷除薩迦\n"+
		"耶見。由斷彼故‧永斷煩惱及諸過失。故於最初唯應於我諦審觀察‧何為我執所緣之境‧何\n"+
		"等名我。」\n"+
		"　　又於無量各別之法‧佛說無量破除自性之理‧然修觀行者悟入之時‧應略決擇修習\n"+
		"我及我所悉無自性。此是中論第十八品之義‧月稱論師依佛護論師所說而建立。入中論\n"+
		"說補特伽羅無我‧亦即廣釋第十八品之義。若謂此中‧豈非宣說悟入大乘真實之法‧故唯\n"+
		"滅盡我我所執‧非是所得真實性義。又唯決擇我及我所悉無自性‧亦未決擇諸法無我‧故\n"+
		"名悟入真實之道不應正理。答曰‧無過。於一切種永滅我我所執略有二種‧一若以煩惱更\n"+
		"不生理而永斷者‧雖於小乘亦容共有‧然由永斷內外諸法戲論之相‧皆無可得‧即是法身。\n"+
		"又若通達我無自性‧於彼支分諸蘊亦能滅除有自性執‧譬如燒車則亦燒毀輪等支分。如\n"+
		"明顯句論云‧「依緣假立‧諸具無明顛倒執者著為我事‧即是能取五蘊為性‧然所執我為"
		,
		/*===========================第 408 頁===========================*/
		"有蘊相耶‧為無蘊相耶‧求解脫者當善觀察。若一切種善觀察已‧求解脫者見無所得。故於\n"+
		"彼云‧『我性且非有‧豈能有我所。』由我不可得故‧則其我所我施設處亦極不可得‧猶如燒\n"+
		"車‧其車支分亦為燒毀‧全無所得。如是諸觀行師‧若時通達無我‧爾時亦能通達蘊事我所\n"+
		"皆無有我。」此說於我達無性時‧亦能通達我所諸蘊無我無性。入中論釋云‧「由緣色等\n"+
		"自性成顛倒故‧亦不能達補特伽羅無我‧以於諸蘊施設我事而緣執故。如云‧乃至有蘊執‧\n"+
		"爾時有我執。」此說未達蘊無自性‧不能通達補特伽羅無我性故。\n"+
		"　　若即通達補特伽羅無自性慧‧而是通達蘊無性慧‧則有通達二種無我二種覺慧成\n"+
		"一之過。法與補特伽羅二各別故‧能達彼二無性‧二慧亦應各別‧如達瓶柱無常之慧。若即\n"+
		"通達補特伽羅無自性慧‧不能通達蘊無自性‧則正通達補特伽羅無我之時‧如何安立亦\n"+
		"能通達蘊無自性耶。初問非許‧當釋後問。謂正通達補特伽羅無自性慧‧雖不即執蘊無自\n"+
		"性‧然即由此慧不待餘緣能引定智‧決定諸蘊皆無自性‧能斷蘊上增益自性諸增益執。故\n"+
		"說通達補特伽羅無自性時‧亦能通達蘊無自性。如佛護論云‧「屬我所有名曰我所‧若我\n"+
		"且無‧由無我故何能更云此是我之所有。」譬如定知無石女兒‧雖不即由此慧執云無彼"
		,
		/*===========================第 409 頁===========================*/
		"耳等‧然能斷除計有耳等增益妄執。故若定知無真實我‧則能滅除執彼眼等真實有故。\n"+
		"　　若爾自部說實事宗‧許補特伽羅為假有者‧亦皆不許補特伽羅為勝義有‧則彼諸師\n"+
		"亦當通達眼等諸法皆無自性。若如是者‧眼及苗等諸粗顯法‧彼等亦皆許為假有‧亦應通\n"+
		"達皆無自性。若謂實爾‧違汝自許‧應不更成苗等無實。善惡業道亦應建立於相續上‧應許\n"+
		"相續是無自性。如顯義論云‧「若同夢者‧無十不善及布施等‧則未睡時豈非同於已睡之\n"+
		"時。」則中觀師說彼如夢無實之時應無駁難‧故說實事自宗說勝義世俗成與不成‧與中\n"+
		"觀宗說世俗勝義成與不成極不相順。故彼諸師世俗所許諸法‧由中觀師自量斷之成勝\n"+
		"義有‧彼師許為勝義有者‧中觀義成世俗有‧全無所違‧應詳辨別。又彼諸師所許假有補特\n"+
		"伽羅與此論師所許假有補特伽羅‧二名雖同‧其義各異。以此論師說彼諸師‧皆無通達補\n"+
		"特伽羅無我見故。由未通達諸法無我‧亦不能達補特伽羅無我義故。故此論師‧許其乃至\n"+
		"未捨諸蘊實有之宗‧亦執補特伽羅實有‧彼宗諸師未能通達補特伽羅勝義無故。\n"+
		"<b><s>　第二正決擇真實義分三‧<n>一</n>正明正理所破‧<n>二</n>破所破時應成能立以誰而破‧<n>三</n>依其能破於相續\n"+
		"　中生見之法。　初又分三‧<n>一</n>必須善明所破之因相‧<n>二</n>遮遣餘派未明所破而妄破除‧<n>三</n>自派明顯</s></b>"
		,
		/*===========================第 410 頁===========================*/
		"<b><s>　所破之理。　　今初</s></b>\n"+
		"　　譬如說此補特伽羅決定無有‧必須先識其所無之補特伽羅‧如是若說無我無性決\n"+
		"定此義‧亦須善知所無之我及其自性。若未現起所破總相‧則其破彼亦難決定是無顛倒\n"+
		"故。入行論云‧「未觸假設事‧非能取事無。」其所破之差別雖無邊際‧然於總攝所破根本\n"+
		"而破除者‧則能滅一切所破除。又若不從究竟微細所破樞要而滅除者‧有所餘存便墮有\n"+
		"邊耽著實事‧終久不能解脫三有。若未了知所破量齊破太過者‧失壞因果緣起次第‧墮斷\n"+
		"滅邊‧即由彼見引入惡趣‧故應善明所破為要。此未善明‧決定發生或是常見或斷見故。\n"+
		"<b><s>　第二遮破他派未明所破而妄破除分二‧<n>一</n>明所破義遮破太過‧<n>二</n>明所破義遮破太狹。　初又\n"+
		"　分二‧<n>一</n>說其所欲‧<n>二</n>顯其非理。　　今初</s></b>\n"+
		"　　現自許為釋中觀義者‧多作是言‧就真實義‧觀察生等有無之理‧從色乃至一切種智\n"+
		"一切諸法‧皆能破除。隨許何法‧若以正理而正觀察‧皆無塵許能忍觀察。由破一切有無四\n"+
		"邊‧非有一法此不攝故。又見真實之聖智‧全不見有生滅繫縛解脫等法‧如彼所量應是真\n"+
		"實‧故無生等。設許生等為能忍否觀察實性正理觀察‧若能忍者‧則有堪忍正理所觀之事‧"
		,
		/*===========================第 411 頁===========================*/
		"應成實事‧若不堪忍‧則理所破義而云是有‧如何應理。如是若許有生等為量成不成‧若有\n"+
		"量成不應正理‧見實性智見無生故。若許由名言眼識等成者‧彼是能成之量不應道理‧彼\n"+
		"等是量已被破故。如三摩地王經云‧「眼耳鼻非量‧舌身意亦非‧若諸根是量‧聖道復益\n"+
		"誰。」入中論云‧「世間皆非量。」若雖無量成而許是有‧旣非自許亦非正理‧故亦不成。又\n"+
		"若許生‧非勝義許須世俗許‧此亦非理。入中論云‧「於實性時由何理‧破自他生不應理‧即\n"+
		"由彼理於名言‧非理汝生由何成。」此說由於勝義破生正理‧於名言中亦能破故。又若不\n"+
		"許從自他等四句而生‧則於勝義觀察四句破除生時應不能破‧以除彼等有餘生故。若從\n"+
		"四句隨一而生‧不許餘三應從他生‧此不應理。入中論云‧「世間亦無從他生。」故破生時\n"+
		"不應更加勝義簡別‧明顯句論破加勝義簡別語故。此有一類雖於名言亦不許生等‧餘者\n"+
		"則於名言許有‧然彼一切皆作如是暢亮宣說。由諸正理於諸法上破除自性‧是此論師所\n"+
		"宗無可疑賴‧以雙於二諦破自性故。如是無性復有何法‧故於所破冠加勝義簡別語者‧唯\n"+
		"是中觀自續師軌。\n"+
		"<b><s>　第二顯其非理分二‧<n>一</n>顯彼破壞中觀不共勝法‧<n>二</n>顯所設難皆非能破。　初又分三‧<n>一</n>明中觀勝</s></b>"
		,
		/*===========================第 412 頁===========================*/
		"<b><s>　法‧<n>二</n>彼如何破壞‧<n>三</n>諸中觀師如何答彼。　　今初</s></b>\n"+
		"　　如六十正理論云‧「此善願眾生‧集修福智糧‧獲得從福智‧所出二殊勝。」由大乘行‧\n"+
		"令所化機於果位時獲二勝事‧謂勝法身及勝色身。此於道時‧須如前說方便般若‧未單分\n"+
		"離積集無量福智資糧。此復觀待至心定解世俗因果‧從如此因生如此果‧勝利過患信因\n"+
		"果系‧即於盡所有性獲得定解‧及由至心定解諸法皆無自性如微塵許‧即於如所有性獲\n"+
		"得定解。若無此二‧則於雙具方便智慧二分之道‧不能至心而修學故。如是果位能得二身\n"+
		"之因‧有賴根本決擇正見‧道無錯誤。其決擇正見之法‧即無間所說雙於二諦獲決定解‧除\n"+
		"中觀師‧任何補特伽羅皆見相違‧無慧宣說無違之理。唯具深細賢明廣大觀慧中觀智者‧\n"+
		"善巧方便通達二諦‧決擇令無相違氣息能得諸佛究竟密意。由此因緣‧於自大師及佛聖\n"+
		"教‧生起希有最大恭敬‧發清淨語‧以大音聲數數宣告‧「諸具慧者應知性空之空義‧是緣\n"+
		"起義‧非作用空無事之義。」\n"+
		"　　諸說實事自部智者‧雖善修習眾多明處‧猶不能許中觀正見。故於中觀師作如是諍‧\n"+
		"若一切法皆無自性自體空者‧則繫縛解脫生死涅槃一切建立皆無立處。如中論云‧「若"
		,
		/*===========================第 413 頁===========================*/
		"此悉皆空‧應無生無滅‧則諸四聖諦‧於汝皆應無。」此說若自性空‧生滅四諦皆不應理。迴\n"+
		"諍論云‧「設若一切法‧皆非有自性‧汝語亦無性‧不能破自性。」此說諍論若語無性‧則不\n"+
		"堪能破除自性成立無性。若無自性‧則能生所生能破能立之作用皆不應理。此是由覺破\n"+
		"自性理‧能破一切能作所作‧故相辯諍。故實事師與中觀師諍論二宗不共之事‧唯諍性空\n"+
		"可否安立生死涅槃一切建立。故無塵許自性之自體‧然能許可能生所生及破立等生死\n"+
		"涅槃一切建立‧是乃中觀之勝法。如中論第二十四品云‧「應成諸過失‧於空不成過‧汝破\n"+
		"空成過‧彼於我無過。若誰可有空‧於彼一切成‧若誰不許空‧於彼皆不成。」此說於無性者‧\n"+
		"非但不犯「若一切皆空」等過‧且於性空之宗有生滅等‧於自性非空之宗反皆不成。如\n"+
		"明顯句論云‧「於我宗中‧非但不犯所說眾過‧其四諦等一切建立且極應理。」為顯此故‧\n"+
		"頌云‧「若誰可有空」引文而釋。又中觀論第二十六品‧顯示十二緣起‧順轉生起次第及\n"+
		"逆轉還滅之次第‧第二十五品重破自性‧第二十四觀聖諦品‧極廣決擇‧自性不空‧其生滅\n"+
		"等生死涅槃一切建立不成之理‧及自性空‧彼等一切可成之理。故應了知‧持此品義遍一\n"+
		"切品。故現自許講中觀義者‧說無性中能生所生等一切因果悉不得成‧乃說實事之宗。"
		,
		/*===========================第 414 頁===========================*/
		"　　龍猛菩薩之所許‧謂依如此如此因緣‧生滅如此如此眾果‧即應依此因果建立而求\n"+
		"性空及中道義。如第二十四品云‧「若緣起所生‧即說彼為空‧即依他假設‧亦即是中道。若\n"+
		"非依緣起‧是法全非有‧故若非性空‧全非有是法。」此說性空能遍緣起‧莫故違說‧凡因緣\n"+
		"生定有自性。迴諍論云‧「若誰有此空‧彼有一切義‧若誰無空性‧彼一切非有。諸說空緣起‧\n"+
		"中道為一義‧無等第一語‧敬禮如是佛。」七十空性論云‧「由一切諸法‧自性皆是空‧諸法\n"+
		"是緣起‧無等如來說。」六十正理論云‧「諸不許緣起‧著我或世間‧彼遭常無常‧惡見等所\n"+
		"劫。若有許緣起‧諸法有自性‧常等過於彼‧如何能不生。若有許緣起‧諸法如水月‧非真非顛\n"+
		"倒‧彼非見能奪。」出世讚云‧「戲論說眾苦‧自作及他作‧俱作無因作‧佛則說緣起。若法從\n"+
		"緣起‧佛即許是空‧說法無自性‧無等獅子吼。」此等唯說由緣起因故自性空‧故緣起義現\n"+
		"為無性空性之義‧即是龍猛菩薩不共之宗。\n"+
		"　　若謂無性之空‧是就中觀自宗安立‧而緣起因果之建立‧於自宗中不善安立‧便謂就\n"+
		"他而假立者‧非緣起義。如云‧「若誰可有空‧於彼一切成。」此說何宗許無自性‧即於彼宗\n"+
		"生死涅槃一切緣起‧皆應理故。若爾‧許空性宗生死涅槃如何成耶。答‧一切諸法自性空者‧"
		,
		/*===========================第 415 頁===========================*/
		"是由依因緣生起之理‧故說彼空‧後當廣釋。故於此宗緣起成立‧此成立故苦亦成立‧苦依\n"+
		"因緣緣起建立‧若無緣起‧苦不成故。若有苦諦‧生苦之集‧滅苦之滅‧能滅之道‧亦皆應理‧故\n"+
		"有四諦。若有四諦‧則於四諦‧知斷證修亦皆成立。若有知等‧則三寶等一切皆成。如明顯句\n"+
		"論云‧「若於誰宗‧有一切法皆自性空‧即於彼宗如所宣說此等一切皆可得成。云何得成‧\n"+
		"答‧我因緣起故說是空‧故誰有空‧即有緣起‧誰有緣起‧則四聖諦於彼應理。云何應理‧答‧謂\n"+
		"由緣起故乃有苦諦‧非無緣起‧彼無性故即為性空。若有苦者‧苦集苦滅趣苦滅道‧皆可成\n"+
		"立‧故知苦斷集證滅修道‧亦得成立。若有知苦諦等‧則有諸聖果‧若有諸果住果亦成‧若有\n"+
		"住果則有諸向‧若有住果及向即有僧寶。有諸聖諦‧即有正法‧若有正法及僧伽者‧佛亦得\n"+
		"成。是故三寶亦得成立‧則世出世一切諸法差別證德一切皆成。諸法非法及其果報‧並其\n"+
		"世間一切名言亦皆得成。故云‧『若誰可有空‧於彼一切成‧』若誰無空則無緣起‧故一切不\n"+
		"成。」言成不成‧應知是說彼等有無。又前引迴諍論之諍‧龍猛菩薩明顯答云‧於無自性能\n"+
		"作所作皆悉應理。迴諍論云‧「若法依緣起‧即說彼為空‧若法依緣起‧即說無自性。」自釋\n"+
		"中云‧「汝由未解諸法空義‧故汝難云‧『汝語無性故‧應不能破諸法自性。』然此是說‧諸緣"
		,
		/*===========================第 416 頁===========================*/
		"起法即是空性‧何以故‧是無自性故。諸緣起法其性非有‧無自性故。何故無性‧待因緣故。若\n"+
		"法有性‧則無因緣亦應恆有‧然非如是‧故無自性‧故說為空。如是我語亦是緣起‧故無自性‧\n"+
		"無自性故說空應理。如瓶衣等‧是緣起故自性雖空‧然能受取蜜水乳糜‧及能遮蔽風寒日\n"+
		"曝。如是我語‧是緣起故雖無自性‧然能善成諸法無性。故說『汝語無自性故‧應不能破除\n"+
		"一切法自性‧』皆悉不成。」此極顯說‧若有自性不待因緣‧若待因緣定無自性‧順行逆返\n"+
		"及無性語‧而能作為破立等事。由依因緣‧染淨諸法生滅緣起與無自性隨順和合‧固不待\n"+
		"言‧即此緣起‧為達無性最無上因‧當知唯是中觀智者所有勝法。\n"+
		"　　若執緣起生滅定有自性‧破自性理而破生滅緣起‧如天變成魔‧於能如實得中觀義\n"+
		"作大障礙。故於諸法若見無有塵許自性引生定解‧而就自宗於因果系全無引生定解之\n"+
		"處‧須就他許。若就自宗於因果上善引定解‧而於無性自宗全無定解之處‧而於無性取密\n"+
		"意者‧應知未得中觀正見。應於能得正見之因‧淨護所受淨戒為本‧多門策勵積集資糧‧淨\n"+
		"治罪障‧親近善士勤求聞思。能於如是現空二事雙引定解者‧至極少際‧故極難得中觀正\n"+
		"見。中論二十四品密意說云‧「由知諸劣慧‧難達此深法‧故於說正法‧能仁心退捨。」寶鬘"
		,
		/*===========================第 417 頁===========================*/
		"論云‧「且此不淨身‧粗惡是現境‧恆常而顯現‧若尚不住心‧爾時此正法‧無所住深細‧非現\n"+
		"最甚深‧於心何易轉‧此法甚深故‧知眾生難悟‧故能仁成佛‧欲捨不說法。」經論皆說極難\n"+
		"通達。若不如是‧僅於少數堪為定量之論‧見說觀察瓶等與自支分‧以一異理決擇無性而\n"+
		"起誤解。便觀瓶等‧於自支分嘴項等中為是何事‧若於彼中全無所得便起定解‧謂瓶非有。\n"+
		"次於觀者亦如是觀‧則覺觀者亦定非有。爾時觀者且無所得‧又由誰知瓶等為無。由是便\n"+
		"謂非有非無‧以相似理引顛倒解。若安立此為得正見誠乃易事。故具慧者應於了義經‧及\n"+
		"中觀等清淨釋論所說空義即緣起義‧中觀智者所有勝法‧尤於佛護論師月稱論師‧無餘\n"+
		"盡解聖者父子所有密意‧最微細處‧謂依緣起‧於無自性生定解法‧及性空法現為因果之\n"+
		"理。當生定解‧他莫能轉。\n"+
		"　　第二彼說如何破此之理。如是龍猛菩薩之宗‧謂諸法全無塵許自性‧若由自性‧生死\n"+
		"涅槃一切建立皆不得成。然此建立不可不有‧其縛脫等一切建立皆當安立‧故亦定須許\n"+
		"無自性。然汝等說‧若一切法皆無自性‧餘復何有‧破除縛脫及生滅等不須更加勝義簡別‧\n"+
		"即由破除自性正理而能破除。故於無性安立縛脫及生滅等‧應當審思云何非破。若謂論"
		,
		/*===========================第 418 頁===========================*/
		"師就名言許繫縛解脫生死涅槃一切建立‧我於名言亦許彼等故無過失‧此非應理。月稱\n"+
		"論師於名言中‧亦許諸法全無自性‧汝亦共許‧若爾破除自性之理‧於名言中亦須破彼自\n"+
		"性故。又許破自性之理‧能破繫縛及解脫等‧故於名言亦破繫縛及解脫等‧極為明顯。總許\n"+
		"無性與繫縛解脫生滅等相違‧則於性空之空‧生死涅槃一切建立而應理者‧隨於二諦皆\n"+
		"不得成。故汝破壞中觀所有唯一勝法。若不許彼為相違者‧許於所破全不簡別‧以破自性\n"+
		"之理而破生滅繫縛解脫等‧全無正因。若以破自性之理而破因果‧則無性中無生滅等‧是\n"+
		"與第二十四品「若此等皆空‧應無生無滅‧則諸四聖諦‧於汝應皆無‧」實事師宗所起諍\n"+
		"論‧及迴諍論中「設若一切法‧皆非有自性‧汝語亦無性‧不能破自性‧」實事師宗所起諍\n"+
		"論‧顯然無別。若謂性空不空‧其生滅等皆不得成‧我俱不許性空不空‧故無過失者‧此定非\n"+
		"論義。明顯句論云‧「其生滅等非但於我無不成過‧其四諦等且極應理。」本論亦善分辨\n"+
		"性空之宗‧彼等皆成‧不空之宗則皆不成。入中論云‧「事空如像等‧依緣非不許‧如從空像\n"+
		"等‧能生彼相識‧如是諸法空‧然從空事生。」\n"+
		"　　又以正理破縛脫等‧非於勝義而能破除‧須於世俗中破‧然於名言破除生死涅槃一"
		,
		/*===========================第 419 頁===========================*/
		"切建立之中觀論師‧誠為先所未有者。\n"+
		"<b>菩提道次第廣論卷十七終</b>"
		,
		/*===========================第 420 頁===========================*/
		"<b>菩提道次第廣論卷十八</b>\n"+
		"　　第三諸中觀師如何答覆。若諸法性空‧生死涅槃所有因果不可安立‧龍猛菩薩謂此\n"+
		"諍論是中觀師破他之過‧今向自擲應遮回耳。中論二十四品云‧「汝將自諸過‧欲轉為我\n"+
		"過‧如現乘馬上‧而自忘其馬。若有見諸法‧是由自性有‧則汝見諸法‧皆無有因緣。」又云‧\n"+
		"「若此不皆空‧應無生無滅‧則四聖諦等‧於汝應皆無。」故謂若無自性餘更何有者‧顯然\n"+
		"未分苗無自性與苗全無二者差別‧亦未能分苗有自性與苗芽有。故謂若有必有自性‧若\n"+
		"無自性則謂斷無。若非爾者‧何故說破自性正理‧能破於有及生滅等。如是若時許有苗等‧\n"+
		"爾時便說有自性苗‧若全無性說斷無者‧定墮二邊‧與實事師全無差別。四百論釋云‧「如\n"+
		"實事師‧若時說有諸法‧爾時即說是有自性‧若時無性‧爾時便說諸法一切永無等同兔角。\n"+
		"未出二邊‧故此所樂一切難成。」乃至未解月稱論師所分‧有無自性‧與有無法四者差別‧\n"+
		"定墮二邊‧不能通達中觀深義。謂以若無自性則全無法‧於性空之空‧全無安立因果之處‧\n"+
		"故墮斷邊。若許有法必許有性‧則不能立因果如幻‧實無自性現似有性‧故墮常邊。若達一\n"+
		"菩提道次第廣論卷十八"
		,
		/*===========================第 421 頁===========================*/
		"切法‧本無自性如微塵許‧不墮有邊。如是則於苗等諸法‧非由作用空而為無事‧有力能作\n"+
		"各各所作‧引決定智‧遠離無邊。\n"+
		"　　顯句論中亦明了辨別無與無性‧如云‧「若汝立諸法皆無自性‧如世尊說自所作業\n"+
		"自受異熟‧則彼一切皆為汝破‧誹謗因果‧故汝即是無見之主。答曰‧我非無見‧我是破除有\n"+
		"無二邊‧光顯能往般涅槃城無二之道。我亦非說斷無諸業作者果等。若爾云何‧謂善安立\n"+
		"彼無自性。若無自性‧能作所作不應理故‧過失仍在。此過非有‧唯有自性不見作用故‧唯無\n"+
		"自性見有作用故。」此實事師謂若無自性以破自性理‧即破從業生諸異熟‧與許破自性\n"+
		"理破因果者‧所許無別。若破因果即成斷見之主‧雖中觀師與實事師共同許可‧然中觀師\n"+
		"自不許為破除因果‧而實事師覺破自性‧亦定破因果‧故說中觀師為斷無者或斷見者。藏\n"+
		"地自許中觀師者‧多許破自性理能破因果‧順實事師‧反說以理破壞因果是中觀宗‧而起\n"+
		"勝解。又答諍云‧「我非無見‧是破有無二邊顯解脫道。」餘文即明破有無理。其中說云‧\n"+
		"「我等非說無業果等。」是除無邊‧謂若許無業果等‧則成無見者‧然我不許爾。其次問云‧\n"+
		"「若爾云何。」答云‧「安立或許彼業果等全無自性。」是遣有邊。次云‧「若無自性能作"
		,
		/*===========================第 422 頁===========================*/
		"所作不應理故過失仍在。」是實事師諍云‧「汝雖說云‧非是無見是說無性‧然前設過‧若\n"+
		"無自性因果不成‧尚未能斷。」以於彼宗無性與無‧二無差別‧故如是諍。次答彼云‧「因生\n"+
		"果等‧能作所作於有自性不可成立‧唯於無性彼等乃成。」\n"+
		"　　四百論釋云‧「我非說無事‧是說緣起故。汝說有事耶‧非唯說緣起故。汝何所說‧宣說\n"+
		"緣起。何為緣起義‧謂無自性義。即自性無生義‧能生性如幻現‧陽燄‧影像‧乾闥婆城‧化‧夢果\n"+
		"義‧空無我義。」此顯由許緣起‧能除有事無事二邊之理。此由說緣起義是自性無生‧故能\n"+
		"除有實事論。顯說能生如幻等果為緣起義‧故能除無事論。言「有事」者‧略有二義‧謂自\n"+
		"性義及作用義。實事師之有事‧是有自性義‧無事論之事‧是有作用義。除彼二執即破自性‧\n"+
		"顯有因果如幻化故。又四百論釋云‧「豈無緣過去境之念耶‧誰云其無‧我等非破緣起‧如\n"+
		"其所有即如是定解。論主已安立云‧念謂於倒義‧唯顛倒而生‧故念所緣是過去事。若彼有\n"+
		"性‧其念由緣實有義故‧亦可有性。若過去事全無自性‧則緣彼念亦應無性‧故云顛倒亦善\n"+
		"成立。言顛倒者‧是無自性及緣起義‧非是餘義。事斷無義‧非顛倒義。又過去事‧非一切種全\n"+
		"無所有‧是所念故‧見彼果故‧亦非有性‧應性常故‧應可取故。」此說過去等事‧既非全無‧亦"
		,
		/*===========================第 423 頁===========================*/
		"非有性‧其顛倒虛妄義即緣起義‧非無事義。故許諸法有自性者是實事論‧或墮有邊‧非說\n"+
		"唯有法者‧即實事論及實有師。如是若說內外諸法‧由作用空為無事者是無事論‧或墮無\n"+
		"邊‧非說彼無性者即墮無邊。\n"+
		"　　若未如是分別全無與無自性‧有性與有之差別‧而於破除有無邊時‧但作是說‧我非\n"+
		"說無‧是說非有‧及非說有‧是說非無者‧純相違語‧非能略說中觀深義。由破他時觀察有無\n"+
		"自性等而破‧自亦現許彼二決斷。而又許有俱非義故。隨於何事觀察自性‧或有或無‧於有\n"+
		"無二‧須能決斷‧若第三聚非彼所攝‧理不應觀自性有無。如同有說顯色中有‧問青中有或\n"+
		"黃中有。如是能斷自性有無決定者‧須總於所知‧能斷有無決定。如於諦實‧能斷諦實一多\n"+
		"決定者‧須總於一多能得決定。能如是決斷者‧須能遮第三聚‧故許有俱非之法‧實屬亂說。\n"+
		"如迴諍論云‧「若違無自性‧應是有自性。」如是許者‧隨於何法‧皆不能遮第三聚法而得\n"+
		"定數‧唯懷疑惑‧以於有無等決斷一品‧則於他品不決斷故。\n"+
		"　　若許於是非等‧無第三聚者‧則於有無亦相同故。然彼說者‧是於中觀論‧宣說非有非\n"+
		"無之語‧所起誤解。若許爾者‧如不可說為有為無‧亦不應說非有非無‧俱於四句如是說故。"
		,
		/*===========================第 424 頁===========================*/
		"中觀論云‧「說有是執常‧言無是斷見‧故於有無二‧智者不應住。」然非僅說有無‧是說諸\n"+
		"法若有自性‧成常斷見‧如明顯句論解釋前文執有執無‧為有事無事見。其後又云‧「何故\n"+
		"若見有事無事成常斷見耶‧若有自性者‧非無故應常‧若先有現無‧是故應成斷。若說法由\n"+
		"自性而有‧性無可滅終不應無‧故許有性應成常見。又先住時許法有性‧如是後壞許為無\n"+
		"故‧應成斷見。」此說若許由自性有則成常見‧即先自性‧若許後壞‧則成無見‧非說有與壞。\n"+
		"佛護論師云‧「言有言無成常斷見者‧是說彼法若有自性。」此等明顯宣說常斷之理。總\n"+
		"若有說‧無自性之空‧非善妙空性‧而破除者‧謗般若經‧由謗法故‧當墮惡趣。若於無性雖起\n"+
		"勝解‧然說「若無自性餘更何有。」謗一切法畢竟非有‧亦是墮於斷見險處‧如云‧「若惡\n"+
		"觀其空‧少慧受衰損。」明顯句論云‧「且於空性‧若謂一切非有者即成倒見。」如云‧「若\n"+
		"倒執此法‧不智當失壞‧謂彼當沈沒‧無見不淨中。」設若不欲謗毀一切‧爾時便云‧此一切\n"+
		"法現前可得‧云何為空‧故無性義非是空義‧是則謗空。若如是謗‧則作匱乏正法之業‧定墮\n"+
		"惡趣。如寶鬘論云‧「又若倒執此‧愚者慢為智‧謗法暴惡性‧倒墮無間中。」\n"+
		"　　設謂我若先許諸法‧後見無者可成無見‧然我從本未許彼有‧有何可斷而成斷見。"
		,
		/*===========================第 425 頁===========================*/
		"「若先有現無‧是故應成斷。」說如此者‧乃為斷見。明顯句論云‧「諸瑜伽師達世俗諦唯\n"+
		"無‧知生全無自性‧達彼空性是勝義相‧不墮二邊。若法現在無‧爾時更何有‧如是諸法自性‧\n"+
		"先未獲得後亦非見為無。」此不應理‧若斷見中皆須先許所斷法者‧則順世等亦非先許\n"+
		"前世後世及業果等‧後乃謗無。本來不許彼等為有‧亦應非斷滅見故。「若先有現無‧是故\n"+
		"應成斷」者‧是實事師。若許諸法有自性者‧決定當生常斷二見‧謂若許自性一切時中無\n"+
		"轉變者‧應成常見。若許先有後時壞者‧應成斷見。故顯自無先時有性執後時壞所成斷見\n"+
		"者‧以自不許諸法有性如微塵許可成正因‧非此能離一切斷見。其餘不同說無因果斷見\n"+
		"之理‧明顯句論廣說‧謂斷見者‧許無因果及無後世。中觀論師許彼無性‧是立宗之差別。又\n"+
		"中觀師由緣起因‧說業果等皆無自性‧諸無見者‧不許業果等皆是緣起‧故不以彼為因。是\n"+
		"由未見現在有情‧從其前世而來此世及從此世而往後世‧以此因相說彼等無‧故於因相\n"+
		"差別極大。明顯句論云‧「有師難云‧諸中觀師與無見者全無差別。何以故‧此說善不善業\n"+
		"作者果報一切世間‧皆自性空‧諸無見者亦說彼無‧故中觀師與無見者全無差別。然非如\n"+
		"是‧諸中觀師說有緣起‧由緣起故說此世他世等一切無性。諸無見者非由如是‧是緣起故‧"
		,
		/*===========================第 426 頁===========================*/
		"就性空門‧達後世等是無實事。若爾云何‧謂緣現世諸法行相自性‧然未見彼從前世而來\n"+
		"此世‧及從此世而往他世‧謗無餘世‧等同此世可緣之事。」\n"+
		"　　若謂諸中觀師與無見者‧因雖不同‧然達業果及前後世無性是同‧此無性見則極相\n"+
		"等。此亦不同‧他許無性是畢竟無‧於二諦中俱不許有。中觀論師許世俗有業果等故。明顯\n"+
		"句論云‧「若爾‧彼等亦於諸法無性通達為無‧由此見故‧且有相等。答曰‧非有。中觀論師許\n"+
		"世俗有‧彼等不許‧故非相等。」此即顯示‧若中觀師於世俗中不許業果等‧與順世派見解\n"+
		"相同。又與斷見不同之理‧論師未說彼有所許我無所許。又未曾說彼等許無‧我不說無是\n"+
		"許非有‧而許是說無性及立為緣起因‧並於世俗許諸建立。\n"+
		"　　若謂業果等法皆無自性是極應理‧然斷見者亦說無彼‧故許彼等無有自性‧就無性\n"+
		"分同中觀師。此最不同。譬如於一竊財之賊‧有人不知是彼所竊‧妄說彼竊‧有人見是彼賊\n"+
		"所竊‧云是彼竊。如其二人說彼竊財‧賊雖實竊‧然一是妄語‧一是實語‧故不相同。如明顯句\n"+
		"論云‧「若云事同‧設無實事雖如是同‧然證者異‧故不相同。譬同於一盜‧有非實知由非愛\n"+
		"故‧覆意倒說是此所竊‧餘見彼竊正為破除。其事雖無異‧然由覺者異故‧應說前人是說妄"
		,
		/*===========================第 427 頁===========================*/
		"語‧餘是實語。若審觀察‧前者惡稱有罪‧餘則不爾。如是此中‧諸如實知諸法自性‧了解宣說‧\n"+
		"與無見者非如實知諸法自性‧同時知說‧皆不相等。」此亦善破‧「有說了解無自性時‧認\n"+
		"為正理破業果等‧遂於自宗不立因果‧彼於世俗雖是邪行‧然得無謬空品正見。」是故空\n"+
		"者‧非作用所空之空‧雖無自性須可安立因果緣起。如四百論釋云‧「如是若有法‧生時無\n"+
		"所來‧如是滅無去‧於此定無性。若謂無性餘更何有‧答曰‧若以染淨為因‧緣起為性‧彼法則\n"+
		"有。」此文明答「若無自性餘更何有。」佛護論師亦明分辨有與有性差別而答。二十二\n"+
		"品釋云‧「外曰‧設若無時‧亦無因果及緣和合‧餘更何有‧是故汝是說斷無者。我非說無‧唯\n"+
		"汝所執時等有性‧非應正理‧然有彼等依緣假立。」此說是破如實事師所許自性不應正\n"+
		"理‧然有緣起‧依緣假立。\n"+
		"　　若能如是分辨有無與有無性‧能遮無邊顛倒分別‧則於破除有性正理‧不致發生破\n"+
		"有錯誤。中觀諸師答諸實事智者‧其主要者即彼四門‧故略宣說。\n"+
		"<b><s>　第二顯所設難皆非能破分四‧<n>一</n>觀察堪不堪忍正理思擇而為破除‧然不能破‧<n>二</n>觀察由量成\n"+
		"　不成立而為破除‧然不能破‧<n>三</n>觀察是否四句所生而為破除‧然不能破‧<n>四</n>觀察有事無事等四</s></b>"
		,
		/*===========================第 428 頁===========================*/
		"<b><s>　句而為破除‧然不能破。　　今初</s></b>\n"+
		"　　若於實義如理觀察色等諸法‧為有為無生不生等‧是名觀察真實正理‧及名觀察究\n"+
		"竟正理。我亦不許色等之生堪忍以彼正理觀察‧故無應成實事之過。\n"+
		"　　若彼不堪正理觀察‧理所破義云何能有。此於不堪正理觀察與理所破誤為一事。有\n"+
		"多人說‧「觀察實性正理雖破‧然有生等。」此乃亂說‧非我所許。堪不堪忍正理觀察之義‧\n"+
		"謂以觀察真實之理有得無得。如四百論釋云‧「我等觀察‧唯為尋求自性故。」是於色等‧\n"+
		"尋求有無生滅等性‧即於色等尋求有無自性生滅‧非以彼理尋求生滅。故說彼理名觀實\n"+
		"性‧以彼觀察有無真實生滅等故。若以彼理觀察尋求‧無有少分生等可得‧名不忍觀察‧非\n"+
		"唯彼理所未能得‧便名彼破。若是有法須由彼成‧彼所未成乃名彼破。色等生滅是由名言\n"+
		"識所成立‧色等雖有‧非由理智所成‧故彼未得如何名破。譬如眼識雖不得聲‧非眼能破。故\n"+
		"生滅等若有自性或真實有‧則須由彼正理所得‧以彼正理是於色等如理觀察有無自性\n"+
		"之生滅故。由如是理未得生等‧能破自性或真實生滅‧以有自性須彼所得‧彼未得故。譬如\n"+
		"若東方有瓶‧其尋瓶者決定能得‧若於東方尋瓶未得‧彼雖能遮東方有瓶‧然彼何能遮瓶"
		,
		/*===========================第 429 頁===========================*/
		"是有。如是若有自性之生‧則中觀理決定能得‧若尋求時彼未得生‧由彼能破自體或自性\n"+
		"之生‧然生是有如何能破。如四百論釋云‧「故以正理如是觀察‧若根境識無有自性‧則非\n"+
		"性成‧設若彼等由自性成‧則以正理正觀察時‧如其安住‧應極明了見有自性‧然不可得故\n"+
		"成性空。又色聲等諸世俗法‧雖其是有‧非觀真實或觀有無自性正理之所成立‧故正理觀\n"+
		"察不於彼轉‧此大論師曾數宣說。又以正理觀察時‧若以正理未能獲得‧便壞彼諸世俗法\n"+
		"者‧說是對於建立世俗未獲善巧。」若觀有無自性之理能破彼等‧則正理觀察於色受等\n"+
		"諸世俗法亦極應轉。然此論師之論中‧於一切種畢竟破除‧故說觀察有無自性正理未得\n"+
		"之義‧即是正理破除之義者‧是極漂流中觀之外。\n"+
		"　　如是根本聖智‧是未能見色等生滅‧豈彼是見生滅等無。觀察有無自性之理‧亦是未\n"+
		"能得生滅等‧非是量定生滅等無‧故未辨別諸不堪忍正理觀察與正理所破。根本聖智未\n"+
		"見生滅與見無生滅‧觀察有無自性‧理智未得生滅與得無生滅‧混執為一。況現在人‧即諸\n"+
		"先覺亦有誤解‧故具慧者應細觀察‧善辨彼等。\n"+
		"　　由是因緣我非是說‧較勝義量‧諸名言識勢力強大‧及非是許‧諸名言識破勝義量。然"
		,
		/*===========================第 430 頁===========================*/
		"汝若說觀察真實之正理‧觀察名言色受等境‧若彼未得即是彼理之所破者‧非但不能破\n"+
		"除於他‧返以世間共許之量破彼破者。入中論云‧「若世於汝無所損‧應就世間而破此‧汝\n"+
		"先與此世間諍‧我後當依有力者。」其釋論云‧「我為破除世間世俗住極艱辛‧汝今當破\n"+
		"世間世俗‧設若世間於汝無損‧我亦於汝當為助伴‧然彼世間定能損汝。」此說「我為破\n"+
		"除世間世俗住極艱辛」者‧是說為淨此眼識等錯亂心故‧及色塵等錯亂境故‧策勵修道‧\n"+
		"不許彼是正理所破‧是由修道所破之事。次言「汝今當破世間世俗」等者‧是中觀師破\n"+
		"彼實有依他起性。彼云‧我亦以正理破汝世俗出相同過‧答曰‧如我能破依他性‧若汝能以\n"+
		"正理破除世俗‧我當於汝亦為助伴。此說若理能破‧我亦不須為破彼故‧修道難行是為所\n"+
		"欲‧故顯正理非能破除諸世俗法。又說非但不能破除‧若強破者反為世間共量所害。由名\n"+
		"言識能害如是相似正理‧故較彼等亦許力大。諸實事師以正理觀察‧破外境等世俗法時‧\n"+
		"僅是彼理未能獲得‧非彼能破。\n"+
		"　　有說於名言中不破色等之義‧是依牧童等世人不破‧觀察實性正理能破。極不應理。\n"+
		"具觀慧者‧是於觀察實性正理能不能破而有疑惑‧未由宗派改變心者‧不能破除‧無所疑"
		,
		/*===========================第 431 頁===========================*/
		"故。若觀實性正理能破‧須於名言而破除故。觀察實性正理‧非能破一切生者‧月稱論師明\n"+
		"了宣說。四百論釋云‧「若此觀察破一切生‧顯示有為皆無生者‧爾時彼等不應如幻‧應以\n"+
		"石女兒等而為量度‧然恐違犯無緣起過‧故不順彼喻‧令如幻等‧不違緣起。」言此觀察者‧\n"+
		"謂觀察真實之正理。言破一切生者‧謂於所破不加簡別‧凡是有生‧一切皆破。言石女兒等\n"+
		"者‧謂破一切生‧如石女兒及兔角等‧一切作用空成為無事。若如是者‧恐犯斷無緣起之過‧\n"+
		"故不同彼‧永離一切作用功能石女兒等之無生‧當如幻等‧破除實有或自性生。又四百論\n"+
		"釋云‧「設若眼等非有‧何故建立眼等諸根業異熟體。我等豈破此異熟體。若破眼等彼何\n"+
		"非破。我等觀察唯為尋求自性故‧我等於此破除有性諸法‧非破眼等所作緣起業異熟體。\n"+
		"彼可容有‧故有所說異熟眼等。」此顯然說‧以諸正理齊此破除‧齊此非破‧如此辨別一處\n"+
		"說已‧餘未說者一切皆同‧定須了知。故自尋求時‧境上有性‧正理能破‧非破其有。說諸正理\n"+
		"唯為尋求自性為勝‧故彼正理‧是為尋求自性有無。說正理破‧亦是破除自性之義‧故當分\n"+
		"辨彼二差別。非但不破如斯業果‧說中觀師定須受許‧即彼論後又云‧「是故智者於世間\n"+
		"義‧莫以所說順見真實正理觀察‧應當受許不可思議諸業異熟‧如從變化起變化理‧一切"
		,
		/*===========================第 432 頁===========================*/
		"世間皆當受許。」如是自己建立二諦‧若以決擇勝義之理‧妨害自所建立世俗‧建立二諦\n"+
		"自內相違‧豈可稱為安立二諦殊勝智者。若二建立無少相違‧則以決擇勝義之理‧破除世\n"+
		"俗建立而成相違。明顯句論云‧「汝於勝義及世俗諦‧不善巧故‧則於一法以理觀察‧由非\n"+
		"正理破壞其法‧我善安立世俗諦故‧住世間品。汝為破除一分世俗立餘道理‧我以餘理而\n"+
		"返破除‧如世耆長‧唯為破汝失世間法者‧非破世俗。」此說唯破失壞世俗諸宗論師‧不破\n"+
		"世俗。若以觀察實性之理破壞世俗‧說是不善安立二諦‧故以正理破世俗色等‧決定非此\n"+
		"論師真意。\n"+
		"　　總之‧非唯中觀論師‧凡是自部印度諸宗‧許有二諦建立者‧雖可由他補特伽羅於自\n"+
		"所立二諦建立出相違過‧然彼自於所立二諦‧許勝義理破世俗義‧我敢斷言定無一人。\n"+
		"　　第二觀察由量成不成立而為破除‧然不能破。許有色等‧非許量所未成要許量成。若\n"+
		"爾論云‧「世間皆非量‧」云何應理。此破世間眼等諸識於真實為量‧非破於一切境為量。\n"+
		"入中論釋云‧「如是思惟真實‧唯諸聖者乃為定量‧非諸非聖‧為說世間諸違害故。」若觀\n"+
		"察真實許世間見亦為定量‧故云‧「設若世間是定量‧世見真實聖何為‧諸餘聖道何所作‧"
		,
		/*===========================第 433 頁===========================*/
		"愚蒙是量亦非理。」釋云‧「若唯眼等能定真實‧為證聖道力勵持戒聞思修等應非有果‧\n"+
		"然非如是。」故云‧「世間皆非量‧世無害真實。」六十正理論釋云‧「若見彼等有‧則非見\n"+
		"真實‧故世尊謂眼耳鼻等皆非量。」引此等證‧顯然是於勝真實境破彼為量‧非於餘境。若\n"+
		"不爾者‧則說「若眼等識‧於色聲等名言義境是定量者‧為見真實‧不應更求聖道。」全無\n"+
		"關係‧等同說云‧「眼識見色為聞聲故耳應無義。」\n"+
		"　　若謂「為觀色聲等尋求聖道應無有義」是所樂許‧由此豈能成所非欲。四百論釋\n"+
		"云‧「若彼於此諸根識等增益為現‧又許為量‧極無係屬。不欺誑識世見為量‧然世尊說此\n"+
		"識是有為故‧是虛妄欺誑法‧猶如幻事。」若是虛妄欺誑之法及如幻者‧非不欺誑。以住此\n"+
		"相之事‧現餘相故‧若如是者‧計執為量不應道理‧餘一切識皆成量故。總破眼等諸識是量‧\n"+
		"如何會解。\n"+
		"　　此與眼耳鼻等‧皆非量等不同‧是大疑處‧故當詳釋。如是破諸識等是現及量者‧是破\n"+
		"分別師許‧故當先述彼宗。如四百論釋云‧「此分別師全未熟悉世間義故‧如諸愚童‧最初\n"+
		"唯應令練習彼‧為顯此故詰問觀察。汝現云何‧答謂現識。為何等識‧謂離分別。分別為何‧諸"
		,
		/*===========================第 434 頁===========================*/
		"於境義增益名種‧散動轉想。五種根識由離彼故‧於不可議境自相轉‧故名為現。」謂離分\n"+
		"別無錯亂識許為現識。無錯亂者‧謂於境自相如實而取‧由五根現識量度自相‧故色聲等\n"+
		"自相是彼五現識之所量。五識成量之處‧亦即五境之自相也‧然此論師如下所說‧雖於名\n"+
		"言亦不許有自性自相‧豈許諸根識於自相為量。故此破除根識為量者‧是破許彼等於五\n"+
		"境自相為量。破除之理‧即引世尊說彼諸識虛妄欺誑而破。由說欺誑破不欺誑即是破量‧\n"+
		"以不欺誑是量相故。欺誑之理即住此相之事‧現為餘相。謂色聲等五境‧實無自相‧於諸根\n"+
		"識現有自相‧故說彼等於自相境非是正量。總此意趣‧謂諸根識於五境自相非是正量‧以\n"+
		"待五境所現自相是欺誑故。五境實空無自相‧現自相故‧如現二月之識。其實事諸師‧謂色\n"+
		"聲等若無自相自性‧則說彼等空無一切作用功能而成無事‧故若不於五境自相為現量‧\n"+
		"則於五境無成量之處。若於五境成量‧亦許於彼自相成量。此論師謂‧若有自相或有自性‧\n"+
		"則成實有‧安立實境之量‧雖須於自相為量‧然境虛妄‧故立此境之量不須於自相為量。四\n"+
		"百論釋云‧「以世間見‧遣真實見‧亦非正理。彼唯於世間立為量故‧彼所緣義亦是虛妄欺\n"+
		"誑法故。」故破於自相為量‧非須全破其是量。故非總破名言諸識為量。若不爾者‧則說"
		,
		/*===========================第 435 頁===========================*/
		"「不欺誑識世見為量」不應正理。一切名言識‧破為量故。明顯句論云‧「故由如是四量‧\n"+
		"安立世間通達諸義。」與此建立現比教喻四量相違故。又破有性能量所量‧不破緣起觀\n"+
		"待所立能量所量‧即前論云‧「此等皆是觀待假立‧若有能量乃有所量義‧若有所量義乃\n"+
		"有能量‧能量所量非有自性。」故無翳等內外錯亂因緣損害諸根識等‧唯無明力錯亂‧執\n"+
		"取實無自性現有性境‧此不能害無倒名言。入中論云‧「許妄見有二‧根明有過根。諸有過\n"+
		"根識‧望善根識倒‧諸無損六根‧所取世共證‧就世為諦實‧餘就世立倒。」此說名言識境‧待\n"+
		"名言識各立二類‧謂倒無倒內身所有損根因緣。入中論釋云‧「若諸翳膜黃眼等病‧及食\n"+
		"達都羅等‧是為內有壞根因緣。」身外有者‧如前論云‧「由油水鏡及空谷等發言說聲‧又\n"+
		"由日光處時差別‧正現前等‧是為外有損根因緣。內雖未有損根因緣‧由此諸緣而於影像\n"+
		"谷響陽燄‧亦成妄執水等因緣。如是幻師等所配咒藥亦當了知。能損意者‧謂前諸事及諸\n"+
		"邪宗‧諸似比量。」此說邪宗及諸似因‧皆是損害意識因緣。又睡眠等‧是損夢中意識因緣‧\n"+
		"故無明所執之境‧如下當說雖於名言亦無‧然由無明所作損害‧非此所說違害因緣。\n"+
		"　　設作是念‧若五根識‧無餘錯亂因緣損害‧便於名言為不錯亂‧則彼所現自相‧於名言"
		,
		/*===========================第 436 頁===========================*/
		"中亦應許有‧然此師不許‧故須許為錯亂。若如是者‧則此諸識為於名言安立色等之量‧不\n"+
		"應道理‧以於名言色等亦錯亂故。答曰‧清辯論師許色等境於名言有自相之性‧破唯識師\n"+
		"於遍計執。由無自相之性‧謂相無自性時‧於遍計執設能計所計雙關觀察‧若能遍計自性\n"+
		"差別之名覺‧許於名言無自相之性者‧則謗依他起事‧是顯然許依他起性‧於名言中有自\n"+
		"相性。第二十五品般若燈論云‧「若謂說色意言言說遍計執性皆為無者‧是謗有事。毀謗\n"+
		"意言及言說故。」觀禁大疏云‧「此文顯示瑜伽諸師謂遍計執‧由相無自性性‧故說為無\n"+
		"性。若於說色自性差別‧意言分別言說名言能遍計性‧謂由相無性性故無自性者‧是謗世\n"+
		"俗依他起事‧不應道理。」此說名覺所攝依他‧若於名言許相無性則成誹謗。其相無自性\n"+
		"之相者‧即是自相或名自性。唯識諸師說遍計執無彼自相‧於依他起有彼自相故有自性。\n"+
		"然從他生無自然性‧說名無性‧解深密經亦如是說。謂一切法皆無自性‧是密意說。蓮花戒\n"+
		"論師云‧「彼經顯示三種無性所有密意‧開顯遠離二邊中道‧故是樹立了義之宗。」若於\n"+
		"勝義增益依他有自性者‧是遍計執‧故彼非有。由於名言依他起性有自相故‧遣除損減‧故\n"+
		"許顯示中道之義‧故此論師亦於名言許有自相。入中論釋云‧「如於繩上蛇是遍計‧於實"
		,
		/*===========================第 437 頁===========================*/
		"蛇是圓成實。如是自性‧若於緣起諸所作性依他起上是為遍計‧於佛行境立為圓成‧如是\n"+
		"了知三性建立。次當解說經中密意‧『若經所說非實意‧知不了義當引釋。』」謂解深密經\n"+
		"立三自性是不了義。自宗之遍計‧謂於依他執有自性‧故於名言亦不許依他有自相之性。\n"+
		"唯識諸師除遍計執‧不許依他及圓成實相無自性。故許彼二‧是有自相或有自性。正依解\n"+
		"深密經‧故許彼二是勝義有。佛護論師月稱論師‧謂若有自相所成實體‧則是實有‧清辯論\n"+
		"師等‧唯爾不許是勝義有。\n"+
		"<b>菩提道次第廣論卷十八終</b>"
		,
		/*===========================第 438 頁===========================*/
		"<b>菩提道次第廣論卷十九</b>\n"+
		"　　又唯識師云‧「一一極微非根識境‧不顯現故‧眾多積聚亦非彼境‧無實體故‧如現二\n"+
		"月。」分別熾然論答云‧「若成未積單位極微非諸根境‧是成已成。」答後難云‧「若以積\n"+
		"聚一種極微為宗‧說此非因‧無實體故‧而立因者‧其因是他不極成‧謂一種類極微體性‧彼\n"+
		"彼皆有益境功用‧故彼皆為境體支分。於極微塵生起現似積相之覺‧從其積聚一類極微\n"+
		"而成瓶等‧我等亦許彼為實有‧猶如極微‧何以故‧猶如極微亦是八微積聚為體‧許其實有‧\n"+
		"故和合體所有瓶等‧亦是實有‧單不可成。」此說積聚一一極微皆是根識之因‧復是實有。\n"+
		"又許彼是微塵究竟‧故許無分極微是所緣緣。是故根識‧若無前說內外亂緣之所損害‧許\n"+
		"為無亂‧許於名言是所緣緣‧與經部同。\n"+
		"　　入中論釋云‧「有說經部師宗說為勝義‧中觀諸師即許彼法而為世俗。當知此說是\n"+
		"未了知中論真實。有說婆沙諸師所說勝義‧中觀諸師許為世俗‧此亦未知論之真實。說出\n"+
		"世法與世間法而相同等‧不應理故。故諸智者決定當知此宗非共‧此顯彼諸部宗‧不共假"
		,
		/*===========================第 439 頁===========================*/
		"立無有方分能所取等‧雖於名言亦不受許。」四百論釋云‧「自部諸師如勝論師‧許實極\n"+
		"微不應正理。」此說不許無分極微‧前二部師許為勝義‧中觀諸師雖於世俗且不許者‧謂\n"+
		"無方分等事‧非說彼二所許實法‧中觀諸師於世俗中皆悉不許。如色聲等彼許實有‧中觀\n"+
		"諸師許為世俗。四百論釋‧就諸根微塵積聚位‧破許一一是根識因。又即諸根與諸微塵‧若\n"+
		"即若離皆不得成。故依彼假立為識所依。如是諸境亦依他立而為假有‧是根識境。此許諸\n"+
		"識是假現‧諸境是真現‧故此論師與清辯論師雖二同許諸外境義‧然其安立根境道理‧極\n"+
		"不相同。前破根識於自相境為量之時‧說「住餘相事現餘相故‧」謂色聲等境‧於根識前\n"+
		"現似有自相‧然如所現‧雖於名言亦定非有‧故此論師雖於名言亦許諸識皆是錯亂。然諸\n"+
		"根識於名言中‧是能立色聲等境之量‧無不應理。立彼諸識錯亂之因‧謂如所現無自相義‧\n"+
		"此乃觀察有無自相之理智所能成立‧非名言量之所能成‧故待名言量‧非為錯亂。現第二\n"+
		"月及現影像等諸識‧如所現義無第二月及本質等不待理智‧即名言量便能成立。故此諸\n"+
		"識與前諸識為正倒世俗之差別‧亦皆應理。\n"+
		"　　若謂由依理智及名言量‧通達錯亂雖有差別‧然如實無現似本質等義‧如是亦無現"
		,
		/*===========================第 440 頁===========================*/
		"似自相之義。如有自相所空之色等‧如是亦有本質所空諸影像等‧是故諸識觀待通常之\n"+
		"名言覺是倒非倒悉無差別。若爾反問‧自相之體與現似本質之義‧於名言中二者同無‧色\n"+
		"等像等於名言中二者同有。則入中論釋云‧「緣起影像及谷響等略為虛妄‧具無明者亦\n"+
		"可現見‧然青等色及心受等略現諦實‧其真自性具無明者一切不現‧是故此性與於世俗\n"+
		"現虛妄者非世俗諦。」安立青等為世俗諦‧不立像等為世俗諦‧如此差別不應道理。當有\n"+
		"何答。若謂此二‧於名言識雖同顯現‧然影像等由世間識能達為妄‧故不立為世間俗諦‧青\n"+
		"等雖妄‧然其為妄由世間識不能證知‧故安立為世間俗諦。如彼二境待名言識諦妄應理‧\n"+
		"如是二心待名言識‧是倒非倒亦應正理。若謂待名言識既不顛倒‧於名言中錯亂相違。若\n"+
		"於名言說為錯亂‧錯亂之名言與待何識立不顛倒名言之識‧二者是一‧則犯相違‧然彼二\n"+
		"種名言各別‧有何相違。謂以正理破除色等有自性體時‧非就勝義‧須就名言‧於此名言識‧\n"+
		"則諸根識皆是錯亂‧除此所餘‧於諸通常名言識則非錯亂‧故不相違。譬如世間言說中‧說\n"+
		"幾人有及幾人無‧說云幾者‧其語雖一‧然所有之幾與所無之幾‧不立為同。又彼錯亂是待\n"+
		"通常世識‧非中觀師許彼不錯‧如云‧「唯由世為諦」等‧故中觀師立彼錯亂。然以安立諸"
		,
		/*===========================第 441 頁===========================*/
		"虛妄境‧亦無相違‧若立實境許以亂心而安立者‧則成相違。又於名言‧許一切法皆如幻化‧\n"+
		"故於名言皆是虛妄‧然立彼等為世俗諦‧亦不相違。如云無明障性故世俗‧於無明世俗立\n"+
		"為諦實‧與破諸法有自性時‧於彼世俗立為虛妄‧二無違故。又說於世俗中現虛妄者非世\n"+
		"俗諦‧謂以名言量能達虛妄者‧非說凡於名言為虛妄者。\n"+
		"　　如是中觀師於名言中‧自宗安立生死涅槃眾多建立‧及於名言破實事師所樂不共\n"+
		"妄計諸義。此諸道理極難通達‧故能無倒通達二諦建立者‧絕無或有。謂於世俗破實事師\n"+
		"所許諸法‧須以正理觀察而破‧然自於世俗許生滅等。亦作是念‧具觀慧者許與不許‧是由\n"+
		"有無能立‧能立復待隨正理行。次以正理正觀察時‧見自所許諸世俗法‧與實事師遍計所\n"+
		"執‧若正理害二俱妨害‧若不妨害二俱不害。次見大自在天及自性等‧於名言中若許為無‧\n"+
		"則自色等亦須許無‧若於名言許色等有‧則自在等亦須許有‧二者相等。故覺自宗任於何\n"+
		"法此是此非皆不可說‧恃為獲得中觀真實。又有隨順如此誤解‧住無所取‧便為修習清淨\n"+
		"正見尤為眾多。諸如此類‧非是智者所愛正論‧由未了知如前所說正理所破‧遂以破除自\n"+
		"性正理破壞一切名言建立。是執正見與諸邪見‧錯則俱錯‧不錯則俱不錯‧大邪見故。故如"
		,
		/*===========================第 442 頁===========================*/
		"此類雖長時修‧非但不能略近正見返漸遙遠‧由與自宗緣起正道‧可許一切生死涅槃緣\n"+
		"起建立‧極相違故。\n"+
		"　　入中論云‧「無知睡擾諸外道‧如其遍計妄計我‧幻陽燄等諸遍計‧此於世間亦非\n"+
		"有。」此說外道不共欲樂及如前引自部實事諸師不共欲樂諸遍計執‧於自世俗亦說非\n"+
		"有‧此義當釋。此於名言許有許無‧為從何門而安立耶‧謂若有一於名言識是所共許‧如所\n"+
		"許義‧餘名言量無能違害‧及能如理觀察真實或有無自性‧以此正理亦無違害‧則於名言\n"+
		"許彼為有‧與此相違‧即許為無。其名言識‧謂任於何法‧唯如所顯隨順而轉‧不更觀察其所\n"+
		"現義‧為唯於心如是現耶抑為彼義實如是耶‧名不思擇真實義識‧非是一切全無觀察。此\n"+
		"唯如世間共許‧或如名言識顯現而轉‧非觀真理為何而隨轉故‧亦名世許。故如此識遍於\n"+
		"宗派‧變未變心一切皆有。任於誰身‧皆名世許或名無觀察識。莫執唯於世間常人未以宗\n"+
		"派變心者乃有‧即由宗派已變心者‧雖有眾多有觀察識‧謂觀唯如名言許耶抑於真實如\n"+
		"是住耶‧然非彼一切識‧皆是觀察實理之識。故問何為世共許‧非是唯問離諸宗派世間老\n"+
		"人‧即可觀察五蘊身中無觀察識‧如何而轉‧言於彼識共許‧謂所顯現或所領納設名言處。"
		,
		/*===========================第 443 頁===========================*/
		"又諸業果及地道等‧雖於庸俗未能遍許‧然由聽聞及領納等‧緣彼境時‧於諸通常不觀實\n"+
		"理之識‧亦能顯現‧故無世間不許之過。餘名言量所違害者‧譬如於繩妄執為蛇及於陽燄\n"+
		"妄執為水‧雖是未觀實理識所執取‧然彼所取義‧由名言量而能違害‧故於名言亦無彼等。\n"+
		"如理觀察有無自性之正理無違害者‧謂於名言所立諸義‧雖名言量之所成立‧然正觀察\n"+
		"有無自性正理之識‧於一切種定須無害。若由彼理之所成立‧是由自性成立為有‧則違名\n"+
		"言之義。故無妄執理智無害與彼所成二事為一‧說於名言‧從諸善惡感生苦樂與自在自\n"+
		"性造生苦樂‧是則俱是‧非則俱非‧邪分別處。自在自性造生苦樂與善不善感生苦樂‧二雖\n"+
		"俱非觀察有無自性正理之所成立‧然以正理違不違害‧於一切種不相等故。又自他部諸\n"+
		"實事師‧不共欲樂遍計無時分方分之能取所取‧及神我自性大自在等‧彼師立時‧是以道\n"+
		"理已觀自性是否如是‧次自亦謂是由如是觀察正理‧已得彼義而後安立。故於彼義‧以餘\n"+
		"觀察有無自性正理觀察‧亦應受許。以許彼義是堪正理所觀察故。如是觀時‧若不能堪無\n"+
		"垢正理觀察重擔‧故彼非是正理所得‧即便遮遣‧以彼若有‧須此正理所獲得故。色聲等者‧\n"+
		"唯於無內外亂緣所損名言諸識‧如其共許而為安立。非觀彼等唯名言耶‧亦實義如是耶‧"
		,
		/*===========================第 444 頁===========================*/
		"由彼觀察獲得自性‧然後乃許。故於彼等‧不可以觀察有無自性之理而為觀察‧以未許彼\n"+
		"義堪忍正理觀察故。等如有人‧說此是羊‧不可觀察是馬是象。又於世間‧雖是無始共許之\n"+
		"義‧若理所害則於名言亦定非有‧如由無明於諸法上增益自性‧及薩迦耶見執有自性我\n"+
		"及我所‧及執昨日山為今日山等諸境界‧故非世間所許一切‧中觀諸師便於世俗而遍受\n"+
		"許。又色聲等‧於名言中與諸外道妄執假立‧有無不同之理‧有說前者‧一切世間皆可共許‧\n"+
		"後唯邪宗乃稱說故。此未能判別‧若不爾者‧於名言中應無如幻色等‧應有自性所成‧此過\n"+
		"繁多。六十正理論釋云‧「又顛倒者‧謂執樂等‧雖於世俗諸法亦非住彼性故。不顛倒者‧謂\n"+
		"執苦等‧於世俗中諸法容有彼體性故。」此說常恆等四‧雖於世間共同稱許‧然執是為彼\n"+
		"雖於世俗亦說為倒‧無常等四‧雖於世間未遍稱許‧然執是彼則不顛倒。如是執蘊為無常\n"+
		"等之分別‧雖於現境有所錯亂‧然於執境無量能害‧故名不倒或不錯亂。諸根之識‧於現境\n"+
		"錯亂‧又無所餘無錯亂分‧故不名無錯亂。又諸根識‧於所顯現錯亂雖同‧然如所顯義‧就世\n"+
		"間有無‧則現影像等之根識‧是邪世俗。除此諸餘無損根識‧是正世俗。又諸分別執蘊常等\n"+
		"之境名言中無‧故可破除。然執無常等之境名言中有‧故非正理所能破除。又於勝義‧或由"
		,
		/*===========================第 445 頁===========================*/
		"自性所成常等四法‧而非是有‧如是於彼二中‧無常等四亦是非有‧故觀待真實‧執有彼八‧\n"+
		"全無是倒非倒之別。故密意說‧「隨行色常無常苦樂有我無我皆行於相。」\n"+
		"　　若謂若以正理‧破於諸法增益自性無明之執‧而不破壞名言諸義‧二者相違。入中論\n"+
		"云‧「癡覆自性故世俗‧由此偽法現諦實‧佛說彼是世俗諦。」此說由無明增上安立色等\n"+
		"為世俗諦故。答曰‧無過。立色聲等為世俗諦之諦‧是由意樂增上為諦。此意須是諦執‧故於\n"+
		"增益自性無明而為諦。故於已斷染污無明二阿羅漢及八地以上諸菩薩前‧所現諸法唯\n"+
		"虛偽性非諦實性‧以無諦實增上慢故。論說於諸無實執者‧唯現世俗‧其理即此。故色聲等‧\n"+
		"雖由無明立為諦實‧然非由無明立色聲等‧譬於執繩為蛇之邪識‧雖繩為蛇‧然繩非由彼\n"+
		"邪識安立。其能安立色聲等之心‧謂無損害眼等六識。故此所立義名言中有‧非是正理所\n"+
		"能破除‧其無明所執‧雖於世俗亦非有‧以此是於諸法增益自性‧如此自性‧雖於名言亦定\n"+
		"無故。是故正理雖於名言亦能破除‧假若正理不能破此‧則於名言不能成立諸法如幻。又\n"+
		"於愚癡所增自性‧次更增益愛非愛等諸差別相起貪瞋等‧故以正理亦能破壞貪等行相。\n"+
		"如四百論釋云‧「貪等唯於癡所遍計諸法自性‧而更增益愛非愛等差別而轉‧故非異癡"
		,
		/*===========================第 446 頁===========================*/
		"而轉‧必依於癡‧癡最勝故。」此諸煩惱‧雖是無始俱生而轉‧然彼行相正理能破‧故彼所著\n"+
		"境‧名言亦無。是故俱生心有二境‧謂以正理能不能破。其能安立此色聲等諸名言量俱生\n"+
		"之境‧名言中有‧非以正理所能破除。如是佛護論師及月稱論師宗中‧雖於名言亦破自性‧\n"+
		"故名言諸義極難安立。若未善知安立彼等離諸妨難‧則於行品不能善得定解‧現見多成\n"+
		"毀謗惡見‧故具慧者‧應當善巧此宗安立世俗之理‧恐繁不說。\n"+
		"　　第三觀察是否四句所生而為破除‧顯不能破。由破自‧他‧俱‧無因生‧若能破生‧則四句\n"+
		"生雖於名言此宗說無‧故於破生不須簡別。若不能破‧則破四生亦不能破勝義之生。前說\n"+
		"非許‧當答後難。若許勝義之生‧須許堪忍觀真實性正理觀察。爾時須以正理觀察自他等\n"+
		"四從何句生‧由許勝義生‧故定須許四句隨一觀察。若僅受許依此因緣有此生起‧未許實\n"+
		"生。未許彼故‧云何能以觀真實之理‧觀從自他等何者而生‧以不須許堪忍正理所觀察故。\n"+
		"又依緣生‧即能破除四句之生‧入中論云‧「諸法依緣起‧非分別能觀‧故此緣起理‧斷諸惡\n"+
		"見網。」故月稱論師‧許依緣生破四句生‧汝若許不從四句生則全無生‧故違月稱所許而\n"+
		"說。又彼論云‧「無因自在等‧及從自他俱‧非能生諸法‧是故依緣生。」如汝則成自語相違‧"
		,
		/*===========================第 447 頁===========================*/
		"故依緣而生之緣起‧永離四邊。莫更問云‧離四邊者為四何邊‧此等亦是未分無生自性無\n"+
		"生二者差別而成過失。云何論說‧「真實時若理‧觀從自他生‧非理以此理‧名言亦非理。」\n"+
		"此顯若許自相之生或實有生‧則於名言由彼正理亦能破除‧然非破生。即彼論結合文云‧\n"+
		"「若謂染淨之因須實體生‧此說唯餘言說存在‧何以故‧真實時等。」廣引彼頌‧其釋又云‧\n"+
		"「故自相生‧於二諦中皆悉非有‧雖非樂欲亦當受許。」故自性生是勝義生‧若此許者雖\n"+
		"名言許‧如彼勝義生而當破除。是此論師所許勝處‧故於名言亦不應許有自性生。\n"+
		"　　入中論云‧「如石女兒自體生‧真實中無世非有‧如是諸法由自性‧世間真實皆不\n"+
		"生。」若執自性無生或無生性謂全無生‧反難緣生與無性生二者相違‧呵為無耳無心。說\n"+
		"無性生‧未聞所說自性‧妄執無生意謂無耳‧及說自性未解其義‧意謂無心。如六十正理論\n"+
		"云‧「緣生即無生‧勝見真實說‧」其釋中云‧「若見緣起諸法自性皆不可得‧以依緣生者‧\n"+
		"即如影像‧無性生故。若謂既依緣生豈非是生‧云何說彼無生‧若云無生則不應說是依緣\n"+
		"生‧故此非理互相違故。噫唏嗚呼無心無耳‧亦相攻難‧此實令我極為難處。若時我說依緣\n"+
		"生法‧即如影像自性無生‧爾時豈有可攻難處。」故應珍重判彼差別。無熱惱請問經云‧"
		,
		/*===========================第 448 頁===========================*/
		"「若從緣生即無生‧於彼非有生自性‧若法仗緣說彼空‧若了知空不放逸。」初句說言\n"+
		"「緣生即無生‧」第二句顯示無生之理云‧「於彼非有生自性。」是於所破加簡別‧言謂\n"+
		"無性生。頗見一類‧聞彼諸句未解彼理‧專相違說‧「生即無生‧依即無依‧」狂言愈大‧知見\n"+
		"愈高。明顯句論引楞伽經云‧「大慧‧無自性生‧我密意說一切法無生‧」此說極顯。又破生\n"+
		"等應不應加勝義簡別‧義雖已答‧然分別答至下當說。此等皆是‧顯示彼一切能破‧皆不能\n"+
		"破無自性中因果建立。似能破中最究竟者‧謂自破他如何觀察‧即彼諸過於自能破無餘\n"+
		"遍轉。汝等所立‧即似能破最究竟者。以破他宗觀察正理害不害等皆被遮迴‧其能破理成\n"+
		"所破故。若謂汝許有色等‧故於彼等此觀察轉‧我等無宗故‧彼觀察不能轉入。此答不能斷\n"+
		"彼諸過‧於應成派及自續派‧何決擇時茲當宣說。\n"+
		"　　第四破除有事無事四句無能妨害。若謂中觀諸教典中‧破一切事‧或破自性有無二\n"+
		"俱二非四句無不攝法‧故以正理能破一切。此如前說事有二種‧若以自性所成之事‧隨於\n"+
		"二諦許何諦有皆當破除‧能作用事於名言中非能破除。又無事中‧若於無為許由自性所\n"+
		"成無事‧如此無事亦當破除‧如是之有事無事二俱當破‧有自性之俱非亦當破除。故一切"
		,
		/*===========================第 449 頁===========================*/
		"破四句之理‧皆當如是知。若未能加如此簡別而破四句‧破除有事及無事時‧作是破云‧\n"+
		"「俱非彼二。」次又破云‧「亦非非二。」是自許相違。雖知如是而云無過‧強抵賴者‧我等\n"+
		"不與瘋狂共諍。復次破蘊自性之體‧或破其我便發智慧‧了無自性或了無我。若復破慧無\n"+
		"自性境‧是為破壞中觀正見‧由破能達諸法無性智慧境故。若許雙破有無自性‧應問彼云‧\n"+
		"決定諸蘊無自性慧‧其境無性如何能破‧應當宣說。若謂中論云‧「若少有非空‧亦當有少\n"+
		"空‧若無少不空‧空亦云何有。」全無不空故‧無自性空亦非有。此中空不空者‧謂有自性空\n"+
		"與不空‧全論前後一切皆然。故性不空即是有性。若謂無少自性無性之空亦非有者‧更有\n"+
		"何事尤為可笑。如於苗芽執無自性時‧此決定解唯於苗芽執性非有‧俱不執云‧其無自性\n"+
		"為有為無‧應當閉目向內觀之極易明了。由是因緣‧於無自性不可執有‧為遣更執無性為\n"+
		"有‧故以正理破有空性。縱使應理‧然亦唯是更以餘心‧破除另執無性為有覺心之境‧若破\n"+
		"通達苗芽無性智慧之境極不應理。我等破除苗芽自性‧便決定解自性非有‧次由餘心縱\n"+
		"執無性是有‧然所執境亦非正理所破。若許空性是有自性‧則當破除。若爾於無自性‧云何\n"+
		"能起有自性執‧謂緣苗芽無自性時‧雖不執苗有自性‧然能起執苗之無性是有自性。如於"
		,
		/*===========================第 450 頁===========================*/
		"無瓶‧雖不執謂瓶實是有‧然能執謂無瓶是實。由是若說‧以無少許非自性空‧故芽無性空\n"+
		"亦無自性‧是為正因。四百論釋說‧是破有性之空‧如云‧「若所說空少有自性‧是則諸法亦\n"+
		"當有性。」為顯非有‧故說頌言‧「若無不空者‧空復從何生‧如無餘所治‧能治云何起。」不\n"+
		"爾若破無性之空‧則無無性。若爾則當有自性體‧於一切種性不可破。如迴諍論云‧「若即\n"+
		"無自性‧能遣無自性‧遮無自性已‧即成有自性。」自釋亦云‧「如云莫言即言遮言‧如是若\n"+
		"以無自性語遣法無性其喻應理。然此唯以無自性語‧破諸法性‧若無性言即能遣除諸法\n"+
		"無性‧破無性故諸法有性‧有自性故即非是空。」此說極顯。故前所引中觀論云‧「空亦云\n"+
		"何有‧」其後又云‧「諸佛說空性‧為出一切見‧若復見於空‧說彼無可治。」此說見於空者‧\n"+
		"非說凡見自性為空‧是說於性空之空執為諦實或見為實事。佛護論云‧「若執諸法有性\n"+
		"為彼說空‧謂由緣起因緣增上假名有事‧非是諸事實有自性‧由顯諸法自性空故‧能遣彼\n"+
		"執。若有於空執為實事‧誰亦不能破除其執‧譬如說云‧悉無所有‧若復乞云‧其無所有願當\n"+
		"惠施‧何能令彼了解為無‧」及喻顯說。若不爾者‧喻則不合‧猶如有一向他乞財‧說無財時‧\n"+
		"若作是念‧此人無財‧此執非過。若於無財反執為財‧爾時不能令知無財。若問諸法有無自"
		,
		/*===========================第 451 頁===========================*/
		"性‧告曰無性‧若執無性‧說者實欲令起是解‧彼豈是過。然於無性反執有性‧是為過失。若依\n"+
		"汝意說‧無財時執為無財‧亦當被破‧故依我說最為端嚴。明顯句論云‧「於空執事」非是\n"+
		"破空‧故唯見空亦非有過。故般若攝頌說‧「菩薩若執此蘊空‧行相非信無生處。」寶鬘論\n"+
		"說‧「諸見我無我‧故大能仁遮。」諸餘經論說‧不可起空無我見‧皆如前說應當了知。若不\n"+
		"爾者‧則舍利子問觀自在‧欲行甚深般若波羅蜜多當云何學‧答云‧「應正隨觀彼諸五蘊\n"+
		"皆自性空。」攝頌云‧「遍知諸法無自性‧是行般若波羅蜜。」入中論云‧「故由觀我我所\n"+
		"空‧此瑜伽師當解脫‧」此等多能與彼相違。是故一切衰損根本‧即是增益自性無明‧而能\n"+
		"與彼行相正反‧拔除彼者‧唯達無性或無我慧。若破此相即破真實義見‧雖非所樂然須受\n"+
		"許。四百論云‧「無二寂靜門。」釋云‧永盡貪愛是能證得涅槃之因‧除無性見更無少法‧是\n"+
		"能如是盡貪之因‧故無自性為相無我‧是無第二寂靜之門‧趣涅槃城‧此乃無等唯一之門。\n"+
		"雖亦有空無相無願三解脫門‧然唯無我正見最勝‧由了諸法悉皆無我‧一切法貪無餘永\n"+
		"盡‧豈於少法見少可求或相可緣。故唯無我是無第二寂靜之門。是故菩提資糧論云‧「無\n"+
		"自性故空‧是空取何相‧遣一切相故‧智者何所願。」此將經說三解脫門‧與此處說唯性空"
		,
		/*===========================第 452 頁===========================*/
		"見一解脫門‧斷相違失‧以教理成此為解脫門。斷性之境何須更破‧以證彼者即能對治二\n"+
		"我相執‧於彼全無相執氣故。若於如此分別亦見過患‧善惡分別悉破除者‧顯然欲樹支那\n"+
		"堪布所遺教規。\n"+
		"　　第二破所破太狹。有作是言‧所破自性具三差別‧一自性非由因緣所生‧二時位無變‧\n"+
		"三不待他立。如中論云‧「自性從因緣‧出生則非理‧若從因緣生‧性應成所作。若性是所作‧\n"+
		"云何應道理。自性非新作‧及不觀待他。」若許芽等內外諸法有如是性‧中觀諸師雖亦須\n"+
		"破‧然於此中明所破者是當明其所破根本‧由破彼故‧須於相續生中觀見‧證法無性。諸有\n"+
		"為法是因緣生及有變壞‧自部諸師皆共極成‧對彼不應更成無性‧彼亦應達諸法無性。有\n"+
		"是等過‧故彼豈是不共所破。雖中觀論多難彼云‧「若有自性‧應不待因緣及不變等。」是\n"+
		"就能遍說彼過失‧非就所破當體而明。又勝義有及真實有並諦實有‧亦應不由因緣生等‧\n"+
		"然彼非是勝義等義。譬如於瓶雖遍無常‧然非無常即是瓶義‧雖立大腹等為瓶之義。如是\n"+
		"若勝義有等‧雖應許為無方分法‧然非無方分法即根本所破‧以彼唯是宗派妄執不共假\n"+
		"立‧此執非諸有情繫縛生死之本故。又雖決擇彼無自性極善修習‧然於無始無明妄執全"
		,
		/*===========================第 453 頁===========================*/
		"無違害‧即使究竟現證彼義‧然終不能遣除俱生諸煩惱故。故以正見善決擇時‧若不了知\n"+
		"正為決擇俱生無明所執義無‧於彼支分破除分別所執諸境‧不破俱生無明行相。破人我\n"+
		"時‧惟破常一自在之我‧破法我時‧唯破無分極微所取‧及破能取無分剎那‧並破具三差別\n"+
		"自性等宗派假立諸法‧於一切種決定不可。若不爾者‧決擇見時唯決擇彼‧修時亦應唯修\n"+
		"習彼‧以決擇見義為修故。故修已觀證及修究竟亦唯應爾‧如是由見無彼分別執計二我‧\n"+
		"便謂已斷俱生煩惱‧太為過失。入中論云‧「證無我時斷常我‧非許此為我執依‧故達無我\n"+
		"為盡拔‧我見根本最希有。」釋論亦云‧「為以喻門顯示此義互無係屬‧故說頌曰‧見自室\n"+
		"有蛇‧除畏云無象‧謂能除蛇怖‧奇哉為他譏。」此雖是說補特伽羅無我‧然法無我亦同。可\n"+
		"作是說‧「證無我時斷妄我‧不許此為無明依‧故知無我謂盡拔‧無明根本甚希有。」若爾\n"+
		"論師如前所引‧說非新作及不待他為自性相‧此說為就觀察門耶抑為許有如是性耶。說\n"+
		"彼即是諸法法性‧即於彼上立為自性‧非是新作非依仗他。彼性是有‧入中論釋云‧「論師\n"+
		"許有如是差別行相性耶‧世尊依何增上廣說‧隨諸如來出不出世‧諸法法性恆如是住‧有\n"+
		"彼法性。所言法性‧此復云何‧即此眼等自性。眼等自性復為何等‧謂彼非新作性無待於他。"
		,
		/*===========================第 454 頁===========================*/
		"離無明翳智所證性為有此耶‧誰云其無。彼若無者為何義故‧諸菩薩眾修習波羅蜜多諸\n"+
		"道‧為證法性。故諸菩薩發起如是多百難行。」並引經證而善成立。於前豈非破一切法有\n"+
		"自性耶‧我等豈未多次宣說諸法‧若非由內心立其自性有‧塵許亦無‧於如此性‧雖法性勝\n"+
		"義諦亦無少許‧況諸餘法。明顯句論云‧「三世無亂非由新造作火之本性‧此非先無後新\n"+
		"生起‧非待因緣。如火熱性‧或彼此岸或長與短‧當知說此名為自性。火如是性為可有耶‧然\n"+
		"此亦非由自性有亦非全無‧雖然如是‧為令聞者離恐怖故‧增益強說世俗中有。」即於此\n"+
		"性亦破自性說名言有。若謂此說為斷聞者恐怖故‧增益說即不許有。此不應理‧餘法皆是\n"+
		"為彼假說‧彼亦應無。又如前引‧若無彼義‧則修梵行應空無義‧說彼過難‧成立此有。入中論\n"+
		"釋云‧「又此自性非唯論師自許‧亦能教他受許此義‧故此自性‧是於兩俱建立極成。」不\n"+
		"爾則應許中觀宗不得解脫。得涅槃者現證涅槃‧復說涅槃即是滅諦。又說彼是勝義諦故。\n"+
		"無勝義諦故‧得涅槃時必須現證勝義滅諦‧六十正理論釋‧以多力勵已善成立。由是眼等\n"+
		"有為‧於自性體非可為有‧於以法性所立性中‧亦不可有‧故隨於何性皆悉不成‧真勝義諦\n"+
		"雖於法性所立性中‧而可為有‧然立此性非無新作及不待他‧於自性體亦無少許‧故亦唯"
		,
		/*===========================第 455 頁===========================*/
		"於名言說有。言新作者‧謂先無新生之所作性。不待他者‧謂不待因緣。色等諸法‧於二自性‧\n"+
		"悉不成立。故於法性所立自性‧為見彼性而修諸道‧所修梵行非空無義。又說畢竟不許諸\n"+
		"法有自性體‧與今忽爾許有自性二不相違。入中論釋云‧「奇哉錯誤‧若已不許少許實事‧\n"+
		"忽許自性非由新作不觀待他‧汝乃專說互違義者‧茲當宣說。汝未了知此論意趣‧此論意\n"+
		"趣謂說眼等緣起本性‧愚稚異生所能執取。若彼即是彼法自性‧其性顛倒‧為證彼故而修\n"+
		"梵行‧則空無義。由非即彼便是自性‧故為見自性‧修淨梵行則有義利。此復我由待世俗諦‧\n"+
		"說非新作及不待他。若性非是愚夫所見‧此為自性亦應正理。僅以此故勝義非事‧亦非無\n"+
		"事。此即自性寂靜性故。」此中有事無事‧如前宣說二邊時說‧謂自性有及畢竟無。\n"+
		"　　如是決擇諸法無微塵許自性實體‧此由自性所空空性‧於色等法差別事上‧此為能\n"+
		"別法。故於一心之境‧有彼二事‧非為相違。由其未能遣二相故‧此空是為假勝義諦。若修能\n"+
		"達無性正見‧現證彼義實無自性‧現似有性一切亂相於彼悉遣。故此現證法性之智‧不見\n"+
		"色等。如是之法及法性‧於彼慧前二皆非有。故立彼二為法及法性者‧是就其餘名言識立。\n"+
		"由是因緣‧勝義諦者‧是於寂滅一切自性戲論之上‧更離無性現似有性一切戲論‧而為安"
		,
		/*===========================第 456 頁===========================*/
		"立。故許彼有‧豈須許有自性自體。明顯句論云‧「無明翳力緣諸事相‧由不見彼‧此性即是\n"+
		"離無明翳‧聖人之境‧即立此性為彼自性。」又云‧「諸事之無生自性‧此復俱非。唯屬無事\n"+
		"無體性故‧非於諸事自性中有。」又有許勝義諦‧不於所斷二我戲論而為安立‧謂於能證\n"+
		"真實之心無亂境中‧自現在相‧如青黃等。又以知如是有‧便為通達深義正見。又謂通達內\n"+
		"外諸法‧有情執為二我所依‧為無自性‧是正見歧途。此出一切大乘小乘經教之外‧由許破\n"+
		"除一切有情繫縛生死根本我執。然說通達我執所計我事‧無性不能遣執‧而說通達與彼\n"+
		"無關餘實有法‧反能遮遣我執縛故。譬如東方無蛇‧妄執為有恐怖憂苦‧為遣彼苦‧而說令\n"+
		"達東方無蛇‧不能遣其蛇執‧當令別執西方有樹‧方能除遣蛇執憂苦‧與此說者全無差別。\n"+
		"諸自愛者‧應當遠棄如此邪執‧次於破除繫縛生死‧一切衰損根本無明行相之方便‧謂當\n"+
		"依止建樹諸了義經‧及將經義不令向餘引轉諸正理聚聖者龍猛父子論典‧度越三有大\n"+
		"海彼岸。由於所破破除邪執‧是於得中觀斷除歧途‧最為切要‧故今廣說。\n"+
		"<b>菩提道次第廣論卷十九終</b>"
		,
		/*===========================第 457 頁===========================*/
		"<b>菩提道次第廣論卷二十</b>\n"+
		"<b><s>　第三明自宗所破分三‧<n>一</n>正明所破義‧<n>二</n>於餘所破加不加此之理‧<n>三</n>釋於所破應不應加勝義簡\n"+
		"　別。　　今初</s></b>\n"+
		"　　總所破事略有二種‧謂道所破及理所破。初如辨中邊論云‧「於諸煩惱障‧及以所知\n"+
		"障‧此攝一切障‧盡此得解脫。」謂煩惱及所知二障‧此所破事於所知有‧此若無者‧應一切\n"+
		"有情不加功用而得解脫故。理所破者‧如迴諍論云‧「又有於化女‧起實女邪執‧以化而破\n"+
		"除‧今此亦如是。」自釋中云‧「若有士夫‧於自性空變化婦女‧謂是實女而起邪執‧邪執彼\n"+
		"故遂起貪愛。次有如來或如來弟子變一化身‧以此化身遮彼邪執‧如是我語空如變化‧於\n"+
		"一切法無性本空‧等同化女‧遮遣邪執為有自性。」此說邪執為所破事‧及彼所執實有自\n"+
		"性亦為所破‧故有二種。然正所破厥為後者‧以破顛倒心須先破彼所執境故。如緣起因破\n"+
		"人法上所有自性‧故此所破須所知中無‧有則不能破故。雖如是無‧然能發生增益執有‧故\n"+
		"定須破。破除之理‧亦非如以錘擊瓶‧是於無令起知無定解。若定解無‧即能遮遣執有亂識。"
		,
		/*===========================第 458 頁===========================*/
		"如是以理成立‧亦非如種發芽先無新生‧是於如是法起決定智‧知其如是。迴諍論云‧「雖\n"+
		"無能破語‧其無亦成立‧然此語云無‧令解非令除。」自釋中云‧「雖無汝語‧若無之滅亦本\n"+
		"成立‧何為更說一切諸法皆無自性‧汝說彼語有何作為。此當為釋說一切法皆無自性‧非\n"+
		"由此語令一切法成無自性‧然說諸法皆無自性‧是令了解破無自性。譬如天授原未在家‧\n"+
		"有云家有天授‧有於無彼說云其無‧此語非令天授成無‧唯顯天授家中非有。如是說云‧諸\n"+
		"法無性‧非由此語令其諸法成無自性‧然一切法皆無自性。諸愚眾生‧為無明蔽增益自性‧\n"+
		"如於幻士愚其原無士夫實體‧唯為令解自性非有。故汝說云‧若性非有‧即無語言‧不假語\n"+
		"言‧自性非有亦極成立。說無自性此語何為。此諸言說皆不應理。」此說極顯‧當如是知。故\n"+
		"有說云‧有不能破‧無不須破‧離諸破立‧以多破立正理觀察‧唯練名言‧此全未見正理及道\n"+
		"破立影像相違亂言‧自現宣說‧有不能破無不須破之因‧破斥他人破立觀察‧而謂不應破\n"+
		"立故。又以所立之因‧破斥他許之破立‧不應正理。有不能破無不須破故。以正理破者‧是為\n"+
		"遮遣顛倒錯亂之分別。以正理立者‧是能引發無倒定解之方便。故欲遣邪執及欲生正覺‧\n"+
		"定當隨行龍猛等之正理眾論‧於無倒破立引生定解。"
		,
		/*===========================第 459 頁===========================*/
		"　　如是以正理破‧若是由破倒執‧為欲引發無倒定解者‧當以正理破何心之境耶。總所\n"+
		"破分別‧雖無邊際‧然以何顛倒分別而為一切過失之根本‧當先明彼破其所執之境。若能\n"+
		"破彼則一切過失悉遮遣故‧經說貪等諸餘對治‧是一分之對治‧說無明對治是一切之對\n"+
		"治。無明即是一切過失之根本‧如明顯句論云‧「佛依二諦說‧契經等九部‧就諸世間行‧於\n"+
		"此廣宣說。其為除貪說‧不能斷瞋恚‧為除瞋故說‧亦非能盡貪‧為斷慢等說‧彼不壞餘垢‧故\n"+
		"彼非廣遍‧彼皆無大義。若為斷癡說‧彼盡壞煩惱‧諸佛說一切‧煩惱皆依癡。」何者為癡‧謂\n"+
		"執內外諸法由自相生‧增益自性之心‧此為無明。如四百論釋云‧「若識增益諸法自性‧由\n"+
		"彼染污無知增上貪著諸法‧是為流轉生死種子‧於一切種永滅除故‧即便安立生死還滅。\n"+
		"為顯此義故說頌云‧『三有種為識‧境為彼行境‧若見境無我‧三有種當滅。』此顯由見境無\n"+
		"自性‧於一切種破除貪因三有種識‧安立聲聞獨覺及得無生法忍菩薩生死還滅。」又即\n"+
		"說彼是為實執‧如身根於身‧愚癡遍安住‧故壞癡能壞一切諸煩惱。四百論釋云‧「癡於諸\n"+
		"法分別諦實極愚蔽故‧遂於諸法增益實性而轉。」\n"+
		"　　如是若無明是生死根本‧則入中論與顯句論‧說薩迦耶見為生死根本不應道理‧主"
		,
		/*===========================第 460 頁===========================*/
		"要之因無容二故。其無明與薩迦耶見‧餘師所許中士道時已宣說訖。此說月稱論師所許‧\n"+
		"餘中觀師許為所知障之執法諦實‧此許為無明‧且是染污無明。如前所引四百論釋‧說為\n"+
		"染污。入中論釋云‧「由此能令諸有情類‧於觀如所住事而起愚蒙‧故愚癡無明‧法非有性\n"+
		"而強增益‧於見自性障覆為性‧名曰世俗。」又云‧「如是由有支所攝染污無明增上力故‧\n"+
		"建立世俗諦。」說為十二緣起初支‧故是染污非所知障。若爾‧何為所知障耶‧此後當說。故\n"+
		"十二支中初無明支‧是生死根本‧又說薩迦耶見為生死根本者。以無明是總‧薩迦耶見是\n"+
		"別‧故不相違。其無明者‧謂明相違品‧其明亦非任隨何明‧是了無我真實義慧。其相違品‧非\n"+
		"唯無慧及所餘法‧是須與彼相違執者‧即增益有我。此復有二‧謂增益法我及增益補特伽\n"+
		"羅我。故法我執與補特伽羅我執‧俱是無明。是故宣說薩迦耶見為餘一切煩惱根本‧非不\n"+
		"宣說無明為本。「乃至有蘊執‧爾時有我執‧」此說法我愚之無明‧為補特伽羅我愚之因‧\n"+
		"顯示無明內中二執因果之理。故說薩迦耶見除無明外‧為餘一切煩惱根本‧皆無相違。若\n"+
		"不了知如是解釋論師意趣‧則說生死有二根本‧其相違過極難斷除。如是明無明之理‧乃\n"+
		"是龍猛菩薩所許。如七十空性論云‧「因緣所生法‧若分別真實‧佛說為無明‧彼生十二支‧"
		,
		/*===========================第 461 頁===========================*/
		"見真知法空‧無明則不生‧此是無明滅‧故滅十二支。」中論二十六品云‧「若永滅無明‧諸\n"+
		"行當不生‧能滅無明者‧由知修真實。由前彼彼滅‧後彼彼不生‧純一大苦蘊‧皆當如是滅。」\n"+
		"又與「乃至有蘊執」說執蘊為生死根本‧極相符順。又是聖天所許‧如前所引「如身根\n"+
		"於身」等‧及「生死本為識」等‧顯了宣說。又阿闍黎於中論等盡其所說‧破除所破‧所有\n"+
		"正理‧一切皆為破除愚癡‧於諸法上增益自性‧而顯諸法皆無自性。故所說種種正理‧皆是\n"+
		"唯為破無明執。如佛護論云‧「為何義故宣說緣起‧答云‧阿闍黎耶大悲為性‧見諸有情為\n"+
		"種種苦之所逼切‧為解脫故‧欲顯諸法真如實性‧隨說緣起。故云‧見非真繫縛‧見真實解脫。\n"+
		"何為諸法真實性‧答曰‧謂無自性。諸不智者‧由愚癡闇障蔽慧眼‧而於諸法分別自性。由是\n"+
		"彼等遂起貪瞋‧若時了知緣起‧發慧光明除愚癡闇‧由智慧眼照見諸法無自性性‧爾時無\n"+
		"所依處‧貪瞋不生。」第二十六品結合文云‧「問云‧汝已宣說以大乘數‧轉入勝義‧汝今當\n"+
		"說以聲聞教轉入勝義‧答曰‧無明覆後有」等。第二十七品結合文云‧「問云‧汝今當依順\n"+
		"聲聞乘契經邊際‧顯示惡見行相非有‧答曰‧說過去時生」等。故佛護論師‧亦許增益諸法\n"+
		"自性‧為十二支初支無明‧及許聲聞獨覺證法無我‧極為明顯。是故聲聞獨覺證法無性‧最"
		,
		/*===========================第 462 頁===========================*/
		"大能立‧當知即此以法我執為十二支無明之理。四百論云‧「縛為分別見‧彼是此所破。」\n"+
		"其分別者‧非說一切分別‧是說增益諸法自性之分別。釋論云‧「分別者‧謂增益非真自性\n"+
		"之義。」又許彼是染污無明‧若說凡是「念此為此‧」一切分別之境‧皆是正理所破者‧是\n"+
		"全未詳細觀察。若不爾者‧其真實義‧於諸異生非現見故‧除分別外無餘方便能解空義。若\n"+
		"謂一切分別之境‧皆理所違害‧則定智之境‧亦如增益自性錯亂邪識。若爾‧應無正見導赴\n"+
		"涅槃‧於中觀等論勤聞思等一切無果。四百論云‧「言我般涅槃‧非不空見空‧如來說邪見‧\n"+
		"不能般涅槃。」又以前說無明所執之境為根本‧自他宗部諸師‧而更增益眾多差別。若拔\n"+
		"無明所執之境‧如拔樹根‧則由邪宗一切假立一切俱斷‧故具慧者當知俱生無明所執之\n"+
		"境‧為所破之根本‧不應專樂破除宗派妄計分別。以破所破者‧非無事而尋事‧是見邪分別\n"+
		"心執所破事‧繫縛有情流轉生死‧故破其所境。能於生死繫縛一切有情者‧是俱生無明故。\n"+
		"分別無明唯邪宗方有‧為生死本不應理故。故能於此分別決定‧極為切要。\n"+
		"　　如是計執所破究竟之邪分別‧即十二支之初支‧俱生無明。分別所破‧亦以彼為根本‧\n"+
		"唯是增益。故根識等無分別識‧一切行相‧終非正理之所能破。故正理所破之心‧唯屬分別"
		,
		/*===========================第 463 頁===========================*/
		"意識。後以二種我執或於我執所計之境‧增益差別諸分別心‧非謂一切分別。由彼無明如\n"+
		"何增益自性之理者‧總此論師之論中‧雖於諸世俗義‧亦云自性或自體等‧設立多名。然此\n"+
		"中者‧謂於諸法或補特伽羅‧隨一之境非由自心增上安立‧執彼諸法各從自體‧有本住性\n"+
		"即是其相‧如彼取境之諸法本體‧或名曰我或名自性‧是就假觀察而明。如云‧「此皆無自\n"+
		"性‧是故我非有‧」四百論釋云‧「若法自性自體自在‧不仗他性。」此說彼諸異名‧不仗他\n"+
		"者‧非謂不仗因緣‧是說有境名言之識為他‧非由彼增上安立為不仗他。言自在者‧謂彼諸\n"+
		"境各本安住不共體性‧即彼亦名自性自體。此如計繩為蛇‧其蛇唯就妄執之心假計而立。\n"+
		"若觀何為彼蛇自性‧則於境上蛇全非有‧故彼差別無可觀察。如是諸法‧亦唯於名言識‧如\n"+
		"所顯現觀察安立‧若於境上觀察諸法本性如何‧全無所有‧不如是執‧謂非唯名言識增上\n"+
		"安立‧執彼諸法各由自體有可量見本安住性。如四百論釋云‧「唯有分別方可名有‧若無\n"+
		"分別則皆非有‧此等無疑如於盤繩假計為蛇‧定非由其自性所成。」此說自性所成之相。\n"+
		"故若非由內心增上安立‧於其境上就自性門有所成就‧說彼為我或名自性。若於差別事\n"+
		"補特伽羅境上無此‧名補特伽羅無我。若於眼等法上無者‧名法無我。由此當知‧若於法上"
		,
		/*===========================第 464 頁===========================*/
		"及補特伽羅執有此性‧是二我執。如四百論釋云‧「所言我者‧謂若諸法不依仗他‧自性自\n"+
		"體。若無此者‧是為無我。此由法與補特伽羅有差別故‧當知有二名‧法無我及補特伽羅無\n"+
		"我。」\n"+
		"　　若謂執補特伽羅有自相‧為補特伽羅我執‧不應道理。若不爾者‧緣他補特伽羅執有\n"+
		"自相‧亦應是補特伽羅我執。若爾應成薩迦耶見‧彼不執我薩迦耶見‧不應理故。執補特伽\n"+
		"羅有自性者‧理應許為補特伽羅我執‧如前說補特伽羅有性‧為補特伽羅我故。然非補特\n"+
		"伽羅我執‧皆是薩迦耶見。若爾何為薩迦耶見我執‧薩迦耶見分別我執。如正量部一分說\n"+
		"緣蘊執我‧雖無決定‧然俱生我執‧入中論中破蘊為所緣‧釋說緣依蘊假立之我‧故非緣蘊‧\n"+
		"唯緣補特伽羅。復須可執為我之補特伽羅‧故他補特伽羅亦非所緣。於此所緣執相云何‧\n"+
		"入中論釋云‧「薩迦耶見執我我所行相而轉。」謂非但執有自相‧須執為我。入中論釋云‧\n"+
		"「唯薩迦耶見是所應斷‧此由悟入無我之我‧即能斷除。」此說通達所緣之我‧無其實我\n"+
		"或無自性‧由其行相相違而斷‧故是執著慧相違品‧此後是執補特伽羅有自性‧即是執有\n"+
		"自相之我‧執有我所薩迦耶見‧亦當了知。若不執為我及我所‧唯執實有補特伽羅‧即愚補"
		,
		/*===========================第 465 頁===========================*/
		"特伽羅我之無明‧非不染污。由是因緣‧以有自性所立之我及念我心取境之我‧二中初者\n"+
		"是正理所破‧後者許名言有‧故非所破。此顯不破薩迦耶見俱生所緣‧然非不破彼執行相\n"+
		"自性之我。譬如不破執聲為常所緣之聲‧然破彼執境之聲常‧無有相違。故聖父子及此二\n"+
		"論師之論中‧「若自性有‧若自體有‧若自相有‧若是實有。」其自性等應知如前所說。顯無\n"+
		"彼之句義‧當知亦是顯示無明所執之義無。\n"+
		"　　第二於餘所破加不加之理。若石女兒及兔角等‧諸畢竟無直可云無‧不須簡別。如是\n"+
		"雖於所知有‧然依時處‧有有‧有無‧若說彼時處無‧亦不須簡別。若中觀師雖於名言不許彼\n"+
		"有‧唯由自他實事諸宗‧不共增益‧破彼等時雖就意樂‧有時須加‧然實無須新加自性簡別‧\n"+
		"以彼諸宗已許彼義故。除彼所餘中觀諸師‧於名言中所立諸義‧任破何義皆須簡別。若不\n"+
		"簡別‧則於能破之正理‧過失同轉唯成似破‧又如前說中觀諸師‧於名言中所立諸義‧必須\n"+
		"觀察有無自性之正理及名言量所不能害。若不爾者‧則於名言不許大自在等‧而許色聲\n"+
		"等所有差別全不得成。云此是道此是非道。此宗應理此不應理等‧世出世間‧皆無安立之\n"+
		"方便。於自性空生死涅槃一切建立‧皆應正理之特法不可成故。若量無害而欲破彼‧是為"
		,
		/*===========================第 466 頁===========================*/
		"智者輕笑之處‧故破彼時定當簡別。四百論釋及六十正理論釋‧破所破時有極多處‧加彼\n"+
		"簡別。中觀本論及佛護釋‧明顯句釋‧並入中論本釋等中‧亦多處加‧因見文繁及多已加‧意\n"+
		"其未加亦易通達。故未加處亦定須加‧由彼無少加與不加差別理故。又云‧「觀察非有‧」\n"+
		"亦有多加觀察之簡別者‧此如前說‧若有自性‧須許觀察實性正理之所能得‧由未得故則\n"+
		"無自性當知與說無有自性‧同一宗要。如四百論釋云‧「設此諸法‧非如火輪及變化等‧唯\n"+
		"現欺誑而無實事‧爾時若以正理觀察‧定如金等自性可緣最極顯現‧然彼唯由顛倒因生‧\n"+
		"若以觀察慧火燒煉‧其性非有。」\n"+
		"　　第三釋於所破應不應加勝義簡別。說於所破加勝義簡別‧唯是中觀自續派者‧極不\n"+
		"應理。入中論釋引佛母云‧「長老須菩提‧豈無所得無所證耶‧須菩提曰‧長老舍利子‧雖有\n"+
		"所得亦有所證‧然非二相之理。長老舍利子其得證者‧是依世間名言而立。預流一來不還\n"+
		"阿羅漢獨覺菩薩‧亦依世間名言而立‧若勝義中無得無證。」須如是許‧豈謂入中論釋所\n"+
		"引為自續派之經耶‧如是諸了義經加勝義簡別者‧實亦繁多。七十空性論云‧「住生滅有\n"+
		"無‧劣等或殊勝‧佛依世間說‧非是依真實。」寶鬘論云‧「言有我我所‧此於勝義無。」又云‧"
		,
		/*===========================第 467 頁===========================*/
		"「若種子虛妄‧其生豈諦實。」又云‧「如是世如幻‧雖現有生滅‧然於勝義中‧生滅皆非\n"+
		"有。」於所破加勝義諦實真實者極多‧未加彼時亦多加無自性自體自相等簡別。佛護論\n"+
		"云‧「諸佛說正法‧正依於二諦‧世間世俗諦‧及以勝義諦。」若以世間世俗諦故‧可說有瓶\n"+
		"有席‧即以此故‧亦可說彼無常瓶壞席燒。若時意依真實‧爾時瓶席唯是假名且不應理‧況\n"+
		"其壞燒云何應理。復次‧如來若以世間世俗增上可說無常‧謂如來老及說如來已般涅槃。\n"+
		"若時意樂依於勝義‧爾時如來且不應理‧況老涅槃云何應理。月稱論師說破實生‧非破有\n"+
		"生‧如六十正理論釋云‧「若於何相影像可得‧緣生虛妄‧我不說彼現可得者‧名為無生‧然\n"+
		"於何性立為無生‧即於彼性說為無生。為於何性立無生耶‧謂許實自性非虛妄性‧以許彼\n"+
		"於妄性為緣起故。」此說不破虛妄幻生唯破實生‧故說緣生與性無生二不相違‧即前論\n"+
		"云‧「生與無生二境異故‧有何相違。」又云‧「若時我說緣生‧即性無生‧猶如影像‧爾時何\n"+
		"有攻難之處。」此答緣生與性無生相違之諍。入中論云‧「由此次第‧當知法實性無生‧世\n"+
		"間生‧」此於無生加實性簡別。又云‧「如此瓶等實性無‧而於世間許為有‧如是一切法皆\n"+
		"成‧故無過同石女兒。」此說內外一切諸法‧於真實無‧於名言有‧故非於所破不加勝義之"
		,
		/*===========================第 468 頁===========================*/
		"簡別。總於所破‧若全不許加勝義簡別‧則不可立二諦差別‧謂於勝義如此如此‧及於世俗\n"+
		"如此如此‧全未說有如此之中觀師‧故唯邪分別。明顯句論破「於所破加勝義之簡別」\n"+
		"者‧是就破自生‧非唯破生‧釋中極顯。入中論云‧「阿闍黎耶未加簡別‧總云『不自』而破其\n"+
		"生‧若簡別云‧『諸法勝義不自生‧有故‧如有思‧』當知其勝義之簡別‧全無義利。」故中觀自\n"+
		"續師與應成師‧非就於所破加不加勝義簡別判之為二‧然於名言破不破自性則有差別。\n"+
		"若於內外諸法破自性時‧如應成派則不須新加或勝義或真實或諦實之簡別‧以有自性‧\n"+
		"即已成為勝義等故。若自續派於彼不加勝義等者‧則不能破‧故加勝義或真或諦。然於生\n"+
		"滅及繫縛解脫等‧若不簡別或云勝義或自性等而說能破‧兩派中觀俱所不許。\n"+
		"　　若爾何為勝義無之義‧此中義謂所知‧勝謂第一‧二同一事。又勝謂無分別智‧彼智之\n"+
		"義或境故名勝義。又無分別智現證勝義‧順彼之慧說名勝義。如云‧「此中諸地等‧於勝義\n"+
		"無生。」熾然分別論釋云‧「言勝義者‧是所知故名義‧即所觀所了之增語。勝是第一之異\n"+
		"名‧略云勝義。謂此是義復是最勝故名勝義。又勝之義‧以是無分別勝智之義故名勝義。又\n"+
		"順勝義‧謂於隨順能證勝義之慧‧有彼勝義故名順勝義。如云於勝義非有。或說云無彼說\n"+
		"上士道毘缽舍那"
		,
		/*===========================第 469 頁===========================*/
		"之勝義‧即最後者。如此論云‧「若爾‧勝義超一切心‧破法自性是文字境‧是故豈非無可破\n"+
		"耶。勝義有二‧一謂無作行轉‧出世無漏無諸戲論‧二謂有作行轉‧福智資糧隨順清淨‧名世\n"+
		"間智有諸戲論。此中立宗取彼差別故無過失。」此取聞思以上‧如理觀察真實義慧‧不應\n"+
		"唯取聖後得智。中觀光明論云‧「言勝義無生等‧其義通許一切聞思修所成慧‧皆名勝義‧\n"+
		"無倒心故。是此之勝義故‧現與不現而有差別。由彼增上知一切法‧皆唯無生‧故說勝義無\n"+
		"生者‧是說彼等由正知故生皆不成‧」與前說同。中觀莊嚴論釋難云‧「何為無自性性‧謂\n"+
		"於真實。言真實者‧謂隨事勢轉‧比量所證真實義性‧真實義相觀察即空。由此宣說真實及\n"+
		"勝義等。又唯真智說名真等‧是彼所緣故。由此真智意樂增上‧名無自性‧非由世俗無智增\n"+
		"上。」於無自性加真等簡別‧般若燈論熾然分別‧二論多說。猶如般若燈論釋十五品云‧\n"+
		"「若無自性‧云何是事‧若是事者應非無性‧故以彼語有謗自宗。」謂立宗云事無自性‧則\n"+
		"有自語相違過失‧即前論中答此諍云‧「非許勝義諸事有性‧次立宗說彼無自性‧故無謗\n"+
		"宗義。非因不成‧故此無過。」謂許諸法勝義無性‧非毀謗故。若於名言謂無自性‧許為毀謗\n"+
		"極為明顯。又彼論云‧「勝義諸內法皆無自性性‧所作性故‧殊勝言說待所依故‧譬如幻師"
		,
		/*===========================第 470 頁===========================*/
		"所化人等。」此破自性決定當加勝義簡別。言勝義無者‧義謂若以如理觀察之正理‧觀實\n"+
		"性時見彼非有。此諸論師一切皆同。故清辯論師論中‧立世俗時‧亦說不以順見真實觀察‧\n"+
		"破自性時‧多說以理觀察為無‧此與前說諸師皆同。然凡有性‧堪忍觀察實性正理推察‧許\n"+
		"否不同‧此二論師若有自性‧則定須忍觀察實性正理推察‧故亦定成勝義中有‧如前數說。\n"+
		"<b><s>　破所破時應成自續‧以誰而破分二‧<n>一</n>明應成自續之義‧<n>二</n>身生正見當隨誰行。　　今初</s></b>\n"+
		"　　佛護論師釋中‧未明分別應成自續‧建立應成。然於解釋「非自非從他‧非共非無因‧\n"+
		"諸法隨何處‧其生終非有」時‧唯依說舉他宗違害而破四生。清辯論師出過破‧謂全無能\n"+
		"力成立自宗及破他宗。然佛護宗無如是過‧月稱論師廣為解釋‧謂中觀師自身發生中觀\n"+
		"方便‧須用應成‧自續非理‧破他宗已顯應成宗。\n"+
		"<b><s>　安立應成自續兩派分二‧<n>一</n>破除他宗‧<n>二</n>安立自宗。　初又分二‧<n>一</n>出計‧<n>二</n>破執。　　今初</s></b>\n"+
		"　　雖有多種安立應成自續之理‧然彼一切孰能盡說‧故當於中略說少分。其慶喜師所\n"+
		"說入中論疏云‧「有作是言‧若許應成因‧其因為量成耶抑未成耶‧若謂已成‧爾時俱成‧云\n"+
		"何他許‧若謂未成‧則他不許‧云何他許。當答彼曰‧凡量所成應是俱成‧此非我知‧諸立論者"
		,
		/*===========================第 471 頁===========================*/
		"立能立時‧其所立因自雖量成‧然他量成自何能知‧他心差別非自現量‧比量境故。又自量\n"+
		"成亦何能知‧錯謬因緣長夜攝持‧有欺誑故。故唯由其立論對論‧許量之力‧許諸法性‧故依\n"+
		"所許破除他宗。」此說因於敵者量成不成‧立者不知‧以彼無樂‧俱非立者二量成故。自亦\n"+
		"不知因是量成‧自雖決斷是量所成‧亦有欺誑‧故無雙方量成之因。就許為量量雖未成‧然\n"+
		"就所許破亦應理。又於自續之因宗云‧「若因與所立以量成遍‧（即同品定有異品遍無\n"+
		"也）爾時當許自續之能立‧然遍不成‧謂能成遍之量或現或比‧現且不能成其為遍‧謂於\n"+
		"灶房由現可緣不可緣故‧遂謂火煙‧此有則彼有‧彼無則此無‧通達無則不生‧然非於一切\n"+
		"境‧亦非由比。彼境定故‧謂比量境非通一切‧何以故‧若有所立相屬之因‧唯於彼生無常等\n"+
		"智‧非一切時處‧故唯依世許‧成立為遍非以量成‧故應成因破除他宗‧如何非理。此說有火‧\n"+
		"遍於有煙。及無常性遍於所作‧若以量成則自續應理‧然非量成。若以量成‧應須成立一切\n"+
		"時處有火無常遍煙所作‧然以現比於灶瓶等成其為遍‧是一分故。故遍亦唯就許而成。」\n"+
		"此說若用量成三相是自續派‧畢竟唯用他許三相是應成派。\n"+
		"　　彼之弟子諸譯師云‧「中觀師者‧唯破他許餘無自宗。其有法等二無共許故‧自續非"
		,
		/*===========================第 472 頁===========================*/
		"理正理之果亦唯令捨他宗‧除彼之餘‧自無所許‧故一切種不應宣說自續之因‧唯用應成。\n"+
		"又能立應成‧即自續究竟‧故唯應許能破應成。其因及遍就現前許或究竟許‧非由量成。依\n"+
		"此因緣略有四門‧斷他所許或斷戲論。一‧舉唯應成‧謂他所許生有盡有義‧若許自生‧舉相\n"+
		"違云‧若從自生是有而生‧生應無義及無窮盡‧故許有義有盡不應正理。若許彼者‧而云自\n"+
		"生不應道理‧令他知已捨宗為果。二‧他許比量‧如云許自生芽應不自生‧自體有故。舉說他\n"+
		"許有法因等‧而反破他。雖云無自生‧亦唯破他許之自生‧非自成立無自生義‧故自無宗。三‧\n"+
		"能立同所立‧他為成立自所宗故‧所立因喻一切如前皆不極成。四‧因相相等‧謂若許彼‧即\n"+
		"當許此因相無別‧令其相等。若爾汝有無欲破他所許‧有即是宗‧應有立彼自續之因‧無則\n"+
		"不應宣說正理‧破他所許。答‧觀勝義時‧若許無性或以無生為所立者‧則須受許自續宗因‧\n"+
		"然不許彼故無過失。若略有欲即有所宗‧則一切欲皆應有宗。」此說自己無所立宗唯破\n"+
		"他宗‧雖有所欲亦無所宗。又自無宗‧是就觀察勝義之時‧謂不立宗無自性等‧非說一切全\n"+
		"無所許。故於觀察勝義之時‧若許無性為所成立‧而於自宗成立無性是自續派‧若自無許\n"+
		"唯破他欲是應成派。"
		,
		/*===========================第 473 頁===========================*/
		"　　現在自許是應成中觀者‧作如是說隨依勝義及依名言‧雖於名言自宗無許。若有彼\n"+
		"宗‧亦須許有能立因喻成自續派‧故應成派全無自宗。如迴諍論云‧「若我有少宗‧則我有\n"+
		"彼過‧然我無所宗‧故我唯無過。若以現量等‧略見有少法‧或立或破除‧無故我無難。」六十\n"+
		"正理論云‧「諸大德本性‧無宗無所諍‧彼尚無自宗‧豈更有他宗。」四百論云‧「若有無二\n"+
		"俱‧誰全非有宗‧雖長時於彼‧不能舉過難。」說中觀師無宗無立故。明顯句論云‧「凡中觀\n"+
		"師‧理不應用自續比量‧不許他宗故。」又云‧「應成破義亦唯屬他‧非屬我等‧自無宗故。」\n"+
		"入中論云‧「能破所破不會破‧及會而破所說失‧若定有宗彼成過‧我無彼宗故無失‧」說\n"+
		"自無宗過不轉故。故中觀師一切建立皆唯就他而立。入中論云‧「如汝依他事‧我不許世\n"+
		"俗‧果故此雖無‧我依世說有。」迴諍論云‧「所破無所有‧故我全無破‧是故云能破‧是汝興\n"+
		"毀謗。」說破他宗亦非有故。\n"+
		"　　又昔西藏中觀智者‧隨行月稱論師善破諸宗‧說中觀師自無所宗及無能立之量。次\n"+
		"自宗時破以正理‧觀擇自相所許能量所量建立及事力轉現比二量‧然許名言不加推察‧\n"+
		"世間共許能量所量。次中觀師自於敵者建能立言‧以真正因立無實義‧然非自續‧以就世"
		,
		/*===========================第 474 頁===========================*/
		"間共許之量‧未加推察而安立故。\n"+
		"　　第二破執分四。破第一家‧入中論疏派‧說因遍非由量成‧說因非以量成之理‧且不應\n"+
		"理。以許因須由立敵俱用量成之家‧非由立者未知敵成便不許因‧故汝彼理不能破‧須敵\n"+
		"者以量成故。又以未知敵者他心‧立為不知他用量成者‧亦不應知他許彼義‧則以他許而\n"+
		"破他等‧亦非理故。他雖說云‧我如是許現可決定‧然如所說非定許故‧及不知他心故。說遍\n"+
		"非以量成之理亦不應理‧以於灶上成立有火遍有煙時‧灶是所通達處‧其上所達之義‧唯\n"+
		"取有火遍於有煙‧非取灶中有火遍灶有煙‧豈取時處一分之遍。若不爾者‧灶非此遍已定\n"+
		"之處‧須更顯示已定之處。如於聲上‧所定無常所成立法‧須於聲瓶二事隨轉‧非立聲上一\n"+
		"分無常。由此道理‧許無比量成立能遍‧亦當了知不應正理。如是有說非由量成‧唯由立敵\n"+
		"所許而成‧亦不應理。唯以彼許為因‧不能破他。以他所許其義不成‧量於自他俱非有故。若\n"+
		"謂所許而分差別‧如此則成‧此則不成者‧如是分別。若以所許為因等同所立‧若以量有無\n"+
		"而分‧失量無欲。\n"+
		"　　破第二家‧觀真實時以不許無自性宗。謂不立自續宗之義者‧為以理智觀有無自性‧"
		,
		/*===========================第 475 頁===========================*/
		"不能立宗‧故不許彼宗耶‧抑以觀真實時故為因‧不許彼宗耶。如初說者‧若以理智不能成\n"+
		"立無性宗義‧則以理智亦不能破有性宗義‧因相等故。若謂觀察真實義時‧亦不能破有性\n"+
		"宗義‧極不應理。前說以諸正理觀察破他宗故‧無觀察心不能破他宗故。若不爾者‧何須別\n"+
		"說自宗無立‧即破他宗亦不許故。若許應成破他宗者‧則破有性即立無性‧如前迴諍本釋\n"+
		"論說‧於此更無第三聚故。若不爾者‧則翻說云‧是立無性非破有性‧有何答難‧若謂決斷無\n"+
		"性定遮有性‧則遮有性定成無性‧理相等故。若謂是觀真實義時‧故不可立無性等宗‧更當\n"+
		"宣說其中因相‧若謂觀真義時‧有所立者即勝義有‧故不應許‧此不應理。若亦不許觀真義\n"+
		"時‧應許全無以中觀理觀察時位。若立彼時‧亦定須許能觀之人‧觀察之理‧所觀之事‧與誰\n"+
		"同觀之敵者等。爾時所有‧何須一切皆勝義有。又說應成‧唯就他許或究竟許‧雖無量成而\n"+
		"能出過‧非能滿意‧如破初家而當破除。又若立云‧觀真實時無所受許‧名言有許。亦不應理。\n"+
		"其觀真實時‧非於勝義須於名言‧此相違故。又若觀真義時無‧即勝義無之義‧凡中觀師全\n"+
		"無受許勝義有者‧非應成派殊勝法故。\n"+
		"　　破第三家‧說中觀師雖於名言亦無許者‧是如前說未善明了正理所破。以彼理性破"
		,
		/*===========================第 476 頁===========================*/
		"除他宗‧翻難自時便見自宗‧亦如是轉‧不知安立自宗離過‧生死涅槃一切緣起與大自在‧\n"+
		"有無相同‧是故此乃謗中觀師最鄙惡者‧破除此執前已廣說。觀中觀師有許無許‧由具何\n"+
		"事‧名中觀師‧則彼中觀定當受許。須許通達全無塵許勝義中有及許名言緣起之義‧一切\n"+
		"如幻‧故有所許。又安立此‧亦須破除彼二違品‧許勝義有及名言無諸惡言論。故有正量通\n"+
		"達立破‧如自所證‧以中觀語無倒教他‧亦可得故。建立此等‧無一敵者而能如法求少分過‧\n"+
		"是故此宗最極清淨。由是因緣‧若自不知安立離過智中觀宗‧莫謗為無‧應當受許緣起正\n"+
		"理‧斬斷一切諸惡見網。賢正慧者‧應立中觀宗離一切違‧不應專求抵賴為能。明顯句論云‧\n"+
		"「如是我宗最極清淨‧一切建立無違而住‧與彼自宗具粗近過‧有相違時‧愚蒙不見功德\n"+
		"過失如何而住‧汝自諸過失」等。如前所引‧此說於中觀宗‧由決擇勝義之量及名言量道\n"+
		"所興建立‧無過可設‧最極清淨。生死涅槃一切建立‧皆可安立‧當得定解。若不爾者‧謂中觀\n"+
		"師全無自宗無過可設‧則說一切語言皆是妄語‧亦全不能破‧以一切因相悉相等故。又不\n"+
		"可說‧於無所許不可以有許徵察‧故無過設‧無所許故。若如是者‧則說一切語言皆虛妄者‧\n"+
		"亦說一切語言皆妄‧不當觀察彼言為實‧不能顯其自語相違。入中論云‧「若我少成實有"
		,
		/*===========================第 477 頁===========================*/
		"事‧如心應非不可說。」如犢子部許有實我‧而不可說與蘊一異。破云‧若是實有‧當說與蘊\n"+
		"或一或異‧云於此中俱不可說不應道理‧則不能破。彼可答云‧我說實我‧若一若異俱不可\n"+
		"說‧不可推察或一或異‧令有說故。若言‧「若說實有補特伽羅‧不可說與蘊若一若異‧則成\n"+
		"相違‧俱不可說不應正理‧故此觀察可於彼轉。」則云無許‧已漸有許‧亦不可說全無所許‧\n"+
		"理相等故。若作是言‧「云我無財‧乞云願施無財之財‧我說無許教許無許‧二說相等。」此\n"+
		"乃未解敵者之意‧我非總說令許無許。若爾云何‧汝云無許實漸有許‧顯示汝言須許無許‧\n"+
		"故不能斷自語相違。若汝此說非中觀宗‧則引聖父子等正教成立‧而成相違‧不可立為月\n"+
		"稱師宗。又非所餘佛弟子宗‧故汝已出此法之外。若是中觀‧尤是月稱宗者‧許自無宗則成\n"+
		"相違。如是意欲解脫有許‧云諸建立唯就他立亦不應理。說唯就他許有色等‧此縱未許色\n"+
		"等是有‧然就他立定須受許‧故終不能免脫有許。爾時就誰安立之他及能安立之自等‧皆\n"+
		"須受許。故說唯就他許‧於自無宗非但無益‧且有違害。若云‧「我全未說無有自宗‧唯就他\n"+
		"許‧唯汝自現。」順世外道‧尚所不能抵賴現事‧汝全抵賴‧汝自所說自無所覺‧由我聽聞汝\n"+
		"乃了知‧實為希有。若如是者‧何須定說無許等言‧隨說何事後抵即足‧無過難故。若說應成"
		,
		/*===========================第 478 頁===========================*/
		"亦說他立‧自宗不許‧則亦何須破自續派‧樹應成教‧信月稱宗。如於自宗不許自續‧如是應\n"+
		"成亦不可許。如就他前可許應成‧如是就他所須增上‧亦須許自續故。如於自宗不許唯識‧\n"+
		"唯就他許不可立彼為唯識師‧如是自若不能立‧以應成理決擇中義‧唯就他立‧則亦非是\n"+
		"應成派人‧亦非自續‧顯然自說非中觀師。\n"+
		"<b>菩提道次第廣論卷二十終</b>"
		,
		/*===========================第 479 頁===========================*/
		"<b>菩提道次第廣論卷二十一</b>\n"+
		"　　又云‧「果故此雖無‧我就世說有。」此義非說一切建立唯就他立‧以諸法無性‧須以\n"+
		"如理觀察有無自性理智安立‧非於庸常名言識前能安立故。若彼能立無性‧理智應無義\n"+
		"故。論云‧「我就他說有。」此說立有色等就世立故。言不許世俗者‧謂如唯識宗所許依他‧\n"+
		"自不許之義‧非說自宗不許世俗‧故云如汝依他事。又即彼論連續文云‧若汝正理能遣依\n"+
		"他‧我即以汝正理遣汝世俗。為答此諍‧如汝所許依他實事‧堪忍正理之所觀察‧我諸世俗\n"+
		"未如是許‧正理能不能破有所不同‧是此義故。言就世者‧非說就他而非自宗‧是於無損名\n"+
		"言諸識‧安立一切世俗義有‧皆就此故。諸中觀師自身亦有此諸安立名言量故。言雖無者‧\n"+
		"是自相無‧不可釋為雖自相無‧然於彼有‧及雖無而有。以是自宗立名言義之理‧其自相有‧\n"+
		"雖於名言亦非有故。釋論引經證云‧「世許有無‧我亦許爾。」不可無故。故如常說‧「於勝\n"+
		"義無‧然世俗有。」其有無義異故無過失。若爾迴諍論說‧無宗無立‧其義云何‧應當宣說。若\n"+
		"立宗云芽無自性‧次辯因云是緣起故‧喻如影像‧皆須受許。如是三相之因及因所成立之"
		,
		/*===========================第 480 頁===========================*/
		"宗‧並依能立言令諸敵者生悟彼之比量‧亦須受許。爾時唯瞋自續之名‧何故劬勞破自續\n"+
		"耶。彼中雖有如汝所引似說無宗無立之文‧然亦多說須立自許。故僅引彼文‧豈能立為自\n"+
		"無所宗。然許無性宗‧則成自續‧實有此疑‧此乃最細難解處故。立自宗時當為答釋。\n"+
		"　　迴諍論說無立宗者‧謂中觀師說法無自性‧實事師難云‧「如是立宗之言‧若有自性‧\n"+
		"說一切法無性非理‧若無自性‧則不能破法有自性。」乃是從此諍辯而出。雖無自性‧立破\n"+
		"作用皆應理者‧如前所引迴諍本釋。故有無宗者‧非總諍有無‧是於宣說一切諸法皆無自\n"+
		"性‧立宗之言諍性有無。若於如斯立宗之言許有自性‧則與立一切法皆無自性‧我有相違\n"+
		"之過。然我不許爾‧故無彼過。是顯此義非立無宗‧無與無性二者差別‧極重要故。又「若由\n"+
		"現等義」等文‧說現量等無少可緣者‧亦如前引明顯句論‧是顯能量所量無自性之能緣\n"+
		"所緣‧非顯全無緣起之能量所量。又此論意‧是答他難‧他意中謂‧若由現量立法自相‧次破\n"+
		"應理。然中觀師說一切法皆自性空‧是則現量及所量境‧法所攝故亦當性空‧若爾則無‧故\n"+
		"不能破。迴諍論云‧「若現量緣法‧次乃能遮遣‧然能緣諸法‧其現量全無。」其釋亦云‧「若\n"+
		"汝現量緣一切法‧次遮一切諸法皆空‧乃可應理‧然彼非理。何以故‧一切法中攝現量故‧亦"
		,
		/*===========================第 481 頁===========================*/
		"應是空。能緣法者‧此亦是空‧故量無所緣。若無所緣‧破亦非理。故彼說云一切法空不應道\n"+
		"理。」四百論說「有無及二俱‧」等者‧釋說‧「於說空者‧雖經長時‧不能破責。」汝說雖空\n"+
		"亦復不許‧云何能於全無許者‧而資佐證。入中論云‧「於說假有此二邊論皆不應理。故依\n"+
		"二邊‧若破若答‧於中觀師畢究無難‧」如聖天云‧「有無等」引此四句‧謂引此證於破自\n"+
		"性所成實物許假有者‧諸實事師許有自性‧及無事師斷遮色等一切諸法所有作用二不\n"+
		"能破‧故亦不成無宗之據。又有無等宗‧是二邊論宗‧最極明顯‧如前破四句生及破有無論\n"+
		"時所說。六十正理論所說者‧如其釋云‧「若時由見無事無自他宗‧爾時見者當斷煩惱。」\n"+
		"無宗之因說為無事‧此以自相或以自性安立為事‧若以作用為事‧說見無彼能滅煩惱成\n"+
		"相違故。故以不許自性法宗‧說為無宗。即彼論前文‧六十正理論釋云‧諸未測此緣起法性\n"+
		"遍計諸事‧有自相者‧「若許有實事‧決定生貪瞋‧執怖暴惡見‧從彼起諍論。」說於諸法增\n"+
		"益自相‧為許事故。故此諸教‧非顯中觀全無自宗。故顯句論中引迴諍論及四百論「不許\n"+
		"他宗故」之義‧當如是知。又云‧「所破無所有‧故我全無破」者‧所破有二‧若以增益有性\n"+
		"境界所破‧以彼為因說不破者‧不應正理。故以能增益之心為所破。其釋又說「能破亦非"
		,
		/*===========================第 482 頁===========================*/
		"有。」彼二無者‧是說無自相之能破所破。汝妄執有‧謂以彼破此而興誹謗‧然非不許彼二\n"+
		"如幻。如迴諍論云‧「如以化破化‧及諸幻士夫‧以幻破其幻‧此破亦如是。」又云‧「此執若\n"+
		"有性‧應非從緣起‧若執是緣起‧即此豈非空。若執有自性‧誰能遮其執‧餘執理亦然‧故我無\n"+
		"彼難。」此說執陽燄為水‧若有自性不應依自因緣而生‧此執任誰不能遮故。明顯句論說\n"+
		"「自無宗故‧」亦非全無自宗之據‧此是說無自續之宗故。\n"+
		"　　入中論說「無宗」者‧是說自宗能破所破‧俱許無性‧汝許因果由自性有‧故以正理\n"+
		"推察徵破因能生果為會不會‧故其能破不於我轉‧未許能堪理推察故。故全非說無有自\n"+
		"宗‧即彼釋云‧「於我宗中過不同轉‧何以故‧以我宗中能破所破‧會亦不破‧能破所破未會\n"+
		"亦不破‧能破所破俱無性故。故會未會俱不應思。」謂實事師所設正理推徵不轉之理‧是\n"+
		"無自性‧未立無許故。又為證此引佛母經舍利子問須菩提云‧「生無生法‧由何而得證無\n"+
		"生法。」雙破以彼二得。次舍利子問云‧「若爾無得證耶。」次如前引彼二雖有‧然非由二\n"+
		"邊。又是名言‧非於勝義‧引此為喻自如是許。入中論釋云‧「此顯墮二邊過‧俱破以生法或\n"+
		"無生法得‧然彼二無亦不應理‧故未推察於世名言而許有得。如是能破與所破非會未會‧"
		,
		/*===========================第 483 頁===========================*/
		"然於名言應知能破破其所破。」此顯然說‧以會未會正理觀察‧於彼二中雖俱無破‧然彼\n"+
		"不能遮其有破‧故於名言許破他宗。又非唯此‧亦許以因成立所立‧即前所引無間又云‧\n"+
		"「復次如日輪上有差別‧蝕時汝能見於影‧日影會否皆非理‧唯依緣有名言生。如為淨相\n"+
		"雖無實‧有用如是亦應知‧能淨慧面諸正因‧離實而能證所立。猶如影像全非有故‧觀察其\n"+
		"生為與日輪會與未會‧於一切種雖全非有‧然由色緣現前影像可得‧決定能令達所樂義。\n"+
		"如是以性空之能破破其所破‧及以性空離實能立之因‧成其所立‧無二邊過‧故於我語謂\n"+
		"過同等當知非理。」此說破他之理‧於自不能同等俱轉‧作如是答‧未說無宗。又許因果有\n"+
		"自性者‧因生果為會未會觀察破除‧其過於自不能轉者‧亦以自許無性為因而離其過‧非\n"+
		"謂無宗而能遠離。入中論釋云‧「汝云何許‧謂此等法俱如幻化‧故我無過亦有世法‧若如\n"+
		"誰宗能生所生是有自相‧則此觀察於彼可轉。若如誰宗諸法如幻‧遍計所生是無生性‧雖\n"+
		"無自性是分別境無可思察‧如眩翳者見毛輪等‧故我非有所說過咎。諸世間法未加觀察‧\n"+
		"亦是有故‧一切皆成。」此說過失於他轉之理‧謂許自相‧自無過理‧謂許如幻。\n"+
		"　　如是知已應當了悟‧安立中觀離過之宗。了義諸經中觀諸論‧凡說此為如是此非如"
		,
		/*===========================第 484 頁===========================*/
		"是‧此及此無‧此及此有‧總有無邊‧此等皆是造者所許‧無須特外引教成立。若不爾者‧則諸\n"+
		"教中未說受許‧如彼之處‧釋彼義時‧則不能辨此是造者所宗所許‧此非宗許‧設若定須云\n"+
		"許云受及云所宗差別語者‧亦多宣說。如迴諍論云‧「若不許名言‧我等不能說。」六十正\n"+
		"理論云‧「如於法生滅‧假名之為滅‧如是諸善士‧亦許如幻破。」又云‧「若法依緣生‧猶如\n"+
		"水中月‧許非真非倒‧此不被見奪。」出世讚云‧「若法從因生‧無因則非有‧顯同影像性‧何\n"+
		"故而不許。」又云‧「無所受無受‧故受性無我‧佛意許此受‧自性全非有。」又云‧「作者及\n"+
		"業性‧佛依名言說‧互觀待為性‧是為佛所許。」又云‧「且從已壞因‧生果不應理‧從未壞亦\n"+
		"非‧佛許生如夢。」又云‧「若是緣起生‧佛即許是空。」入中論釋云‧「諸聰智者‧當思此宗\n"+
		"無過有德‧定當受許。」又云‧「是故如許緣起唯有此緣‧如是唯許依緣假立‧故於我宗一\n"+
		"切名言無斷滅失‧他亦應當受許此宗。」說定須許‧如是等類餘尚繁多。入中論釋云‧「已\n"+
		"說四宗‧次以正理為成彼故‧頌曰‧此非自生豈從他‧亦非由俱豈無因。」此說四宗‧明顯句\n"+
		"論亦同彼說‧故龍猛菩薩及月稱宗中‧是有自許自受自宗。\n"+
		"　　破第四家‧此於名言許有自相‧然於名言亦破自相堪理觀察‧非為善哉‧前已廣說。又"
		,
		/*===========================第 485 頁===========================*/
		"說月稱論師宗中‧許諸中觀師對實事師‧以他比量成立宗時‧許有兩宗極成三相之因‧不\n"+
		"應正理。明顯句論於如是因分別破故。若許此因‧雖未立名事力轉因‧然是自續之因‧無可\n"+
		"遮故‧此等且止‧後當廣說。\n"+
		"<b><s>　第二安立自宗。述應成派破自續宗而立自宗‧二宗俱解‧當如是說。明顯句論多說此事‧然恐\n"+
		"　文繁‧今於此中略顯宗要。此中分二‧<n>一</n>正破自續‧<n>二</n>自不同破之理。　初又分二‧<n>一</n>顯示所依有法\n"+
		"　不極成之宗過‧<n>二</n>由此過故顯示因亦不成。　初又分二‧<n>一</n>出計‧<n>二</n>破執。　　今初</s></b>\n"+
		"　　明顯句論所說此事‧極難通達‧當引彼文而為解說。如云‧「若謂如說聲是無常‧是乃\n"+
		"取總法及有法‧非取差別。若取差別能比所比名言皆無‧若取四大所造聲者‧於他不成‧若\n"+
		"取空德‧於佛弟子自不極成。如是勝論立聲無常‧取所作聲於他不成。若取顯聲於自不成‧\n"+
		"隨其所應壞滅亦爾。若有因者‧於佛弟子自不極成。若無因者‧他不極成‧是故於彼唯應取\n"+
		"總法及有法‧如是此中亦捨差別‧唯取有法。」此中義者‧謂佛弟子對勝論師立聲無常‧若\n"+
		"取大種造聲為有法者‧勝論不成。若取空德聲為有法‧於自不成。如是勝論對聲顯論立聲\n"+
		"無常‧若取所作聲為有法‧聲顯不成。若取先有由緣顯聲而為有法‧於自不成。故不應取不"
		,
		/*===========================第 486 頁===========================*/
		"共別許而為有法。有法乃是立敵二家‧觀察能別法之所依‧必須兩家共極成故。如其有法\n"+
		"必須共許‧如是其法亦須共許‧取總無常莫取差別。又於成立所立之前‧於所立喻先須極\n"+
		"成‧如是中觀諸師‧成眼等內處或色等外處‧對他部宗立不自生及對自部實事諸師立無\n"+
		"他生‧取實眼等以為有法於自不成‧取妄眼等以為有法於他不成。捨此差別唯將眼色立\n"+
		"為有法‧是中觀師與實事師‧觀察有無自生等能別法之所依‧須二共許故。共成之義‧謂於\n"+
		"敵者以何量成立‧則於立者亦以比量而為成立。\n"+
		"<b><s>　第二破執分二‧<n>一</n>義不應理‧<n>二</n>喻不相同。　　今初</s></b>\n"+
		"　　顯句論云‧「此非如是‧若許破生為所立法‧爾時真實所依有法‧唯是顛倒所得我事‧\n"+
		"悉皆失壞是此自許‧倒與非倒互相異故。是故若時‧如眩翳者見毛輪等‧由顛倒故非有執\n"+
		"有‧爾時豈有少分實義是其所緣。若時如無眩翳見毛輪等。無顛倒心‧不妄增益非真實事‧\n"+
		"爾時由何而為世俗‧此非有義‧豈有少分是其所緣。以是之故‧阿闍黎云‧『若由現等義‧有\n"+
		"少法可緣‧應成立或破‧我無故無難。』何以故‧如是顛倒與不顛倒而相異故‧無顛倒位其\n"+
		"顛倒事‧皆非有故。豈有世俗眼為有法‧是故宗不成過及因不成過‧仍未能遣‧此不成答。」"
		,
		/*===========================第 487 頁===========================*/
		"此若例云‧「色處無自生‧有故‧如現前瓶。」易於領解‧當就此上而為宣說。此論答文‧顯無\n"+
		"極成有法之理。此復云何‧謂顯極成有法與諸敵者不得成立。不能極成之敵者‧明顯句論\n"+
		"謂爾時是破自生之敵者‧然總許諸法勝義有性諸實事師‧及於名言許彼諸法有自相性\n"+
		"自續諸師‧皆是敵者。中觀自續‧雖亦名為無自性師‧然此論中為刪繁故‧言無性師當知是\n"+
		"說應成派師‧言有性師當知是說實事諸師及自續師。若立色處以為有法‧成立彼者‧須以\n"+
		"取彼眼識現量而為成立‧此若不以無錯亂識而成立者‧則非能立實義現量‧故須無亂。彼\n"+
		"等宗中‧成無分別無錯亂者‧謂於何處成不錯亂‧定須觀待現彼自相‧如現而有。由是因緣‧\n"+
		"敵者何量成其有法‧而於立者不許彼量。因於名言任隨何法‧皆無自相所成自性‧故無能\n"+
		"成彼性之量‧此阿闍黎以此密意破自續師。此復是說‧令他新生通達諸法無性正見支分\n"+
		"之中‧破說必須自續之理。若是中觀應成諸師‧自內互相為生通達盡所有義比量支中‧觀\n"+
		"察須否自續之理‧暫置未說。\n"+
		"　　此與論文合而釋之‧從曰「若許」至曰「自許‧」義謂所立法之所依有法‧或眼或\n"+
		"色等‧失壞實有而不極成‧此是清辯論師自許。何等有法‧謂唯由無明損害顛倒所得我事‧"
		,
		/*===========================第 488 頁===========================*/
		"即眼識等名言諸識所立之義。彼自許者‧謂若已破於勝義生‧其所立法‧可依有法。言爾時\n"+
		"者‧謂以是故‧若真實有為彼所依‧成相違故。若謂縱許爾當有何過‧謂彼色等非真實有‧非\n"+
		"真實義‧非無亂識所得之義。是虛妄心名言諸識之所得境‧故彼皆是無明錯亂。故無亂識\n"+
		"所得之義‧於錯亂識則不顯現‧於錯亂識所現境義‧無錯亂識則非能得。顛倒亂識與無顛\n"+
		"倒不錯亂識‧自境互異‧趣異境故‧即彼論說「倒與倒相異」之義。又釋此義‧從曰「若\n"+
		"時」至曰「是其所緣。」言顛倒者‧謂眼等名言諸識被無明亂。言由彼等非有執有者‧謂\n"+
		"色聲等無自性相根識執有。無分別識之所執者‧是顯現義‧謂即色等現似自相。又言爾時\n"+
		"豈有少分實義‧是其所緣者‧義謂如是實無自相‧妄顯現故。此等諸識‧豈能成立有微少義\n"+
		"由自相有。無自相義妄現之喻‧謂如毛輪等。此等是說‧彼諸根識現色聲等‧是錯亂故‧不能\n"+
		"成立境有自相。次為顯示無錯亂識全不少執有色聲等‧說云若時無眩翳等。不顛倒者‧謂\n"+
		"無亂識‧此於現證真實乃有‧餘者皆無。此不增益非真實者‧謂色聲等非真實義‧而不增益\n"+
		"不執為有。譬如清淨離翳眼識‧則不能見毛輪亂相。言為世俗者‧謂色聲等虛妄之義。言非\n"+
		"有者‧謂無自相緣真實義無錯亂識‧不能成立彼等少分‧義謂色等非彼見故。證此諸義‧次"
		,
		/*===========================第 489 頁===========================*/
		"引龍猛菩薩論云‧「若等」此說現量等四‧不成少分有自相義‧以此為據。次云‧「何以故\n"+
		"如是」等者‧攝前說義。次言「豈有世俗眼為有法」者‧非為顯示全無世俗眼等有法。義\n"+
		"如前說‧由自相有或無錯亂現量所立色等有法‧名言亦無。言「是故」等者‧義謂無自性\n"+
		"師與實事師安立色處為有法時‧無亂現量不得極成‧於二宗中無量能立極成有法‧故自\n"+
		"續因於諸敵者‧不能安立無過之宗。若作是念‧於名言中不許自性之宗‧雖則如是‧然我於\n"+
		"名言‧不許如是有無過宗‧許有自續有法等故。於名言許有如是性不應道理‧前已廣說‧後\n"+
		"亦當釋。故汝此答不應正理。\n"+
		"　　第二喻不相同。顯句論云‧「喻亦非等‧於彼二者不說差別‧許有總聲及總無常。如是\n"+
		"總眼性空諸師與不空師‧世俗不許‧亦非勝義‧故喻不同。」此中義者‧非是顯示可有總聲‧\n"+
		"非大種造及非空德‧亦非所作先有緣顯‧有總無常‧俱非觀待不觀待因‧而無實妄俱非眼\n"+
		"等‧此是立敵俱不許故。如是法喻‧誰亦不能成非等故。若爾云何‧謂或曰大種所造之聲‧或\n"+
		"曰虛空功德之聲‧不以隨一差別簡別而定有聲‧立者敵者彼二宗中‧皆可容有。性空諸師\n"+
		"性不空師二者宗中‧若非不亂識所成立‧亦非錯亂識所成立‧無量能成總眼或色。若由錯"
		,
		/*===========================第 490 頁===========================*/
		"亂識所成立‧敵者不成。由無錯亂識所得者‧則為立者量所不成‧故說其喻非可相同。無錯\n"+
		"亂者‧總謂現量緣勝義諦諸根本智。然此俱說於顯境自相無亂現量‧及於著境自相無亂\n"+
		"比量‧能成有法及因三相‧如此之量畢竟非有。故無亂識所得境義非是有法。此言自相者‧\n"+
		"非同因明師所許有作用法。是如前說‧隨於有事無事許各各自性之性‧故有性師雖緣無\n"+
		"事之比量‧亦許於如是性所著之境‧為無錯亂。若於彼性無錯亂識‧隨於現境或於著境無\n"+
		"有錯亂‧則於真實須無錯亂‧故許自宗無如斯量。成有法等‧非說立敵二者身中無名言量\n"+
		"緣眼色等。敵者身中如前所說‧無損根識所引定解‧略有色等此定智境‧理無違害。此若細\n"+
		"釋‧如執有芽‧總有三種執取道理‧一執芽實有自性‧是執實有‧二執芽無性如幻而有‧是執\n"+
		"妄有‧三俱不執取實妄差別‧唯執總有。雖尚執芽常無常等‧然若不執此三隨一‧則無執取‧\n"+
		"故於此中不說彼等。若有情身未生正見‧通達諸法無自性者‧唯有二執‧一執總有‧二執實\n"+
		"有‧不起如幻無性之執。未見諸法如幻有情‧凡執為有諸分別心‧說彼一切皆執實有‧於一\n"+
		"切種不應道理。於前解釋名言量時‧及辨有無與性有無四差別時‧已數宣說。若不爾者‧未\n"+
		"解無性正見之前‧謂分別所設‧一切名言皆是實執‧如前所說。未為錯亂因緣所壞世間名"
		,
		/*===========================第 491 頁===========================*/
		"言所建立義‧中觀諸師於名言中所許一切‧皆被正理之所違害‧與大自在有無無別。此顛\n"+
		"倒見‧是證中觀義最大障礙故。由彼等門邪解空性‧所有相狀即先由分別所修行品眾多\n"+
		"善行‧後自妄為得正見時‧見前一切皆是執相‧生死繫縛。次生倒解‧謂彼善行是為未得如\n"+
		"此了義正見者說。遂於一切分別‧妄見過失‧由邪分別誹謗正法‧現見多如支那堪布。\n"+
		"　　又諸補特伽羅未得無性正見以前‧不能判別唯是總有與自相有二者差別。凡是有\n"+
		"者‧即如前引四百釋說‧遍計執為由自性有。由是因緣‧於無自性執為遍無‧故於性空起多\n"+
		"攻端‧謂因果等不可安立。若於相續已生通達無性正見‧此身可生三種執取。然生見已‧乃\n"+
		"至未失正見功力‧若以正理觀察思擇自性有無‧許有自性妄執實有‧則暫不生‧非彼不起\n"+
		"俱生實執。以是正見通達無性‧生已未失‧其相續中執有芽心‧非此一切皆執如幻。若不爾\n"+
		"者‧彼等心中實執現行‧應不生故。於名言中‧許諸法有自性自相‧清辯師等諸中觀師‧於自\n"+
		"宗中許自續之因者‧亦因於名言許有自性自相‧故於自宗安不安立自續因者‧亦是至此\n"+
		"極細所破。以是彼宗顯現自性無損根識‧許於名言中對所現境不為錯亂。又執芽等‧有如\n"+
		"是性諸分別心‧於所著境亦非錯亂。若不爾者‧許彼錯亂‧與實事師二宗何有極成之量。若"
		,
		/*===========================第 492 頁===========================*/
		"如月稱論師所許‧對實事師成立實無自性‧現有自相妄現根識。若時有法已得成立即成\n"+
		"無性‧則自續因復何所為。若謂於他自成即可‧不須中觀與彼共成‧此非自許‧亦非正理。若\n"+
		"如是者‧一切因式唯就他許‧是則隨順應成轉故。靜命師等‧許諸外境名言都無‧然於名言\n"+
		"許青等色‧以識為體‧同實相師‧顯現青等所有根識‧觀待青等是取自相義‧故待青相是不\n"+
		"錯亂。若立眼等‧不顯見事為有法時‧雖彼不為現量親成‧然其究竟根本能立‧必至現量。是\n"+
		"一切宗諸師共許‧以諸比量‧如盲相牽‧故其根本能立‧亦許至於現量為境。爾時所許根本\n"+
		"現量‧或是無亂見分‧或是無亂自證‧復如前說‧於所顯現自相之義‧須於境上如現而有‧是\n"+
		"彼所許。故彼諸師與無性中觀二宗之中‧無立極成不亂現量。未至現量亦能答難‧未許自\n"+
		"性師‧隨於有為無為量所成義‧是須成立於諸境上有彼諸法各各實性‧以諸正理能破彼\n"+
		"義‧故能立量不應道理。\n"+
		"　　第二由此過顯因亦不成。顯句論云‧「即此所說所依不成宗過之理‧亦當宣說其有\n"+
		"故因不成之過。」此顯前說性空不空立敵兩宗‧無量能成極成有法‧故自續因中色處之\n"+
		"有法及無自生之法‧二合總宗或名所立皆悉非有。即以此理於兩宗中‧亦無正量成其有"
		,
		/*===========================第 493 頁===========================*/
		"故。極成之因立因不成之理‧如前當知。顯句論云‧「如是彼過如所說義‧此分別師自己許\n"+
		"故。如何許耶‧謂他安立諸內六處‧唯有能生因等‧如來如是說故。凡如來說‧即應如是‧如說\n"+
		"涅槃寂靜‧此於他之能立‧舉過難云‧汝所許因為於世俗如來說耶‧於勝義如來說耶。若於\n"+
		"世俗‧則其因義於自不成。」又云‧「若於勝義‧則彼能立不極成故‧因犯不成及相違過。如\n"+
		"是此師‧自以此理許因不成‧故凡立實事法為因‧一切比量因等於自皆不成‧故一切能立\n"+
		"自皆破壞。」釋此義中‧有諸自許隨月稱行者‧作如是說‧分別熾燃論等立量說云‧地於勝\n"+
		"義非堅硬性‧是大種故‧如風。若於勝義立大種故‧自所不成。若於世俗立大種故‧於實事師\n"+
		"敵者不成。若不由此立因不成‧則說由此二門不成‧因定不成自許相違。又有說云‧立唯大\n"+
		"種‧以理智未成而破。以此理破‧全非論意‧清辯論師非如是許。故於兩派‧俱成倒說。若爾云\n"+
		"何‧其「如所說義‧此分別師自己許」文‧如前說者‧謂前所說有法不成及因不成‧以前論\n"+
		"無間說彼義故。義謂成立有法及因所有現量‧不出二類‧謂錯不錯亂。若以錯亂識所得義\n"+
		"立為因等‧於實事師不能極成。若以無亂識所得義立為因等‧自量不成。故自續因及有法\n"+
		"等‧前已宣說不極成者‧是「如所說義。」顯由此門立為不成。清辯論師如何許者‧謂於如"
		,
		/*===========================第 494 頁===========================*/
		"來如是說故‧由二諦門而為推察。有說此義‧謂徵難云如來是說世俗說故立為因耶‧勝義\n"+
		"說故立為因耶‧全非論義。如前自立有法‧謂不可加實妄差別‧若異此者‧便有立敵隨一不\n"+
		"成‧於因喻等亦許如是。於斯粗顯似破之理‧巧慧圓滿‧若此論師豈容錯誤。故是問云‧「如\n"+
		"來說故彼因之義二諦為何。」若是世俗自不許爾‧於自不成。若是勝義‧我於勝義‧破果從\n"+
		"其有因無因及二俱生‧故我不成。不許俱非二諦義故‧無須明破。今自立云‧是大種故。亦當\n"+
		"如前反詰彼云‧彼因大種‧二諦為何‧若問「二諦大種立何為因‧」是全未解立者之意。如\n"+
		"是詰問二諦為何‧若是勝義雖自不成‧然是世俗‧云何可說於他不成。若不爾者‧立諸內處\n"+
		"為有法時‧世俗有故‧亦應敵者不極成故。若爾如所說過‧清辯論師為如何許‧以二諦理推\n"+
		"求他因耶。茲當宣說‧此論師意以無錯亂識所得‧名為勝義。以錯亂識所得名為世俗。問云‧\n"+
		"「二諦為何」與問二識何者所得‧同一扼要。以所立因義‧俱非真俗因即不成‧與所立因\n"+
		"義俱非錯不錯亂二識所得‧因亦不成二理相等‧故說是此自許‧非親許也。次說「故立實\n"+
		"事法為因」別說實法‧清辯論師自立因中‧有是無錯亂現量親成‧及有以無錯現量為究\n"+
		"竟能立‧然此論師正為破彼。如前引說中觀師不許他宗‧謂理不應許自相之義‧為證此故‧"
		,
		/*===========================第 495 頁===========================*/
		"引「若由現等義」等文‧說無能量自相之量‧是對清辯論師弟子而成立故。\n"+
		"　　第二自不同過。若謂於他比量‧說有有法及因不成等過。於自比量‧豈非亦轉‧是故於\n"+
		"他不應徵難。答云‧他有彼過‧是因他許自續比量‧我等不許自續比量‧故無彼過。此中比量\n"+
		"是說論式。若許自續‧則立自相之量先須立敵極成‧次以彼量立敵二家成立三相再成所\n"+
		"立。若無比量‧則有法等皆不得成。若不許自續‧則依實事師他自所許比量而成‧於自不須\n"+
		"以比量成故。諸論中所說比量‧亦皆唯為破除他宗是他彼量‧非自續量。如中論第三品云‧\n"+
		"「此見有自體‧於自不能見‧若不能自見‧云何能見他。」如以不能自見為因‧成立眼等不\n"+
		"能見他‧自許此因宗之見他‧無性中觀師亦許‧此等量式名他比量。顯句論云‧「我等不用\n"+
		"自續比量‧以諸比量唯破他宗而為果故。」此許立量皆非自續‧及許唯為破除他宗‧故非\n"+
		"全不立量。安立量式破他宗者‧如彼又云‧「謂他分別眼是能見‧彼亦許眼是不自見法‧若\n"+
		"無見他法‧則許不生。是故破云‧若彼彼法不能見自‧則彼彼法不能見他‧譬如瓶等。眼亦不\n"+
		"能見自‧故此亦不見他。故不見自‧而見青等相違之他‧違自比量‧是以他已成比量而為破\n"+
		"除。」在敵者名自許‧觀待立者諸中觀師名曰他許‧二同一義‧立他許量破除邪執‧極為切"
		,
		/*===========================第 496 頁===========================*/
		"要‧故當細說。言「他已成」者‧非謂有法眼同喻瓶不自見因‧及所立法不見青等‧自宗不\n"+
		"許‧唯是他宗‧故因三相名唯他成。若爾云何‧彼等自宗亦許‧然能成立彼等之量‧若量自性\n"+
		"雖於名言自宗亦無。諸有性師成立彼時‧定須彼量乃能成立‧故無兩宗極成之量而量自\n"+
		"性。故非共許‧唯名他許或唯他成。若於名言亦無比量‧則由彼所成‧應如增益自性‧為正理\n"+
		"所害‧則依彼等‧云何能得中觀正見。若所依理為量所害‧而能獲得無謬正見‧一切邪宗亦\n"+
		"當得故。謂彼敵者‧許眼有法不自見因‧如瓶之喻‧並所立法不見青等‧此執之境‧自宗亦於\n"+
		"名言許有。故以正理非能害彼。然由敵者未辨彼等有與有性二者差別‧故執彼等由量自\n"+
		"性量所成立。於彼執境正理違害‧豈以正理破他身中無損名言諸識所成。故自他宗未能\n"+
		"共許能量自性之量‧故非自續所能成立‧唯當顯他自許相違。此如前立他許量式‧眼有法\n"+
		"上不能自見之因‧於名言可有。其有自性能見青等‧於有法上名言亦無‧故前能破後。若於\n"+
		"眼上因及所破‧有則俱有‧無則俱無‧彼二豈成能破所破。故他比量之有法及法因等須名\n"+
		"言有‧非唯由他許有便足‧眼等有法他已許有‧中觀論師何須更成。若強抵賴謂我不成‧更\n"+
		"當成者‧是則全無不賴之事‧與此辯論徒勞無果‧誰有智者與斯對論。"
		,
		/*===========================第 497 頁===========================*/
		"　　此又有說‧若由他許眼不自見及見青等有自性體‧顯示相違‧其相違義由何而知。若\n"+
		"相違義由量成者‧須兩極成‧則不應說是他所許。若由他許立相違者‧則他自許不能自見\n"+
		"及能見他‧二不相違‧故以他許而立相違不應道理。若由自許立相違者‧太為過失。以於敵\n"+
		"者云何可說‧汝許此義不相違者不應正理‧我等說此犯相違故。此過非有。若不自見而有\n"+
		"自性‧犯相違過是由量成‧非唯他許而為安立。若爾‧於他顯示彼量‧令其了知相違便足‧何\n"+
		"須依止他所許耶。於實事師成立相違之量‧須待彼許自性乃能成立。若彼不許唯由自許‧\n"+
		"如何於彼能成相違。若他已許所量無性及立能量無相違過‧則由彼量成立相違他已獲\n"+
		"得通達諸法無性正見‧何須更成‧若不自見見有自性而為相違。故欲通達月稱師宗‧當於\n"+
		"彼等審細觀察而求定解。若爾云何依他自許‧顯示若不自見定無見他性耶。若佛護論師\n"+
		"說‧「譬如有水見地滋潤‧由有火故見水溫熱‧由有蔻花見衣香馥‧共見定須水等三上有\n"+
		"潤等三‧汝亦自許‧如是諸法若有自性‧自性於自理當先有‧次於餘法乃見有彼。若先於自\n"+
		"不見有者‧云何於餘而見有彼。如於蔻花不見惡香‧於彼香衣亦無惡臭。」此就敵者自許\n"+
		"正理‧隨有逆無先令決定‧次合法時‧「是故於眼若有見性先於自見‧次色等合而見色等"
		,
		/*===========================第 498 頁===========================*/
		"乃應正理。然由彼眼不見自故亦不見他。」四百論亦云‧「若法有自性‧先當於自顯‧是則\n"+
		"眼於眼‧何故而不取。」\n"+
		"　　若謂如火不自燒而能燒他‧如是眼不自見而能見他亦無相違。非是總破火能燒木‧\n"+
		"眼能見色‧是破眼有見他之性。若如是者‧須以火有燒木自性而為同喻‧爾時引喻等同所\n"+
		"立‧不應道理。謂火與木若有自性‧自性不出或一或異。二者為何‧若是一者火當自燒‧復云\n"+
		"何成火是能燒木是所燒。若能成者‧今我翻云‧火是所燒木是能燒‧當如何答。若性異者‧則\n"+
		"無木時火當可得‧如無馬時可得其牛。四百論云‧「火即燒熱性‧非熱何能燒‧是故薪非有‧\n"+
		"除彼火亦無。」如是於燒‧若許自性‧既不自燒不應燒他‧如是若許眼有見性‧既不自見不\n"+
		"應見他‧前過未移‧由見如是為許自性所說過難‧即能棄捨執有性宗。次亦能知無自性中‧\n"+
		"能作所作皆悉應理‧辨了無與無性差別‧故亦能分有性與有。又能通達無性之量‧而量無\n"+
		"性所量事等。通達火薪無性之量‧彼非現量當許是比‧若爾所依因為何等耶。由見有性不\n"+
		"出一異‧破一異性定無自性‧即成二相。決定了解無一異性‧即宗法性‧故有三相之因。由此\n"+
		"為依‧決定火薪無自相者‧即是比量。由此當知前立他許三相量式及正引生比量之理。若"
		,
		/*===========================第 499 頁===========================*/
		"有自性‧性應一異‧若一性者‧火應自燒。此等皆以他許為因‧出他非樂‧如是等類是為應成。\n"+
		"以此為例‧諸餘應成皆當了知。由是敵者乃至未捨事實宗時‧必待量度自性所量而成能\n"+
		"量。若時以量達無少法由自性成‧即便棄捨事實宗見。明顯句論云‧「有以隨一所成比量‧\n"+
		"即彼比量而破他耶。答‧有謂以自成因而反破自非由他成‧即於世間亦現見故。猶如世間\n"+
		"有時立敵以證為量‧由證語斷或勝或負‧有時唯由自語而斷‧非由他語‧或勝或負‧如其世\n"+
		"間正理亦爾。唯世名言‧於正理論正適時故。」此說可以他許為因‧舉喻引證。諸分別師‧說\n"+
		"於敵者‧以何等量成立三相‧立者亦須比量而成‧故許立敵二者極成。又破彼欲‧即此論云‧\n"+
		"「設謂能立能破‧皆須二家共許‧非隨一成‧或猶豫性。」彼亦當許如所宣說‧依世比量‧以\n"+
		"教破者‧非唯二家共許之教。若爾云何‧亦以自許‧自義比量‧於一切種。唯以自許力強‧非是\n"+
		"俱成。故分別師所說之相‧非所必須。諸佛亦以自許之理‧於諸未知真實眾生‧興饒益故。由\n"+
		"是因緣‧若以前說之量‧立敵共成之因‧成立所立‧名自續因。若不以彼‧唯由敵者所許三相‧\n"+
		"成立所立名為應成。此乃論師所有意趣最極明顯。\n"+
		"　　第二身生正見當隨誰行。如是隨聖父子大中觀師。若有應成自續二派‧應隨誰進行"
		,
		/*===========================第 500 頁===========================*/
		"耶‧此中是隨應成派行。此如前說‧於名言中破除自性‧破自性後‧須善安立生死涅槃一切\n"+
		"建立‧於彼二理‧當獲定解。此二論師‧論中數說‧若許諸法有自性者‧則以觀察實性正理可\n"+
		"推察轉‧與聖父子諸論善順。由見是故‧當許彼宗‧故如前說‧當許應成宗派。\n"+
		"<b>菩提道次第廣論卷二十一終</b>"
		,
		/*===========================第 501 頁===========================*/
		"<b>菩提道次第廣論卷二十二</b>\n"+
		"<b><s>　第三依此能破於相續中生見之理分三‧<n>一</n>決擇補特伽羅無我‧<n>二</n>決擇法無我‧<n>三</n>修習此見淨障\n"+
		"　之理。　初又分三‧<n>一</n>正決擇我無自性‧<n>二</n>顯由此成我所無性‧<n>三</n>此諸正理於餘例明。　初又分二‧\n"+
		"　<n>一</n>立喻‧<n>二</n>合義。　　今初</s></b>\n"+
		"　　入中論釋引經說云‧「言我是魔心‧汝昔起是見‧此行蘊皆空‧此中無有情‧如依諸支\n"+
		"聚‧假名說曰車‧如是依諸蘊‧說世俗有情。」此如依自車輪等支假名為車‧依於諸蘊假名\n"+
		"為我或曰有情。\n"+
		"<b><s>　先說車喻。此中分四‧<n>一</n>顯車無性而為假有‧<n>二</n>於彼斷諍‧<n>三</n>由名差別皆得成立‧<n>四</n>依此速得正見\n"+
		"　勝利。　　今初</s></b>\n"+
		"　　入中論云‧「如車非許離自支‧亦非非異非具支‧非依他支非支依‧非聚非形此亦\n"+
		"爾。」如車與自支‧於一異等七中皆無故唯假有。我與取蘊說亦如是。此中若車有自體性‧\n"+
		"則以正理觀性有無‧於一異等七相之中‧定有所得‧然於彼七皆非有故‧定無自性。言車支"
		,
		/*===========================第 502 頁===========================*/
		"者‧謂軸輪轄等‧車與彼支自性非一。若性一者‧如支眾多車當亦多‧如車是一支亦當一‧作\n"+
		"者作業皆當成一‧有此等過。又與自支體性非異‧異如瓶衣各別可得‧不可得故。亦當無有\n"+
		"施設因故。能依所依二品自非支依‧如酪在盤‧亦非依支‧如天授在帳。若性各異‧此二容有\n"+
		"無別性故。此中非破互有‧是破能依所依有實自相。所舉二喻亦就他許‧謂有自相能依所\n"+
		"依‧如此一切當知皆爾。又具支者亦不應理‧若車具支‧應如天授具足牛等異體可取。如是\n"+
		"車與自支各異亦應可取‧然不可取故無具義。如云天授有耳‧車有支者亦不應理‧已破異\n"+
		"性故。若此具支有自性者‧應是一性前已破故。天授有耳‧於名言有‧此非所破‧車亦許爾‧故\n"+
		"是破除自相之具。\n"+
		"　　餘二執者‧如云‧「若合聚為車‧散住車應有‧無有支無支‧形車亦非理。」此有二執‧謂\n"+
		"以支聚及形差別安立為車。其中唯以支聚為車不應道理。此中有二‧一違正理‧謂輪等支\n"+
		"分離散布‧完聚一處亦應有車‧以為支聚即是車故。二違自許‧謂自部實事諸師‧許無有支\n"+
		"唯許支集。若爾‧支亦應無‧無有支故‧是則亦無唯支合集‧是故支聚亦不成車。破支聚為車‧\n"+
		"是此論師所許不須簡別‧聚合是車施設事故。說蘊是我所施設事‧非是我故。若唯支集不"
		,
		/*===========================第 503 頁===========================*/
		"許為車‧以支合時形狀差別立為車者‧此如前說無有支者‧支亦無故‧唯以支形安立為車‧\n"+
		"不應正理。過違自許‧亦字顯示非僅支聚為車非理。又許形為車‧為散支形耶為支聚形耶。\n"+
		"若散支形與先未合時形‧無異形耶抑異先形有別形耶。初有過云‧「如汝各支先有形‧立\n"+
		"為車時形亦爾‧如支分散不名車‧如是合車亦非有。」此謂先未合時與後合時‧輪等形狀\n"+
		"全無差別。如分散時‧其車非有‧如是合時亦應無車。若後合時與先未合輪等支形‧有別異\n"+
		"形立為車者‧亦有過失。如云‧「若現成車時‧輪等有異形‧可取然非有‧故唯形非車。」謂前\n"+
		"後時‧若輪軸等有別異形‧理應可得‧然任何觀終不可得‧故異前形後形為車不應正理。若\n"+
		"各支形不許為車‧以諸支分合聚總形立為車者‧亦有過失。如云‧「汝聚無實故‧形應非支\n"+
		"聚‧若依非實法‧此中何有形。」此謂依支聚之形名車非理‧聚非實故‧依假支聚施設形狀\n"+
		"不應理故‧一切假有所施設事要實有故。又支集聚無實自性‧若有自性與能聚支‧不能出\n"+
		"於自性一異。若許爾者‧如破車時悉能破故‧然於自宗假有所依不許實有‧支聚假形是車\n"+
		"所依‧車是依彼假施設法‧非唯所依即許為車‧故破聚形為車‧亦於所破不須簡別。依無實\n"+
		"聚‧立無實形‧無不應理‧則依無實因無明種等‧生無實果行及芽等‧一切應理。如云‧「如汝"
		,
		/*===========================第 504 頁===========================*/
		"所許此‧則依無實因‧當知生一切‧無實性諸果。」又此車喻‧亦破色等八塵合集‧立為瓶等。\n"+
		"又破依於八種實塵‧假立瓶等。又破依於實有色等形狀差別‧假立瓶等‧以色等塵自性無\n"+
		"生‧彼無性故實有非理。如入中論云‧「由彼色等如是住‧覺為瓶等不應理‧性無生故色等\n"+
		"無‧形為瓶等亦非理。」若謂瓶若如車‧非自支分合集形者‧則腹大等應非瓶相‧彼是形故。\n"+
		"答‧若法大腹長頸等相‧許彼為瓶‧非大腹等形狀為瓶。若異此者‧理亦應許腹頸是瓶。\n"+
		"　　第二於彼斷諍。諸實事師於彼難云‧若以觀察有無自性之理‧如前所說七門求車‧由\n"+
		"彼無得理應無車‧則諸世間應無施設車名之處‧然此非理‧現見可云車來買車車持去等‧\n"+
		"故有車等。入中論釋答說‧彼過唯實事師有‧及自宗非有。初者‧謂世間名言說車來等‧若如\n"+
		"汝許理應皆無‧以汝安立諸法為有‧要以正理尋求有無自性而後安立‧然以彼理七相推\n"+
		"求車不可得故‧汝又不許有餘方便安立事故‧故車應無。若以尋求有無自性正理推求無\n"+
		"所得者‧車應非有。諸實事師所設徵難‧現在自許講中觀者‧說中觀宗許有此難‧若許如是‧\n"+
		"定犯一切名言建立皆無之過。二自無過者‧如云‧「或於實性或世間‧雖以七相皆不成‧若\n"+
		"不推察就世間‧此依自支而假設。」義謂‧若以尋求有無自性正理推求於七相中車‧就二"
		,
		/*===========================第 505 頁===========================*/
		"諦俱不可得‧雖於七相以理未得‧豈能破車。以許有車‧非由觀察有無自性正理所立‧是捨\n"+
		"正理觀察‧唯以世間尋常無損諸名言識之所成立‧故建立彼是依自支立為假有。若作是\n"+
		"念‧修觀行師如是觀察‧以彼正理車無所得‧雖車無性‧然車支分自性應有。燒布灰中尋求\n"+
		"縷線‧汝誠可笑。如云‧「若時其車且非有‧有支無故支亦無。」若無有支‧亦無支故。若作是\n"+
		"念‧彼不應理‧車雖散壞‧輪等支聚猶可得故。然此非爾‧唯先見車‧乃執輪等是車之輪‧餘則\n"+
		"不執。如車壞時‧輪等與車全無係屬‧非車之支‧是故非無有支之車而有車支。爾時其車支\n"+
		"及有支‧二俱非有‧然彼輪等待自支分可名有支‧餘分為支‧故無有支不能立支。又無有支\n"+
		"無支之義‧如云‧「譬如燒車無支分‧慧火燒有支無支。」如此譬喻‧應當了知。\n"+
		"　　第三由名差別皆得成立。入中論釋云‧「此宗非但由世共許假立車名顯然成立‧即\n"+
		"此諸名差別‧由無觀察世間共許而當受許。」如云‧「即此有支及有分‧眾生說車為作者‧\n"+
		"眾生又許為受者。」此說車待輪等諸支諸分‧共許名為有支有分。如是觀待輪等所取之\n"+
		"事‧說名作者‧觀待所受‧說名受者。自部有說唯許諸支諸分合集‧異彼別無有支有分‧不可\n"+
		"得故。如是唯說有業而無作者‧又異所取不可得故‧說有所取而無受者‧彼皆倒說世間世"
		,
		/*===========================第 506 頁===========================*/
		"俗。若爾‧支等亦當無故。入中論於此密意說云‧「莫壞世許諸世俗。」如於勝義無有支等‧\n"+
		"支等亦無‧如於世俗支等可有‧有支亦有‧作如是說不壞二諦。\n"+
		"　　第四依此速得正見勝利。入中論釋云‧「如是觀察世間世俗雖皆非有‧若不推察‧共\n"+
		"許有故。修觀行者以此次第‧觀察世俗速疾能測真實淵底。」如何而測‧「七相所無如說\n"+
		"有‧此有觀行師未得‧此於真實亦速入‧此中如是許彼有。」此說由其觀車正理‧速測真實\n"+
		"無自性義‧故彼正理極為切要。觀擇實義諸瑜伽師‧作是思擇而生定解。所謂車者‧若有自\n"+
		"性‧由一異等七相門中‧尋求有無自性之理‧正推求時定無猶豫‧七隨一中而能獲得‧然於\n"+
		"彼中皆無所得。雖由如是未能獲得‧然車名言不可遮止。故言車者‧唯由無明眩翳壞慧眼\n"+
		"者分別假立‧非自性有‧此瑜伽師於真實義速能悟入。頌言‧「此於真亦爾。」亦字顯亦不\n"+
		"壞世俗。破車自性最決斷者‧七相推求‧此最顯了破斥之理亦極明顯。故依此理‧易於通達\n"+
		"車無自性。總依前說車之建立有三功德‧一‧易破增益諸法自性常見功德。二‧易破無自性\n"+
		"緣起非理斷見功德。三‧此二功德以何觀察易於生起修觀行者推察次第。初者‧唯破一異\n"+
		"而破有性‧此理太略‧難以通達‧廣則太勞‧七相推察極為相稱。第二者‧從初破時即於所破"
		,
		/*===========================第 507 頁===========================*/
		"簡別而破‧由此門中雖破自性‧不壞名言有能所作。第三者‧若有自性‧決定不出一異等七\n"+
		"相‧次於彼等一一逐次顯其違害‧見七相中皆有妨害。由破能遍‧所遍亦破‧先知此已‧次於\n"+
		"無性多引定解。此後觀見如是無性‧然車名言不可遮止‧便覺甚奇‧業惑幻師幻此車等‧極\n"+
		"為希有。以從各各因緣而生‧無少紊亂‧各各自性亦非有故。如是能於緣起之義自性無生\n"+
		"獲定解故。如四百論釋云‧「瓶等諸法‧從自因生為一為異‧五相觀察雖皆非有‧然依緣假\n"+
		"立‧而能盛取蜜及水乳‧作用皆成寧非希有。」又云‧「若無自性‧然亦可得‧如旋火輪‧自性\n"+
		"皆空。」\n"+
		"<b><s>　第二合義分二‧<n>一</n>合無自性義‧<n>二</n>合由名差別成就義。　初又分四‧<n>一</n>破我與蘊性一品‧<n>二</n>破我與\n"+
		"　蘊性異品‧<n>三</n>由此亦能破諸餘品‧<n>四</n>依彼能見補特伽羅猶如幻化。　　今初</s></b>\n"+
		"　　總凡世間現見一法‧心若決定彼為有對‧遮其無對‧若是無對‧則遮有對。由此道理‧總\n"+
		"於一異或於一多‧遣第三聚。有對無對即一多故。若能總於一多決斷‧別於自性若一若異‧\n"+
		"亦能決斷‧如是若我或數取趣有自性者‧亦不能出若一若異‧故當觀察我與取蘊‧為一性\n"+
		"耶抑為異性。修瑜伽者先觀我蘊二是一性有何過失‧於計一品當求過難。佛護論師於此"
		,
		/*===========================第 508 頁===========================*/
		"宣說三種過失‧謂計我無義‧我應成多‧應有生滅。其中初過‧若許我蘊二性是一‧妄計有我\n"+
		"全無義利‧以是蘊異名故‧如月及有兔。中論亦說此義‧二十七品云‧「若除取蘊外‧其我定\n"+
		"非有‧計取蘊即我‧汝我全無義。」第二過者‧若我與蘊自性是一‧一數取趣如有多蘊我亦\n"+
		"應多‧如我唯一蘊亦應一‧有斯過失。入中論云‧「若蘊即我故‧蘊多我應多。」第三過者‧十\n"+
		"八品上云‧「若蘊即是我‧我應有生滅。」二十七品云‧「取性應非我‧我應有生滅。」應知\n"+
		"此中取即說蘊。如是許我剎那生滅當有何過‧入中論本釋說三過失‧一過‧憶念宿命不應\n"+
		"道理‧二過‧作業失壞‧三過‧未作會遇。初者‧若我剎那生滅‧我之生滅應自性有‧前後諸我自\n"+
		"相應別。若如是者‧佛不應說爾時我是我乳大王‧我乳之我與佛之我二相別故。譬如天授\n"+
		"念宿命時‧不作是念我是祠授‧若不爾者‧前者所受後者能憶‧雖性各異‧然不相違。則天授\n"+
		"所受祠授不憶‧亦當宣說不同之理‧然不可得。此如破他生之理‧若他許種芽皆有自性而\n"+
		"為因果‧乃可難云‧如此可成因果‧則從火燄亦當生黑暗。然非許異皆有彼難。若爾‧彼經顯\n"+
		"示佛與我乳二為一耶。彼經唯是遮他相續‧非顯是一‧故彼經云‧「爾時彼者莫作異念。」\n"+
		"此即月稱論師所許。誤解彼經有作是云‧「佛與彼諸宿生有情應是一人。經云‧我於昔時"
		,
		/*===========================第 509 頁===========================*/
		"為彼說二是一。又有為法剎那壞滅‧是一非理‧故彼二常。」此是前際四惡見中第一惡見。\n"+
		"為破此故龍猛菩薩於二十七品云‧「說過去已生‧彼不應道理‧昔時諸已生‧彼即非是\n"+
		"此。」若如是者‧則一眾生應成六趣‧彼等漸受六趣身故‧前後諸人是常一故。如是亦破前\n"+
		"後性別。若我有性‧前後諸人或是一性‧爾時應常‧或是異性‧則成斷見。故諸智者不當許我\n"+
		"有實自性。二過作業失壞者‧謂若許我一一剎那自相生滅‧前我作業後我受果‧如下當破。\n"+
		"先造業果應無人受‧作業之我未受果前已滅壞故‧無餘我故。前後諸法其自性異‧故除前\n"+
		"我別無後來異性之我‧前未受果果無受故。若謂是一相續‧下亦當破‧故不能斷業失壞過。\n"+
		"三過未作會遇者‧若謂前我雖已壞滅‧然由後我受所作果‧無失壞過。若爾‧諸餘補特伽羅\n"+
		"未作少業‧當受彼業果報因緣‧亦當受餘補特伽羅作業之果‧以此自性補特伽羅所作業\n"+
		"果‧由彼異性補特伽羅而受用故。入中論云‧「未般涅槃前剎那‧無生滅作故無果‧餘所作\n"+
		"者餘應受。」又入中論雖尚說有餘三過失‧然唯破除自部所許‧今為破共‧故不摘錄。以上\n"+
		"二理‧二十七品云‧「若此是餘者‧無前亦應生‧如是前當住‧前未死當生‧前斷業失壞‧餘所\n"+
		"作諸業‧當由餘受果‧此等皆成過。」月稱論師即錄業壞等二‧言「若此是餘者」‧義謂昔"
		,
		/*===========================第 510 頁===========================*/
		"生時我與現在我二性若異。若爾於前全無依託‧不依前者後亦當生。又如造瓶‧衣無須壞‧\n"+
		"後我生時前當不壞而常安住‧又前不死當於此生。若謂前後生我體性雖別然無業壞及\n"+
		"未造業會遇之過‧相續一故。此同各別自相未成尚待成立‧若自性異是一相續‧不應道理。\n"+
		"猶如彌勒鄔波笈多‧入中論云‧「真實相續無過者‧前觀相續已說過。」前如何觀察者‧即\n"+
		"彼論云‧「彌勒近護有諸法‧是餘性故非一續‧諸法若由自相別‧是一相續不應理。」謂若\n"+
		"自相各別如二相續‧不可立為是一相續。第二十七品云‧「若天人各異‧相續不應理。」總\n"+
		"謂若自性異‧應堪觀察實性正理之所思擇‧然以彼理詳審思擇‧下無塵許堪思擇事。故自\n"+
		"性異‧前所造業後若受果‧則異相續一切皆同‧無可分別。此於一切處‧皆當了知。\n"+
		"　　若爾‧自宗前時所受後時憶念‧二者非一‧如異相續‧則憶先受及先造業‧後者受果不\n"+
		"應道理。答云‧無過。是一相續此宗無違‧唯於他宗是一相續不應理故。如滿瓶酪置茅屋內‧\n"+
		"鴿住屋頂‧雖鴿足爪未入酪瓶‧然彼爪跡於酪可得。如是現法補特伽羅未往前世‧然憶宿\n"+
		"受亦無相違。四百論釋云‧「諸因果法應離分別一性異性‧由因差別果相顯現‧唯有諸行\n"+
		"相續無常‧能取假我隨念宿生應正道理。於彼諸法皆無自相‧若有如是諸緣現前變為餘"
		,
		/*===========================第 511 頁===========================*/
		"相無不應理。是故當知‧諸法因緣皆無自相‧作用差別不可思議。如稀酪器置於屋中‧多草\n"+
		"覆頂‧鴿居其上跡雖可得‧然足入酪理定非有。」入中論中‧當廣研求‧當釋正義。如是若許\n"+
		"我蘊是一‧二十七品云‧「云何所取法‧而成能取者‧」此是大過。如名言云‧此數取趣受如\n"+
		"是身‧蘊是所取‧我是能取。若許彼二是一‧作業作者亦當成一。能斫所斫‧瓶及陶師‧火與薪\n"+
		"等‧皆當成一。如十品云‧「若薪即是火‧作者業成一‧以此火薪理‧我與所取等‧及瓶衣等俱‧\n"+
		"無餘盡當說。」入中論云‧「取者與取理非一‧業與作者亦當一。」如是若許我蘊是一‧許\n"+
		"我無義‧我當成多‧作及作者理當成一‧造業失壞‧未造會遇‧說憶宿生不應道理。有六過故‧\n"+
		"不當許一。\n"+
		"　　第二破異品。若我與蘊二性非一‧而許性異‧當有何過。第十八品出此過云‧「若我異\n"+
		"諸蘊‧應全無蘊相。」若我自性異蘊而有‧應不具蘊生住滅相‧如馬異牛不具牛相。若謂如\n"+
		"是‧明顯句論立他比量難‧謂彼應非設我名言處非我執境‧是無為故‧如虛空花‧或如涅槃。\n"+
		"佛護論師說‧我若不具生滅之相‧即應是常‧常則無變‧全無作為‧計執有我‧毫無義利‧流轉\n"+
		"還滅皆不成故。若離諸蘊變礙等相‧自性異者應如是可得‧譬如色心異相可得‧然不可取‧"
		,
		/*===========================第 512 頁===========================*/
		"故無異我。第二十七品云‧「我離所取蘊‧異者不應理‧若異無所取‧應見然不見。」入中論\n"+
		"云‧「故無異蘊我‧除蘊不執故。」故諸外道增益離蘊異義之我‧是未了解我唯假名。又見\n"+
		"與蘊一不應理‧由邪宗力妄興增益‧非彼相續名言諸識見如是我。以如是理‧乃至能見我\n"+
		"與諸蘊‧若自性異有諸過難‧得堅定解應當修習。若未於此一異品過‧引生清淨決定了解‧\n"+
		"縱自決斷補特伽羅皆無自性亦唯有宗‧終不能得清淨見故。\n"+
		"　　若欲觀察有無真實補特伽羅‧當觀真實補特伽羅與蘊一異。若計是一‧究竟過難‧謂\n"+
		"火薪等作者與業皆當成一。此等若一‧即以世間現量能破‧立敵二宗諸不共許不成過難。\n"+
		"如是若異‧應如色心各別可見‧未見是事‧此以常識不取為難‧宗派不共不成過難。故於觀\n"+
		"察真實義時‧一切過難究竟根本‧要至立敵相續之中‧無有損害名言諸識。故云‧「於真實\n"+
		"時世無害」者‧是如前說‧於真實義不許為量‧非於觀察真實義時‧無有損害名言諸識‧不\n"+
		"許為難。若不爾者‧各別所許諸不共量既不能害‧諸至教量有許不許‧種種非一‧即共許者‧\n"+
		"了非了義多不合順。彼復尚須以理證成‧餘有何理‧可為顯說。又於他許‧謂若許彼亦應許\n"+
		"此‧若不許此亦莫許彼。如是因相‧若無正理何能決定‧是故能破能立‧一切根本究竟‧要至"
		,
		/*===========================第 513 頁===========================*/
		"立敵無損名言諸識‧違彼而許見自內心能違害故‧不可違越。此乃中觀因明一切共規。雖\n"+
		"則如是‧然名言識亦無成立無性等過‧猶如現量雖能成立聲是所作‧然非現量成立無常。\n"+
		"總其能破能立根本‧究竟雖須至於現量‧根本所立豈須由於現量而成。\n"+
		"　　第三由此亦能破諸餘品。若有異性如盤中酪‧或我依蘊‧或蘊依我‧可有能依所依二\n"+
		"品‧然無異性‧故無所依及以能依‧如前說車。入中論云‧「蘊非有我我無蘊‧何故若此有異\n"+
		"性‧觀察於此乃可成‧無異性故妄分別。」又我與蘊具足品者‧當知亦如車說。即前論云‧\n"+
		"「非我具色何以故‧由我無故無具義‧非異具色異具牛‧我色俱非一異性。」言具牛者‧如\n"+
		"云天授具足諸牛。言具色者‧如云天授具足妙色。若爾唯蘊合集即是我耶‧此亦非理‧說依\n"+
		"五蘊假施名我‧其所依事即能依法‧不應理故。入中論云‧「經說依蘊故‧唯蘊集非我。」又\n"+
		"唯蘊聚‧即是我者‧入中論本釋俱說業與作者成一之過。許一一蘊是我所取‧當許五蘊俱\n"+
		"是所取‧則諸蘊聚亦所取故‧說蘊積聚是我所依‧非即是我‧則蘊相續顯然亦應如是而許。\n"+
		"若謂彼等雖皆非我‧然如配合輪軸等時‧得一殊形安立為車‧色等合聚於殊特形‧應立為\n"+
		"我。若爾‧形狀唯色乃有‧應於心等不立為我。入中論云‧「形為色有故‧汝唯說色我‧心等聚"
		,
		/*===========================第 514 頁===========================*/
		"非我‧心等無形故。」是故如車於七種相皆無自性‧然依有支假名為車‧我與諸蘊一異等\n"+
		"性‧七中皆無‧然由依蘊假名為我。二者相似‧經以彼二說為法喻‧故此善成。\n"+
		"　　第四依彼能見補特伽羅猶如幻化。如幻之義‧略有二說‧一說勝義諦如幻‧謂唯可言\n"+
		"有而破諦實‧二說色等幻‧謂自性雖空‧現有色等現境如幻。今說後義‧又後義中有前幻義‧\n"+
		"前中不定有後幻義。修後幻法要依二心‧一取現境‧二決定空。喻如變幻所現象馬‧要眼識\n"+
		"見‧如所幻現實無象馬‧意識決定。依此因緣乃能定解所現象馬是幻或妄‧如是補特伽羅\n"+
		"等‧於名言識顯現無遮‧及以理智決定了彼自性本空‧依彼二心乃能定解補特伽羅是幻\n"+
		"或妄。此中理智不能成立顯現為有‧其名言量不能成立自性為空‧此即雙須尋求有無自\n"+
		"性理智與取色等名言諸識所有因相‧故若色等不現如幻‧其取色等諸名言識任運而有‧\n"+
		"生此方便不須劬勞。當以觀察有無自性之正理‧多觀色等‧於破自性起大定解‧次觀現境\n"+
		"乃現如幻。無餘決擇幻空之理‧昔諸智者說以理智於現有法唯遮自性生滅等空‧名如虛\n"+
		"空空性‧次性雖空現似有性色等顯現‧名如幻空性。如是臨修禮拜旋繞及念誦等行品之\n"+
		"時‧先以觀性有無之理‧觀察彼等破除自性‧以彼定解智力攝持‧次修彼事學習如幻‧於此"
		,
		/*===========================第 515 頁===========================*/
		"幻中‧修禮拜等。知此宗要定中當修如空空性‧由彼力故‧於後得時‧善解現境如幻空理。此\n"+
		"如前說‧若不善知所破量齊‧唯以正理觀一異等‧見一異等有妨難時‧便謂全無補特伽羅\n"+
		"等及謂補特伽羅等法‧如兔角等一切作用皆空無事成大斷見‧當知即是正見歧途。如云‧\n"+
		"「如是則三有‧云何能如幻。」四百論釋云‧「若能如實見緣起者‧當如幻化‧非如石女兒。\n"+
		"若此觀察破一切生‧說諸有為皆無生者‧爾時此非如幻‧石女兒等乃能量度‧我因恐怖無\n"+
		"緣起過‧不能順彼‧當不違緣起順如幻等。」故尋求有無自性之理智‧執有幻義雖亦是過‧\n"+
		"然以彼理觀察破除自性之後‧於諸法上定當引生執有幻義‧非是過咎。四百論釋云‧「是\n"+
		"故如是周遍思擇‧諸法自性皆不成就‧諸法別別唯餘如幻。」此說須餘如幻義故。又若破\n"+
		"除苗芽自性乃至正理作用未失‧爾時若以正理觀察應不應理‧雖於苗芽不執有性‧然於\n"+
		"苗芽無自性義念為諦實‧及於性空顯現如幻念為諦實。此執有過‧亦是正理之所破除。若\n"+
		"不執實‧但取有幻‧決不當謂取幻亦復有執著故‧應當棄捨。若不爾者‧緣起定解一切皆無‧\n"+
		"成大過故‧如前廣說。此復定是未能分辨如幻義有與諦實有二者差別。\n"+
		"　　又先觀境以理分析覺境非有‧次於觀者亦見如是。再次於能決定無者亦復非有‧任"
		,
		/*===========================第 516 頁===========================*/
		"於何法‧此是此非‧皆無能生定解之處。次覺現境杳茫無實‧由是未分自性有無與僅有無‧\n"+
		"以諸正理盡破一切之所引生。如此之空‧是為破壞緣起之空。故證此空‧引覺現境杳茫顯\n"+
		"現‧畢竟非是如幻之義。故以正理思擇觀察‧覺補特伽羅等‧於自性境無少安住‧依此因緣‧\n"+
		"此諸現境杳茫顯現並非難事‧如此顯現‧凡諸信解中觀宗義‧少聞顯說無性法者‧一切皆\n"+
		"有。然最難處‧謂盡破自性及以無性補特伽羅‧立為造業受果者等‧至心定解‧而能雙立此\n"+
		"二事者‧至最少際‧故中觀見最極難得。然若未得如斯正見‧定見增長‧則於行品定解損減。\n"+
		"若於行品定解增長‧則其定見決定損減‧則於二品‧無餘方便能正引生勢力均等廣大定\n"+
		"解‧是故決定或墮妄執實有自性‧增益常見有事見邊‧或墮妄計諸法作用一切皆空‧損減\n"+
		"斷見無事見邊。如三摩地王經云‧「爾時無罪具十力‧勝者說此勝等持‧三有眾生猶如夢‧\n"+
		"此中無生亦無死‧有情人命不可得‧諸法如沫及芭蕉‧猶如幻事若空電‧等同水月如陽燄。\n"+
		"全無人從此世歿‧而更往去餘世間‧然所造業終無失‧生死異熟黑白果。既非常住亦非斷‧\n"+
		"無實造業亦無住‧然既造已非不觸‧亦無他造自受果。」謂以正理雖不能得若生若死補\n"+
		"特伽羅‧然諸法如幻生黑白果。故造業已定觸其果‧非不領受。又無他人所造諸業‧其餘補"
		,
		/*===========================第 517 頁===========================*/
		"特伽羅不造而遇領受其果‧如此所說當獲定解。求定解法如前所說‧令善現起正理所破。\n"+
		"次善思惟‧自心無明‧如何增益自性之理‧當善認識。次當思惟若有此性‧決定不出一異道\n"+
		"理及於雙方妨難之理‧分別思察。引生觀見妨難定解‧後當堅固定解補特伽羅全無自性‧\n"+
		"於此空品應多修習。其次補特伽羅名言不可遮止‧令於心現‧即安立此為造業者及受果\n"+
		"者‧作意思惟諸緣起品‧於無自性緣起得成‧於成立理當獲定解。若覺彼二現相違時‧當善\n"+
		"攝取影像等喻‧思不違理‧謂如形質所現影像‧雖所現為眼耳等事皆悉是空‧然依鏡質緣\n"+
		"合則生‧若此眾緣有缺則滅‧如彼二法同於一事不可遮止。如是補特伽羅雖無自性若微\n"+
		"塵許‧然造業者及受果者‧又依宿業煩惱而生‧皆無相違‧當淨修習。如是道理‧於一切處皆\n"+
		"當知之。\n"+
		"　　若爾‧了知彼影像等隨所顯現決定是空‧即是通達彼無性者‧則諸異生現證無性‧皆\n"+
		"成聖者。若非通達‧彼等何能為無性喻。若彼諸喻無自性義‧更須依因而通達者‧隨別安立\n"+
		"彼之喻等觀察推求‧當成無窮。先有答云‧「雖已現證諸影像等無自性義‧然非聖者‧唯達\n"+
		"少分有法空故‧聖須現證一切諸法皆無自性。」然不應理。四百論云‧「說見一法者‧即見"
		,
		/*===========================第 518 頁===========================*/
		"一切者‧以一法空性‧即一切空性。」此說通達一法無性空性‧即能通達諸法空故‧故達影\n"+
		"像本質雖空‧不執實質‧然於影像執為實有‧有何相違。又諸童稚不善言說‧見質影像於彼\n"+
		"戲等‧彼等是執實有本質。若諸高邁已善言說‧雖知彼等實無本質‧本質所空‧然即執彼現\n"+
		"似本質影像有性‧是諦實執。此於自心現有‧領覺能成‧雖其如是‧然亦堪為無性喻者‧謂隨\n"+
		"所現即彼性空‧故所顯現實無彼性現量可成‧即彼為喻。若隨所現即彼性空‧於芽等上以\n"+
		"量成者‧即是通達苗芽無性‧故與影像理非全同。以此當知‧「如此瓶等真無性‧而於世間\n"+
		"共許有‧」對實事師安立瓶等‧為無性喻‧亦如影等取少分空‧非取瓶等無自性空‧以如前\n"+
		"說車等譬喻尚多成彼無自性故。如是如幻‧有觀看者‧於象馬等執為諦實‧幻師了知象馬\n"+
		"虛妄‧亦少分空。又夢所見依正等事‧醒時執彼如所現事空而虛妄‧及於夢時能如是執‧然\n"+
		"此皆是執其夢中所現男女‧為餘真實男女所空‧非是通達夢無自性‧如同了解影像無質。\n"+
		"又如前引‧「於幻陽燄等假立‧此就世間亦非有。」謂於陽燄幻夢執水象馬及男女等‧俗\n"+
		"名言量皆能違害‧了知無彼所執義者‧非是通達法無性見。如是前說彼諸幻義‧亦當諷詠\n"+
		"甚深經偈而正思惟‧此如三摩地王經所說而思。如云‧「猶如陽燄尋香城‧及如幻事並如"
		,
		/*===========================第 519 頁===========================*/
		"夢‧串習行相自性空‧當知一切法如是。猶如淨空所現月‧影像照顯澄海中‧非有月輪入水\n"+
		"內‧當知諸法相皆爾。如人住於林山內‧歌說嬉笑及號哭‧雖聞谷響而無見‧當知一切法如\n"+
		"是。歌唱妓樂如是哭‧依此雖有谷響現‧彼音於響終非有‧當知一切法如是。猶如夢中受欲\n"+
		"行‧士夫醒後不可見‧愚夫希樂而貪著‧當知一切法如是。如諸幻師化諸色‧象馬車乘種種\n"+
		"事‧如所顯現悉皆無‧當知一切法如是。猶如幼女於夢中‧自見子生尋即死‧生時歡喜死不\n"+
		"樂‧當知一切法如是。猶如夜分水中月‧顯現無濁澄水中‧水月空偽不可取‧當知一切法如\n"+
		"是。猶如春季日午時‧行走士夫為渴逼‧於諸陽燄見水聚‧當知一切法如是。如於陽燄全無\n"+
		"水‧有情愚蒙欲飲彼‧終不能飲無實水‧當知一切法如是。如於鮮濕芭蕉樹‧若人剝彼欲求\n"+
		"實‧內外一切無心實‧當知一切法如是。」\n"+
		"　　第二合由名差別成就義。如依輪等假名為車‧其諸支分名為所取車為取者‧如是依\n"+
		"於五蘊六界及以六處假名為我‧彼為所取我為取者。又如安立車與車支為作者及業‧如\n"+
		"是我取蘊等有作用故‧名為作者‧蘊等是我所取業‧故名為所作。入中論云‧「如是以世許‧\n"+
		"依蘊界六處。許我為取者‧取業此作者。」此亦如車觀真實義‧我於七相皆不可得無少自"
		,
		/*===========================第 520 頁===========================*/
		"性‧然未觀察許世俗有。\n"+
		"　　第二顯示由此亦破我所。如是若以尋求有無自性之理尋求我時‧於彼七相俱不可\n"+
		"得‧破我自性‧爾時云何能以正理得此即是我之眼等‧由是我所亦無自性。修觀行者‧若全\n"+
		"不見我我所性‧能脫生死‧此下當說。十八品云‧「若我且非有‧豈能有我所。」入中論云‧\n"+
		"「由無作者則無業‧無我故亦無我所‧故由見我我所空‧彼瑜伽師當解脫。」由已通達我\n"+
		"無性力‧亦能通達我所無性‧並其斷疑‧如前已說‧應當了知。\n"+
		"　　第三此諸正理於餘例明。如觀我蘊等同觀車‧如是瓶衣等事亦當了知‧謂以尋有無\n"+
		"自性之理‧觀瓶衣等與自色等‧為一異等七相尋求‧於七相中雙就二諦‧俱不可得‧然就名\n"+
		"言‧無觀察識安立為有。如三律儀經云‧「世與我諍‧然我不與世間諍論‧以於世間許有許\n"+
		"無‧我亦許爾。」自許正理不破世間‧共許事故。如入中論云‧「若瓶及衣帳‧軍林並鬘樹‧宅\n"+
		"舍與車乘‧客店等諸法。眾生由何門‧說有知彼有‧何故以能仁‧不與世諍故。又諸支德貪‧能\n"+
		"相及薪等‧有支有德貪‧所相火等義。彼如觀察車‧七相皆非有‧其餘如世間‧共許而為有。」\n"+
		"謂此世間眾生‧由何門故宣說彼等‧亦莫觀察唯當知有‧此復云何‧謂彼支分及有支等。以"
		,
		/*===========================第 521 頁===========================*/
		"瓶為喻‧瓶是有支有德所相‧瓦等是支‧大腹張口及長頸等是為能相‧衣等亦爾。貪是堅執‧\n"+
		"其有貪者是彼所依‧釋論說為有貪補特伽羅。火是能燒‧薪是所燒‧由依支故‧假名有支‧及\n"+
		"依有支假名為支‧乃至待火假名為薪‧及以待薪假名為火。十八品云‧「依業名作者‧依作\n"+
		"者名業‧除此緣起外‧未見有餘因。」又云‧「由業及作者‧餘法盡當知。」謂當了知能生所\n"+
		"生‧行走行者‧能見所見‧能相所相‧能量所量‧此等一切皆無自性‧唯是互相觀待而立。由是\n"+
		"因緣‧如於一我云何觀察‧能知性空及無自性作用皆成‧安立二諦。次以彼理觀一切法‧易\n"+
		"能通達一切無性‧故於前說法喻二事‧當獲定解。三摩地王經云‧「如汝知我想‧如是觀諸\n"+
		"法‧一切法自性‧清淨如虛空。由一知一切‧一能見一切‧故盡說多法‧於說不生慢。」\n"+
		"<b>菩提道次第廣論卷二十二終</b>"
		,
		/*===========================第 522 頁===========================*/
		"<b>菩提道次第廣論卷二十三</b>\n"+
		"　　第二決擇法無我。補特伽羅假施設事‧謂五蘊地等六界眼等六處‧是名為法‧彼自性\n"+
		"空名法無我。決擇此理雖有多種‧入中論中以破四生決擇諸法皆無自性‧釋論說彼為法\n"+
		"無我‧故於此中當略宣說。如初品云‧「非自非從他‧非共非無因‧諸法任於何‧其生終非\n"+
		"有。」謂內外諸法‧任於何所其從自生終非所有‧於餘三宗亦如是立。如是以應成式破自\n"+
		"生者‧謂如是立已‧於此未說能立因喻‧是於違逆彼諸宗者‧顯示妨難。此謂若由自性生者‧\n"+
		"待不待因兩關決斷‧其待因中‧因果二性一異兩關‧亦能決斷。其中因果一性生者是為自\n"+
		"生‧異性生者是從他生。其中復有自他各別‧自他共生二關決定。各別即是自生他生‧唯破\n"+
		"四生即遣餘邊‧道理即爾。\n"+
		"　　若諸苗芽從芽體生‧生應無義‧生是為得所生體故‧苗芽自體已得訖故‧譬如已顯苗\n"+
		"芽。其生又當無窮‧已生種子若更生者‧即彼種子當數數生。若爾唯有種子續生‧其苗芽等\n"+
		"不得生位‧故成過失。二十品云‧「若因果是一‧能所生當一。」入中論云‧「彼從彼生全無"
		,
		/*===========================第 523 頁===========================*/
		"德‧生已更生不應理‧若計生已更當生‧故此不得生芽等。」又云‧「故此妄計法自生‧真實\n"+
		"世間俱非理。」\n"+
		"　　若謂經說從他四緣而生果故從他生者‧若從異性因生果者‧當從火燄亦生黑暗‧以\n"+
		"是他故。又從一切是因非因‧當生一切是非之果‧同是他故。義謂若許種芽有性‧則諸稻芽\n"+
		"與非自因火燄等事‧由自性門性異之理‧及與自因稻種子性性異之理‧二種性異一切相\n"+
		"同。由是因緣‧如與非因見異性時‧覺諸異性互無仗託‧與自稻種見異性時‧相異之分亦覺\n"+
		"如是。又此現為殊異之理‧若是彼等自體之性‧則其不從火等出生‧從稻種生所有差別‧於\n"+
		"一切種不能分別。若謂可判能不能生所有差別‧則其性異殊異之理‧亦當分別‧此顯相違。\n"+
		"如入中論釋云‧「如能生稻種‧與自果稻芽是為異性。如是諸非能生火炭麥種彼等亦異。\n"+
		"又如從他稻種而生稻芽‧如是亦當從火炭麥種等生。又如他稻芽從稻種生‧如是瓶衣等\n"+
		"亦當從生‧然未見是事故彼非有。」此說顯然‧故許唯以一類因力成其決定相非論師意。\n"+
		"其中過難‧如破灶上不成有煙定有火時‧已廣說訖。第二十品云‧「若因果性異‧因非因應\n"+
		"同。」入中論云‧「依他若有他法生‧從燄亦當生重闇‧當從一切生一切‧諸非能生他性"
		,
		/*===========================第 524 頁===========================*/
		"同。」又於此能破‧謂是一相續攝不攝等‧亦不能答‧以異性他是一相續‧非是極成‧與前等\n"+
		"故。又謂現見其生不生有決定者‧亦不能答。其異非由名言心立‧現是觀察境上自性‧云見\n"+
		"決定如何應理。\n"+
		"　　計俱生者作是說云‧瓶由泥成是從自生‧由陶師等是從他生。內如天授由前餘生有\n"+
		"命根故‧而受今生‧天授與命二是一故‧是從自生。又從父母及黑白業生‧是從他生。唯自不\n"+
		"生唯他亦不生‧二俱乃生。以前正理即能破彼‧謂自生分以破自生正理而破‧從他生分以\n"+
		"破他生正理而破。入中論云‧「俱生亦非正理性‧俱有已說諸過故‧世間真實皆無此‧從各\n"+
		"各生未成故。」\n"+
		"　　自然生者作是說云‧蓮藕粗硬‧蓮瓣柔軟‧未見有人功用而作。如是孔雀等類‧未見有\n"+
		"人捉而彩布形色顯色‧故諸法生唯自然生。此不應理。若無因生‧則於一時一處有者‧一切\n"+
		"時處皆當為有或全非有。於此時處生不生理‧不可說是因有無故。烏鴉應有孔雀色等‧總\n"+
		"之一生一切當生或全不生。又諸世人為得果故‧勤作其因皆應無義。入中論云‧「若見唯\n"+
		"是無因生‧一切恆從一切生‧世人不應為果故‧多方攝集種子等。」"
		,
		/*===========================第 525 頁===========================*/
		"　　如是由見四生違害‧即能成立四邊無生‧於此能立皆無性生‧如前遮止餘邊時說。故\n"+
		"於諸法皆無自性‧亦由依此而生定解。此是依止應成作用引生比量‧非有論式親成所立。\n"+
		"入中論云‧「諸法非從自他共‧無因而生故離性。」總說違害四生義者‧是顯安立應成果\n"+
		"中依止正因‧云何引生比量之理‧非從最初便對敵者‧安立如是他許比量。如是若依破自\n"+
		"性生‧能解有事無自性者‧次於無事亦易獲得無性定解‧故易獲得達一切法性空中觀。如\n"+
		"第七品云‧「若法是緣起‧其自性寂滅。」入中論云‧「若法依緣生‧分別不能觀‧故此緣起\n"+
		"理‧斷諸惡見網。」依緣起因‧若能定解芽等性空‧斷諸歧途於心最顯‧故略宣說。如立他比\n"+
		"量云‧「芽無自性‧依自因緣所生起故‧譬如影像。」譬如本質所現影像‧諸兒童等於彼所\n"+
		"現眼耳等事‧不謂於心如是顯現‧非如所現實有斯義‧反執眼等自性實有。諸有情類於自\n"+
		"所受‧所見諸法‧不謂由心如是顯現增上安立‧妄執此義如所顯現‧於彼境上自性實有‧即\n"+
		"是增益有自性理。彼境自性即是自體自性自在之義。若有彼性‧依他因緣則成相違。若不\n"+
		"相違許已成瓶‧依諸因緣不須更生不應道理。四百論云‧「若法緣起有‧即應無自在‧此皆\n"+
		"無自在‧故我終非有。」其釋說云‧「若法是有自性自體自在‧不依他性‧則由自有應非緣"
		,
		/*===========================第 526 頁===========================*/
		"起‧然一切有為皆是緣起。如是若法是緣起有‧即非自在‧依仗因緣始得生故。此一切法皆\n"+
		"無自在‧故皆無我‧皆無自性。」言自在者‧義謂現似有自性時‧所現實有‧覺非依仗諸識而\n"+
		"現。然以不依因緣為自在義‧則破彼義對自部師不須更成。又破彼義不能立為得中觀見‧\n"+
		"故於境上‧若由自性能自立性‧是自在義。故性空義‧即是離彼自在之性‧非謂全無作用之\n"+
		"事。故緣起因能破自性‧即前釋云‧「是故此中是緣起故‧離自在性‧離自在義即是空義‧非\n"+
		"謂一切皆是無事。」故見全無作用事者‧是謗如幻染淨緣起‧是顛倒見。又若見有自性之\n"+
		"事‧亦是顛倒‧以此自性無所有故。即前釋論無間又云‧「故謗此中緣起如幻染淨因者是\n"+
		"倒無見‧又無性故‧見有實事亦是顛倒。故說諸法有自性者‧無有緣起成常斷見而為過\n"+
		"失。」故欲遠離常斷二見‧應當受許無性如幻染淨緣起。\n"+
		"　　若作是念‧作用緣起破自在性‧離自在義即緣起義‧汝何破我‧我許緣起有作用故。故\n"+
		"汝與我全無差別。汝雖亦許緣起因果‧然如愚兒見質影像執為實質‧即於緣起增益自性‧\n"+
		"說為諸法實有自性‧故於緣起非如實知‧非如實說。我許無性故說緣起彼即差別‧即前釋\n"+
		"論無間又云‧「若作是思‧無自在義即緣起義‧若爾汝難何損於我‧汝我何別。答曰‧汝未如"
		,
		/*===========================第 527 頁===========================*/
		"實了知宣說緣起之義‧此即差別。如諸愚童不善言說‧於諸影像增益實有‧反破如實住性\n"+
		"空性執有自性‧不知是影。汝亦如是雖許緣起‧然未了解等同影像緣起性空如實住性‧於\n"+
		"無自性而不執為無自性故。於非有性反增益為有自性故‧亦不善說。不能宣說無自性故‧\n"+
		"反說諸法有自性故。」雖同受許因果緣起‧然許無性與有性故‧說於緣起如實證知與不\n"+
		"實知‧如實善說與不善說‧所有差別。由此若說‧許作用事與實事師許彼實有諍有無諦實‧\n"+
		"唯諍於名‧如是若謂許名言中有作用事與自續師諍名言中有無自相‧唯諍於名‧以自續\n"+
		"師說名言中有自相故‧此諸妄執顯然亦破。如是說者‧猶如說云‧「諸數論師‧說耳識境所\n"+
		"聞義常‧故若許此耳識境義‧然破聲常唯瞋於名。」諸餘有情許因緣生‧依此反執實有自\n"+
		"性‧故成繫縛。餘諸智者依彼因緣破有自性‧於無自性引生定解‧斷邊見縛。故緣起因成立\n"+
		"無性‧是最希有善權方便。世尊由見此義‧故云‧「若從緣生即無生‧其中非有生自性‧若法\n"+
		"依緣即說空‧若知空性不放逸。」初二句說從緣生者‧皆無性生‧第三句說依仗因緣緣起\n"+
		"之義即性空義‧第四句顯通達空性所有勝利。如是又云‧「聰叡通達緣起法‧畢竟不依諸\n"+
		"邊見。」說達緣起能斷邊執。若有自性‧佛及弟子當能觀見‧然未曾見。又彼自性非緣能改‧"
		,
		/*===========================第 528 頁===========================*/
		"則執有實相諸戲論網‧應不可斷故無解脫。如象力經云‧「設若諸法有自性‧佛及弟子當\n"+
		"見知‧常法不能般涅槃‧聰叡終無離戲論。」三四五品破處蘊界自性之理‧決擇法無我雖\n"+
		"亦甚善‧然恐文繁故不廣說。\n"+
		"　　第三修習此見斷障之理。如是若見我及我所無少自性如微塵許‧由修彼義便能滅\n"+
		"除我我所執薩迦耶見。彼見若滅‧則欲取等廣如前說四取皆滅。此取若滅‧則無取緣所生\n"+
		"之愛‧故以愛緣結蘊相續其生亦盡‧便得解脫。如十八品云‧「我我所滅故‧無我我所執。」\n"+
		"又云‧「若於內外法‧盡我我所慢‧即能滅諸取‧彼盡故生盡。」取是煩惱‧有即是業‧其生之\n"+
		"因業惑已盡‧故得解脫。即前論云‧「業惑盡解脫。」由盡何法業惑乃盡‧即前論云‧「業惑\n"+
		"從分別‧分別從戲論‧戲論以空滅。」此謂流轉生死‧係從業生‧唯污染心三業諸行‧乃是能\n"+
		"感生死之業‧故業從煩惱生。若不令起非理分別‧於境增益淨不淨相‧則不能生薩迦耶見\n"+
		"為本一切煩惱‧故薩迦耶見為本‧貪瞋等煩惱從非理分別生。唯由妄執世間八法男女瓶\n"+
		"衣色受等實‧乃有非理作意分別分別諸境‧故彼分別從執諦實戲論而生。顯句論云‧「世\n"+
		"間戲論皆以空滅‧謂由觀見一切法空‧故能滅除。云何能滅‧謂緣實事乃有如前所說戲論。"
		,
		/*===========================第 529 頁===========================*/
		"若未曾見石女之女‧諸貪欲者緣彼戲論即不生起。若不戲論‧則於彼境亦定不起非理分\n"+
		"別。若不分別‧則從貪著我及我所薩迦耶見以為根本諸煩惱聚皆不得生。若不生起薩迦\n"+
		"耶見以為根本諸煩惱聚‧則不造諸業。若不造業‧則不更受生及老死生死輪轉。」由達空\n"+
		"性滅彼之理‧即前論云‧「由依如是‧戲論永滅‧行相空故‧能離戲論。由離戲論‧滅諸分別‧分\n"+
		"別滅故‧滅諸煩惱。由惑業滅故生亦滅‧故唯空性是滅一切戲論行相‧名曰涅槃。」此說極\n"+
		"顯‧即此顯示空見違害三有根本‧成立等同解脫道命‧於此當得堅固空解。\n"+
		"　　是故龍猛菩薩諸論‧明顯宣說聲聞獨覺亦證一切諸法無性‧以說解脫生死要由無\n"+
		"性空見乃成辦故。聲聞獨覺乃至未盡自心煩惱當修彼見。若煩惱盡‧以此便足不長時修‧\n"+
		"故不能斷諸所知障。諸菩薩者‧唯斷煩惱自脫生死不以為足‧為利一切有情欲求成佛‧故\n"+
		"至斷盡諸所知障‧經極長時無邊資糧莊嚴而修。如是拔除二障種子‧真能對治‧雖是前說\n"+
		"空性正見‧然由長時修不修故‧有唯能斷諸煩惱障而不能斷所知障者。譬如唯一通達無\n"+
		"我‧俱是見惑修惑對治‧然由唯能現見無我‧若斷見惑不斷修惑‧斷修惑者須長時修。如是\n"+
		"斷除所知障者‧僅長時修猶非能斷‧亦必觀待學餘眾多廣大妙行。不修對治諸所知障‧唯"
		,
		/*===========================第 530 頁===========================*/
		"修能斷諸煩惱障所有方便‧故說聲聞獨覺證法無我‧無圓滿修。入中論釋云‧「聲聞獨覺‧\n"+
		"雖亦現見此緣起性‧然而彼等於法無我未圓滿修‧有斷三界煩惱方便。」由是因緣‧餘中\n"+
		"觀師許為法我執者‧在此論師許為染污無明。又雖斷彼修法無我‧然法無我無圓滿修‧當\n"+
		"知如前及此所說。若爾‧此宗何為所知障耶‧謂從無始來著有自性‧由彼耽著熏習內心‧安\n"+
		"立令成堅固習氣‧由彼習氣增上力故‧實無自性‧錯亂顯現名所知障。入中論釋云‧「此於\n"+
		"聲聞獨覺及諸菩薩‧由其已斷染污無明‧觀見諸行如影像等。唯現假性非是諦實‧以無諦\n"+
		"實增上慢故‧於諸愚夫而現欺誑。於諸聖者唯現世俗‧緣起性故猶如幻等。此於諸聖有相\n"+
		"行者乃得顯現‧以所知障相無明現行故‧非於諸聖無相行者。」永斷染污無明菩薩‧如前\n"+
		"所引四百論釋‧謂得無生法忍菩薩‧是得八地。故小乘羅漢及八地菩薩‧乃盡新熏錯亂習\n"+
		"氣‧然昔所熏錯亂習氣尚有眾多應淨治者‧其後更須長時淨修。由修彼故‧錯亂習氣無餘\n"+
		"永滅‧是名為佛。聖者父子說大小乘了義見同。此中可引二種希有定解‧一況云成佛‧若無\n"+
		"通達一切法無性正見‧無餘方便解脫生死。由此定解‧以多方便發大精勤‧求彼淨見。二能\n"+
		"判大乘小乘不共特法‧謂菩提心及諸菩薩廣大妙行。由此定解‧於諸行品特能認為教授"
		,
		/*===========================第 531 頁===========================*/
		"中心‧受菩薩戒學習諸行。此說頌云‧「佛在共稱靈鷲峰‧最勝希有大山王‧六返震動此大\n"+
		"地‧神變光明滿百剎。能仁妙喉善演說‧猶如經咒二道命‧生諸聖子為大母‧無比善說名慧\n"+
		"度。授記勇識曰龍猛‧如理解釋造勝論‧名為吉祥根本慧。如日共許其釋中‧佛護佛子無比\n"+
		"論。於彼善說為善說‧善通達已廣解釋‧謂月稱論顯句義。彼等無垢清淨宗‧謂於無性如幻\n"+
		"法‧生死涅槃緣起理‧作用皆成略顯說。修習甚深中論友‧汝心雖覺全無性‧因果緣起難安\n"+
		"立‧然彼乃是中觀宗。依此宣說最端嚴‧不爾為他所立過‧自宗不能如實離‧願謂無宗尚應\n"+
		"學。如是聖父子‧論中求見理‧令作此善說‧為佛教久住。」\n"+
		"　　第二觀之差別。如是依止修次中篇所說‧親近善士‧遍求多聞‧如理思惟‧毘缽舍那三\n"+
		"資糧已‧若有正見證二無我‧次當修習毘缽舍那。若爾所修毘缽舍那總有幾種‧此暫不重\n"+
		"宣說大地毘缽舍那‧正為顯示異生所修毘缽舍那‧圓滿修彼毘缽舍那‧謂修四種三種及\n"+
		"修六種毘缽舍那。\n"+
		"　　一四種者‧解深密經說思擇等四。正思擇者緣盡所有‧最極思擇緣如所有。初有周遍\n"+
		"尋思周遍伺察之二。第二亦有尋思伺察之二‧謂粗細相思擇其義‧如聲聞地云‧「云何四"
		,
		/*===========================第 532 頁===========================*/
		"種毘缽舍那‧謂有比丘依止內心奢摩他故‧於諸法中能正思擇‧最極思擇‧周遍尋思周遍\n"+
		"伺察。云何名為能正思擇‧謂於淨行所緣‧或於善巧所緣‧或於淨惑所緣‧能正思擇盡所有\n"+
		"性。最極思擇如所有性‧由慧俱行有分別作意‧取彼相狀周遍尋思‧審諦推求周遍伺察。」\n"+
		"集論毘缽舍那道‧亦說彼四。慧度教授論‧明彼等相如聲聞地。\n"+
		"　　又三種者‧如解深密經云‧「世尊‧毘缽舍那凡有幾種。慈氏‧略有三種‧一者有相毘缽\n"+
		"舍那‧二者尋求毘缽舍那‧三者伺察毘缽舍那。云何有相毘缽舍那‧謂純思惟三摩所行有\n"+
		"分別影像毘缽舍那。云何尋求毘缽舍那‧謂由慧故‧遍於彼彼未善了解一切法中為善了\n"+
		"故‧作意思惟毘缽舍那。云何伺察毘缽舍那‧謂由慧故‧遍於彼彼已善了解一切法中‧為善\n"+
		"證得極解脫故‧作意思惟毘缽舍那。」聲聞地說‧「謂於所聞所受持法‧或於教授‧由等引\n"+
		"地作意暫思‧未思未量未推未察‧如是名為唯隨相行。若復於彼思量推察‧爾時名為隨尋\n"+
		"思行。若復於彼既推察已‧如所安立復審觀察‧如是名為於已尋思隨伺察行。是名三門毘\n"+
		"缽舍那。」總此諸義‧初者例如緣無我義‧作意彼相‧不多決擇。第二於前未決定義為決定\n"+
		"故‧正善決擇。第三謂於已決定義‧如前伺察。"
		,
		/*===========================第 533 頁===========================*/
		"　　又六種者‧謂緣六事‧此是尋思毘缽舍那。尋思之理‧謂尋思一義二事三相四品五時\n"+
		"六理。既尋思已‧復審伺察。尋思義者‧謂正尋思如是語中有如是義。尋思事者‧謂正尋思此\n"+
		"為外事‧此為內事。尋思相者‧謂正尋思諸法二相‧此是自相‧此是共相‧或共不共。尋思品者‧\n"+
		"謂尋思黑品過失過患及尋思白品功德勝利。尋思時者‧謂尋思如是事曾在過去世‧尋思\n"+
		"如是事當在未來世‧尋思如是事今在現在世。尋思理者‧謂正尋思四種道理‧一觀待道理‧\n"+
		"謂諸果生‧觀待因緣。此別尋思世俗勝義及彼諸事‧二作用道理‧謂一切法各有作用‧例如\n"+
		"火有燒作用等‧此尋思相謂此是法‧此是作用‧由此法故作此作用。三證成道理‧謂所立義\n"+
		"不違諸量‧是正尋思於此法中‧有無現比至教三量。四法爾道理‧謂火燒熱性‧水濕潤性等‧\n"+
		"於彼法性應發勝解‧是為世間共許法性‧難思法性‧安立法性。不應思惟有餘道理‧令其如\n"+
		"是。\n"+
		"　　建立如是六種事者‧謂瑜伽師所知唯三‧謂言說義及所知中盡所有性‧如所有性。依\n"+
		"第一故‧立義尋思。依第二故‧立事尋思自相尋思。依第三故‧建立餘三及共相尋思。聲聞地\n"+
		"云‧「如是六事差別所緣及前三門毘缽舍那‧略攝一切毘缽舍那。」謂彼所說能攝一切"
		,
		/*===========================第 534 頁===========================*/
		"毘缽舍那。又初四種毘缽舍那其門有三‧即彼三中隨尋思行‧說有六種尋思之理‧是故三\n"+
		"門六事尋思‧攝於前四。又前所說‧力勵運轉作意等四‧聲聞地說是奢摩他毘缽舍那二所\n"+
		"共同‧故毘缽舍那亦有四種作意。慧度教授論云‧「如是四種毘缽舍那修習圓滿‧便能解\n"+
		"脫諸粗重縛‧九奢摩他修習圓滿解脫相縛。」諸大論中多作是說‧故修觀者‧謂如解深密\n"+
		"經所說‧由思擇等四門而修。其修止者‧謂由無分別九住心修。\n"+
		"<b><s>　第三修觀之法分二‧<n>一</n>破他宗‧<n>二</n>立自宗。</s></b>\n"+
		"　　初中有四。破第一宗者‧有作是說‧雖未證得無我正見‧但能執心令無分別‧便是修習\n"+
		"本性實義。以實義空‧永離一切是此非此‧如是住心與彼實義隨順轉故‧以境全非有‧心全\n"+
		"無執故。當問彼云‧如是修者‧於諸境界全無所有‧為已了知全無所有‧次隨順彼心全無執\n"+
		"而安住耶。為先未知由境實義無所有故‧心無執住即為修習境實義耶。若如初者‧云彼未\n"+
		"得正見而成相違‧汝許彼是了義見故。若如我說彼乃未明正理所破界限‧凡有所許‧便見\n"+
		"正理之所違害。其次全無所受取處‧是誹謗見‧故住彼上‧非是修習無倒真空‧前已廣說。若\n"+
		"作是思‧若以觀察實義正理推察諸法‧其諸有事無事法等皆非正理‧能立其有。故於勝義‧"
		,
		/*===========================第 535 頁===========================*/
		"諸法永離一切戲論‧雖彼補特伽羅未如是知‧然彼住相與彼相順‧是修空者‧太為過失。一\n"+
		"切根識皆不妄執此是此非順境實義‧應彼一切皆修實義。又如前說‧一切外道無分別止‧\n"+
		"皆應修空。此等尚多。又境本性與彼住心‧二相隨順‧唯由餘人證知便足‧則外道等皆成修\n"+
		"空‧無可遮遣。若謂不同‧此要由彼補特伽羅自知隨順次乃安住。若知如是隨順道理‧即得\n"+
		"正見‧云未得見無執安住便是修空‧成相違失。若謂任隨分別何事‧一切分別皆繫生死‧故\n"+
		"無分別住是解脫道‧前已廣破。若如是者‧則於和尚派‧亦無少過可設。修次後篇云‧「起如\n"+
		"是思‧立如是論‧諸分別心‧起善不善業增上故‧令諸有情受善趣等果流轉生死。若全不思\n"+
		"惟‧全不造作‧則解脫生死。以是因緣‧當全不思惟‧全不應修施等善行。修施等者‧唯為愚夫\n"+
		"增上而說。彼乃毀謗一切大乘‧大乘既是一切乘本‧由謗彼故謗一切乘。言不思惟‧謗觀察\n"+
		"慧‧審觀察慧是正智本‧謗彼即謗出世間慧‧斷其本故。言不應修施等善行‧畢竟謗毀施等\n"+
		"方便。總其智慧方便‧是名大乘。如聖伽耶經說‧諸菩薩道略有二種‧何等為二‧謂慧及方便。\n"+
		"聖如來秘密經說‧方便智慧‧由此二種‧總攝菩薩一切正道。故謗大乘作大業障‧由是因緣‧\n"+
		"毀謗大乘是諸寡聞執者我見‧未能承事聰叡丈夫‧未能了解如來語言‧自害害他違越教"
		,
		/*===========================第 536 頁===========================*/
		"理。彼毒語言‧凡諸聰叡自愛樂者‧猶如毒食‧而當遠棄。」此先安立和尚所許‧顯然說其若\n"+
		"如是許‧則是誹謗一切大乘‧如是敵者汝當了知。若謂我許修施等行不同彼者‧若唯以修\n"+
		"施等行故‧與他分別‧是說我與和尚修了義見同。若不爾者‧無分別定亦當分別。又一切分\n"+
		"別皆繫生死‧汝豈非求解脫生死‧若求解脫‧則行惠施持淨戒等皆須分別‧修彼何益‧前已\n"+
		"廣說。以是若許一切分別皆繫生死‧和尚尤善‧汝被相違重擔所壓。\n"+
		"　　又彼學者‧有作是念‧若多觀察二我相執之境‧其次乃斷能執之心。如犬逐石是名由\n"+
		"外斷截戲論‧故從最初持心不散‧如犬逐咬擲石之手。由修彼故‧於相執境令心不散‧一切\n"+
		"戲論自內斷截。故學教理決擇正見‧唯於名言漂流隨轉。此乃最下邪見‧謗毀一切佛經六\n"+
		"莊嚴等聰叡諸論。以彼經論‧唯用教理決擇義故。又二我相執所執之義‧當善觀察境為何\n"+
		"等‧次以清淨教理‧於彼所執定解為無。須從根本傾彼謬妄。若全未得如斯定解‧唯持其心‧\n"+
		"爾時於二我境雖未流散‧然非唯彼證無我義。若不爾者‧則重睡眠悶絕等位‧彼心無散‧彼\n"+
		"等亦當通達無我‧太為過失。猶如夜往未諳崖窟‧有無羅剎心懷恐怖‧不使燃燭照觀有無‧\n"+
		"除彼怖畏‧而云持心莫令羅剎分別散動與彼相同。修次下編說‧猶如戰時‧不效勇士張目‧"
		,
		/*===========================第 537 頁===========================*/
		"善觀怨敵所在而相擊刺‧反如怯兵‧見他強敵閉目待死。如云‧「曼殊室利遊戲經云‧童女‧\n"+
		"云何菩薩勝諸怨敵。白言‧曼殊室利‧謂善觀察‧見一切法皆不可得‧故瑜伽師應張智眼‧以\n"+
		"妙慧劍敗煩惱敵‧住無所畏‧不應如彼怯人閉目。」故如於繩誤以為蛇生恐怖時‧當生定\n"+
		"解‧知彼盤者是繩非蛇‧滅其錯誤及怖畏苦。如是誤執實有二我‧由彼錯誤起生死苦‧應以\n"+
		"教理引決定解‧決斷全無我執之境‧了知我執純為錯亂。次修彼義滅除錯誤。若彼滅者‧則\n"+
		"彼所起生死眾苦一切皆滅。中觀論等觀境破者理由即爾。提婆菩薩云‧「若見境無我‧能\n"+
		"滅三有種。」入中論云‧「分別依有實事生‧實事非有已思擇。」此說由邊執分別執有實\n"+
		"事‧彼等乃生‧已多觀察彼境非有。又云‧「通達我為此境已‧故瑜伽師先破我。」正理自在\n"+
		"云‧「若未破此境‧非能斷此執‧故斷有德失‧貪欲瞋恚等‧由不見彼境‧非以外道理。」其說\n"+
		"極多。\n"+
		"　　又若宣說‧一切分別皆繫生死‧故修空時應當斷除一切分別‧應如是觀‧異生修空‧空\n"+
		"無我義‧為現不現。若現見者‧彼補特伽羅應成聖者‧以現通達無我義故。若汝妄說現證無\n"+
		"我‧不違異生。我等亦說雖未現證空無我義補特伽羅‧不違聖者‧遍相等故。若謂如此現證"
		,
		/*===========================第 538 頁===========================*/
		"真實補特伽羅‧未知自境是真實義‧更待諸餘補特伽羅‧以聖教因成立真實令彼了解‧尤\n"+
		"為智者堪笑之處。以說弟子現量證得‧猶待師長比量立故。如斯言論‧莫於了知正理者前\n"+
		"而妄談說。又不應說雖以現量證真實義‧以比量因成立其名‧正理自在云‧「彼為極愚者‧\n"+
		"牧女已成故。」謂已成義乃至牧女皆能立名‧若於彼義仍復愚蒙‧乃立彼因‧愚癡如斯‧若\n"+
		"許亦能現證真實‧當說更有何等愚人不證真實。縱是真實‧譬如白相雖亦是牛‧然非牛相‧\n"+
		"如是唯由現見真實‧不可安立為真實相‧亦違自許。故說成立真實名言‧顯然言竭‧茲不廣\n"+
		"破。若修空者所修無我空義非是現事‧則許無分別識取非現事‧尤為可笑。總其修空‧異生\n"+
		"之心‧於無我境心未趣向‧修空相違‧若心趣向‧其境定是現否隨一。現證無我應成聖者‧若\n"+
		"許異生其無我義是不現見‧爾時唯以總相證無我義‧與離分別‧則成相違。又加行道世第\n"+
		"一法‧尚須總相證無我義‧而許現在初發業者‧修習空性心離分別‧最為相違。於無我義若\n"+
		"離分別‧猶易成立。其無錯亂‧應是瑜伽現量‧於無我義‧是離分別無錯識故。故若未得正見‧\n"+
		"以正理破我執境‧唯執持心於二我等不令逸散‧許為修習真無我義‧及許異生離分別識\n"+
		"修習無我‧是極漂流教理道外。"
		,
		/*===========================第 539 頁===========================*/
		"　　破第二宗者。有作是說‧若未獲得無我空見‧不分別住理非修空‧我等亦許‧故前非理。\n"+
		"然得無我了義正見補特伽羅‧其後一切無分別住‧皆是修空‧此亦非理。若得正見補特伽\n"+
		"羅‧凡彼所修無分別義‧一切皆修了義正見所決擇義‧則彼補特伽羅修菩提心‧有何理由\n"+
		"非修正見‧汝當宣說。若謂修菩提心‧雖是已得了義正見補特伽羅所修之事‧然於爾時‧非\n"+
		"憶彼見‧安住見上而修習故。若爾‧已得正見補特伽羅於修行時‧若憶彼見安住見上所有\n"+
		"修習‧縱是修空‧然彼一切無分別住‧云何皆為修習正見。故得見已‧於修習時當憶前見所\n"+
		"決擇義而修真空‧唯悶然住無所分別‧非修空義。此中自宗言全不分別‧前奢摩他及此科\n"+
		"中‧多數宣說‧謂不多觀察此是此非‧執一所緣而便安住‧非離分別。\n"+
		"　　破第三宗者。有作是說‧不許初宗未得正見無分別住為修真空‧其得見後無分別住\n"+
		"皆修空性‧亦非所許。然每臨修無分別時‧先以觀慧觀察一次‧其後一切無分別住‧皆是修\n"+
		"習空性之義。此亦非理。若如是者‧則臨睡時‧先以正見觀察一次‧其後重睡無分別時‧亦成\n"+
		"修空‧太為過失。以此二者同以正見觀察為先‧不須當時安住見上而修習故。故以正見善\n"+
		"觀察已‧住所決擇無自性義‧次略延長便失其見‧全無分別安住其心‧亦非修空。故當令自"
		,
		/*===========================第 540 頁===========================*/
		"分別敏捷‧住不住見相續觀察而善修習。\n"+
		"　　破第四宗者。有作是說‧不許前三‧修空性時‧當於空性先引定解。次於彼義攝持其心‧\n"+
		"不觀餘事‧正安住者‧是為無倒修習空性。以非如初宗心未向空‧非如二宗修無分別不憶\n"+
		"空見‧非如三宗見觀為先‧次無分別不住見故。此言以見觀察義‧謂憶其見‧次於見上唯修\n"+
		"安住許為修空‧非應正理。如是於空作止住修唯奢摩他‧仍無觀修毘缽舍那修習之理‧故\n"+
		"無止觀雙運修法‧唯一分故。\n"+
		"<b>菩提道次第廣論卷二十三終</b>"
		,
		/*===========================第 541 頁===========================*/
		"<b>菩提道次第廣論卷二十四</b>\n"+
		"　　第二自宗。若未得無我了義正見‧其身一切修行‧皆未趣無我‧故須先得無我正見。又\n"+
		"此非唯了知便足‧於正修時當憶其見而復觀察‧於所觀義應善修習。又於無我義須二種\n"+
		"修‧謂不觀察住與觀慧思擇‧非以一分便為滿足。\n"+
		"<b><s>　此中分三‧<n>一</n>雙修止觀之理‧<n>二</n>於彼斷諍‧<n>三</n>略攝修要。　　今初</s></b>\n"+
		"　　雙修止觀之理者‧於無我義‧若無決斷定見‧則不能生毘缽舍那功德‧以說此見是彼\n"+
		"因故。又說未聞彼見聖教障彼觀故‧解深密經云‧「世尊‧此奢摩他毘缽舍那‧以何為因。慈\n"+
		"氏‧清淨尸羅‧聞思所成清淨正見‧以為其因。」又云‧「於諸聖教不隨欲聞‧是毘缽舍那\n"+
		"障。」那羅延請問經說‧「由聞生慧‧慧斷煩惱」等‧如前所引多宣說故。從彼正見生毘缽\n"+
		"舍那之理‧謂初決擇時‧由多教理觀察決擇。既決擇已‧不以觀慧數思擇修‧唯止住修猶不\n"+
		"能生‧故成奢摩他後‧正修觀時當觀察修。此有一類‧初雖不許全不觀察‧然以聞思決擇之\n"+
		"後於正修時‧謂觀察修諸分別心皆是相執‧不如是修‧是許分別皆是相執‧及諸異生離分"
		,
		/*===========================第 542 頁===========================*/
		"別識而修無我‧前已廣破‧不應道理。又彼一切分別皆是諦執‧於正修時須破除者‧正決擇\n"+
		"時亦是分別決擇‧彼等亦應破除。又為弟子講說辯論著述觀閱‧彼等一切皆是分別‧汝於\n"+
		"爾時‧亦當破除。以諸諦執修時應破‧餘時不破‧無差別故。若不許爾‧而說教理多門觀察‧是\n"+
		"於未解無我義時‧為求通達‧已得正見正修行時‧則無所須。若爾真見道中‧現證無我‧次更\n"+
		"修習已見無我‧當成無義。若謂須修‧以諸修惑由修乃斷‧唯以現見不能斷除。此亦相同‧前\n"+
		"以聞思雖已決擇‧更當修習所決擇故。如幾許修所決擇義‧則有爾許猛利恆常明了堅固\n"+
		"定解等德‧可現見故。釋量論云‧「決定與增益‧能害所害故。」此說彼二能所害故‧如其定\n"+
		"解堅固猛利‧增益便受爾許傷損。故於此中‧亦須漸增無性定解‧當由多門思惟能破及能\n"+
		"立故。若不爾者‧則於無常業果生死過患‧大菩提心及慈悲等‧得了解已‧應不更觀察‧惟念\n"+
		"我死而修習之‧理由等故。故欲引生清淨定解‧惟念我死‧為利有情願當成佛‧眾生可愍等‧\n"+
		"但有誓願而非完足‧當以眾多理由思惟。如是堅固猛利無性定解‧唯有誓願亦非完足。當\n"+
		"由眾多能立能破門中思惟‧於下士時已數宣說。修次三篇‧皆說成就奢摩他後‧正修觀時\n"+
		"數觀察修。入中論云‧「故瑜伽師先破我。」說正修時應修思擇。瑜伽師者‧謂於止觀得隨"
		,
		/*===========================第 543 頁===========================*/
		"一故‧未得止前‧非於正見不求解故。又靜慮後‧於般若時‧說見觀察‧意謂由彼次第修靜慮\n"+
		"後觀二無我。中觀心論云‧「具慧住定後‧於名言所取‧彼諸法有事‧以慧如是觀。」釋論說\n"+
		"為生定之後‧見觀察修。入行論中‧依靜慮品修奢摩他‧次修般若說以正理‧觀擇修故。又後\n"+
		"二度及後二學‧一切次第皆先修定‧次修智慧以為次第。又修慧時‧凡說觀察如所有性‧盡\n"+
		"所有性‧一切皆是修行次第‧莫作異觀。又非但此‧諸大經論皆如是說‧故正修時定應觀察。\n"+
		"如是成就奢摩他後‧若修觀時純修觀察‧前止失壞復未新修‧則無寂止‧由無止故觀亦不\n"+
		"生‧已如前說‧故須雙修前安住止及新修觀‧謂修觀後即於彼義而修寂止‧故緣無我而能\n"+
		"修成止觀雙運。修次中篇云‧「聖寶雲經云‧如是善巧諸過失已‧為離一切諸戲論故‧當於\n"+
		"空性而修瑜伽。如是於空多修習已‧若於何處令心流散令心欣樂‧即於是處尋思自性了\n"+
		"解為空。又於內心亦當尋思了解為空‧次更尋思能了解心所有自性‧亦知其空。由如是解\n"+
		"而能悟入無相瑜伽‧此顯要由尋思為先。悟入無相‧顯然顯示非唯棄捨作意思惟及不以\n"+
		"慧推求法性‧而能悟入無分別性。」此論宣說‧要先推求心散亂境及散亂心了達為空‧尋\n"+
		"求觀察能解空者‧亦達其空‧彼等皆是修空時修。由其觀察了達為空‧乃能悟入無相瑜伽‧"
		,
		/*===========================第 544 頁===========================*/
		"故若不以正理觀擇推求為先‧如和尚許‧唯攝散心棄捨作意‧顯然不能悟入無相‧或無分\n"+
		"別。故如前說‧當於諸法以正理劍‧破二我性令無塵許‧於無我理引發定解。如是若無二我\n"+
		"實事‧破我無事豈能實有。譬如若執無石女兒無事實有‧必待先見石女與兒‧若曾未見石\n"+
		"女與兒‧誰亦不說無實女兒而是實有。任於何處‧若先未曾見實有事‧則執實有無事分別\n"+
		"亦終不生。執相分別一切皆滅‧以諸分別執實有者‧皆是妄執有事無事而為實有‧能遍既\n"+
		"滅所遍亦滅‧修次第中作彼說故。如是應於有事無事決定全無塵許實性引生定解‧及當\n"+
		"安住所決斷義‧迭次而修‧乃能引發無分別智。非於境界全不觀察‧唯攝作意所能引發‧以\n"+
		"不能斷諦實執故。唯於執有‧不起分別‧非是通達無諦實故。如是唯不分別有我非達無我‧\n"+
		"唯由修彼則於我執全無損故‧故於實有及於二有不起分別‧與達無實及無二我‧應善分\n"+
		"別最為切要。\n"+
		"　　第二斷諍。若作是念‧於無我義推求觀察‧是分別心‧從此能生無分別智實屬相違‧因\n"+
		"果二法須隨順故。世尊於此並喻而答迦葉問品云‧「迦葉‧譬如兩樹為風振觸便有火生‧\n"+
		"其火生已還焚兩樹。迦葉‧如是觀察生聖慧根‧聖慧生已燒彼觀察。」此說觀察發生聖慧。"
		,
		/*===========================第 545 頁===========================*/
		"修次中篇云‧「彼由如是以慧觀察‧若瑜伽師不執勝義諸法自性‧爾時悟入無分別定‧證\n"+
		"一切法無自性性。若不修習以慧觀察諸法自性‧唯一修習棄捨作意‧終不能滅所有分別‧\n"+
		"終不能證無自性性‧無慧光故。如世尊說‧從觀察生如實智火‧燒分別樹‧猶如鑽木鑽出之\n"+
		"火。」若不爾者‧從有漏道‧亦不應有無漏道生‧亦無異生而得聖果‧因果二法不相似故‧如\n"+
		"是白種發生青芽‧從火生煙‧從女生男‧現有彼等無邊因果極不相似。又聖無分別智‧是已\n"+
		"現證二我執境空無我義‧為生彼故現當思擇我執之境‧通達彼無而善修習。彼雖亦是分\n"+
		"別‧然是無分別智極隨順之因‧如前所引三摩地王經云‧「若於諸法觀無我。」修次下篇\n"+
		"云‧「此修雖是分別為性‧然是如理作意自性‧故能出生無分別智‧樂此智者當依彼修。」\n"+
		"若作是念‧般若經說若於色等空無我行‧亦是相行‧故觀察空不應道理。如是等類‧是說於\n"+
		"空執為實有‧非說取空‧前已廣說。若不爾者‧即彼經云‧「菩薩摩訶薩‧若行般若波羅蜜多‧\n"+
		"修習般若波羅蜜多‧如是觀察如是思惟‧何為般若波羅蜜多‧即此般若波羅蜜多‧是誰所\n"+
		"有‧若無何法‧若不可得‧是名般若波羅蜜多耶‧若如是觀察如是思惟。」此說正修般若度\n"+
		"時‧當須觀察。般若心經問如何行甚深般若波羅蜜多‧答「照見五蘊自性皆空。」攝頌亦"
		,
		/*===========================第 546 頁===========================*/
		"云‧「若為無為黑白法‧慧析塵許不可得‧於世說預慧度數。」此說以慧觀察諸法‧雖微塵\n"+
		"許見不可得預慧度數。如此等類說須觀察‧云何相違。若不許爾‧經說不應觀察諸法‧有何\n"+
		"道理。若如和尚說‧一切分別皆繫生死‧則念當請無分別教授及當修行無分別等‧應許一\n"+
		"切皆是繫縛‧破彼邪執前已廣說。故於諸法不應執實‧是彼經義。又如於繩誤以為蛇起憂\n"+
		"苦時‧了知無蛇如心所執‧能滅錯誤非餘方便‧於執實境‧當以正因定知無實‧修習彼義‧乃\n"+
		"能滅除執實分別‧非唯攝錄執實之心‧便能滅除。又當受許執實為誤‧若非錯誤無可破故。\n"+
		"雖許心誤‧若不了知無彼執境‧其心錯誤云何能知‧以誤為誤‧唯由有無所執境故。又無執\n"+
		"實如所執境‧非為誓許便能成立‧必待清淨能成教理。如是立已‧決擇無實‧次不分別實諦\n"+
		"而住是我所許‧故無分別須以觀慧觀察為先‧非不分別便為滿足。當知如修次下篇云‧\n"+
		"「故正法中‧凡說無念及無作意‧當知皆以審察為先。何以故‧由審觀察乃能無念‧能無作\n"+
		"意‧非餘能爾。」又云‧「毘缽舍那‧以審觀察而為體性。」聖寶雲經解深密等‧皆如是說。如\n"+
		"寶雲經云‧「毘缽舍那善思擇故‧了達無性悟入無相。」聖楞伽經云‧「大慧‧以慧推察‧乃\n"+
		"不分別自相共相‧名為一切諸法無性。」設若不須審觀察者‧世尊如是彼彼經中‧宣說多"
		,
		/*===========================第 547 頁===========================*/
		"種審諦觀察‧皆與相違。故理當說我慧下劣‧精進微少‧未能周遍尋求多聞‧然佛世尊讚歎\n"+
		"多聞‧故一切時不應謗彼。如是經說‧從色乃至一切種智心皆不住者‧謂不應執有實可住\n"+
		"境。若不爾者‧於六度等亦如是說‧則亦不應住六度等‧不應執實而安住者‧亦如前說。要先\n"+
		"了解彼等無實‧凡經宣說‧如是無住及無分別‧當知一切皆以破除諸境自性‧或諦實性觀\n"+
		"察為先。故經說為不可思議‧超心境等‧是為破除諸增上慢‧唯以聞思便能證得甚深空義‧\n"+
		"顯示彼義唯聖內證‧餘人難思。又為破除‧於甚深義妄執實有非理思惟‧故作彼說‧當知非\n"+
		"破以正觀慧如理觀察。如修次下篇云‧「如是若聞彼彼經中難思等語‧謂若有思‧唯以聞\n"+
		"思能證真實‧彼彼經中為破如是增上慢故‧顯示諸法唯各內證。又當了知‧是為破除非理\n"+
		"思惟‧非為破除審正觀察。若不爾者‧違多教理。」違多教者‧如迦葉品云‧「迦葉‧云何中道\n"+
		"觀察諸法‧迦葉‧謂若於法觀察無我‧及無有情‧無命‧無養‧無士夫‧無補特伽羅‧無意生‧無儒\n"+
		"童‧迦葉‧是名中道觀察諸法。」與如是等悉皆相違。修次初篇云‧「入無分別陀羅尼云‧由\n"+
		"無作意斷色等相。此中密意‧以慧觀察見無可得‧名無作意‧非說全不作意。如無想定暫伏\n"+
		"作意‧非能斷除無始時來色等愛著。」此論師所造‧此陀羅尼釋中‧亦顯然解釋。總於大乘‧"
		,
		/*===========================第 548 頁===========================*/
		"除聖龍猛及聖無著‧造論解釋二見之外‧更無餘見。印藏智者‧亦定依止此二所解二見隨\n"+
		"一‧故此二派隨一之見‧各如論說‧當善尋求。依聖父子論尋求之理‧如前廣說。若隨聖無著\n"+
		"行‧謂於真實異體二取‧一切本空‧然於愚夫現似異體‧如其所現執境為實‧名遍計執‧於依\n"+
		"他上以正教理‧破除一切其無二義‧名圓成實‧於此當得堅固定解。次當安住彼見之上‧雙\n"+
		"修止住及修觀察。若僅獲得如斯見解‧正修之時不住於見‧唯不分別亦非修空。決擇彼宗\n"+
		"正見之理‧及於已決擇義‧別修止觀‧合修雙運。般若波羅蜜多教授論中‧最為明顯‧故當觀\n"+
		"閱。若善解此宗‧能如論說而正修習‧亦極希有。大乘經論‧下至總略顯甚深義‧其數極多‧然\n"+
		"未說者‧亦復不少‧於未說中當引已說‧於未廣說當引廣說。如是廣大行品‧當知亦爾。若無\n"+
		"甚深或無廣大‧僅於一分‧不應執為如是便足‧故多經論‧於示道師圓滿德相‧密意說云‧\n"+
		"「善一切乘。」\n"+
		"　　第三略攝修要。若如前說‧已得了義見者‧於能發生我我所執‧我我所事‧如前決擇無\n"+
		"自性時‧應以觀慧數數觀察‧次於彼義發起定解‧餘勢當間雜修‧持心不散與觀慧思擇。爾\n"+
		"時‧若由多觀擇故‧住分減少‧當多修止令生住分。若由多修止力‧住分增盛不樂觀察‧若不"
		,
		/*===========================第 549 頁===========================*/
		"觀察‧於真實義不生堅固猛利定解。若未生彼‧則不能害定解違品增益我執‧故當多修觀\n"+
		"察‧令其止觀二分平均。如修次下篇云‧「若時多修毘缽舍那‧智慧增上‧由奢摩他力微劣\n"+
		"故‧如風中燭令心搖動‧不能明了見真實義‧故於爾時當修正奢摩他。若正奢摩他勢力增\n"+
		"上‧如睡眠人‧不能明了見真實義‧故於爾時當修智慧。」加行結行及未修間‧應如何行‧當\n"+
		"知如同下士時說。如是修習無我義時‧沈掉生起如何了知‧為斷沈掉修念正知‧得無沈掉‧\n"+
		"平等等捨任運轉時‧緩功用等‧當知同前奢摩他時所說。般若波羅蜜多教授論說‧於所修\n"+
		"境‧修奢摩他令起輕安。又於彼境‧觀察修習毘缽舍那引發輕安。各別修已次乃雙運。若如\n"+
		"此說‧非定一座連修止觀‧是許亦可別別分修。此中要者‧謂內無明如何增益‧須破其執‧彼\n"+
		"相違品‧謂自性空。於此空上應當引起猛利定解‧而修空性。若於我執及無明執‧全未破壞\n"+
		"別修餘空‧於二我執毫無所損‧故諸先覺數數說如「東門有鬼‧西門送俑」‧現見實爾。上\n"+
		"述此等唯粗概要‧其正修時微細得失‧更須親近聰叡知識及自內修而當了知‧故不廣說。\n"+
		"如是修法‧是依先覺道次教授‧略為增廣‧如博朵瓦寶瓶論云‧「有於聞思之時‧正理決擇\n"+
		"無性‧修唯修無分別‧如是非真對治‧別修無關空故。是故修時亦以緣起離一異等‧修何即"
		,
		/*===========================第 550 頁===========================*/
		"當觀察‧亦略無分別住‧此修能治煩惱‧覺弟子所許‧欲行到彼岸法‧彼即修慧方便。又當\n"+
		"先修人空‧次法如是隨轉。」覺亦云‧「由何能證空‧如來記龍猛‧現見法性諦‧弟子名月\n"+
		"稱‧依彼傳教授‧能證法性諦。」其導引法‧如覺所造中觀教授說‧先修觀察‧次住所觀之\n"+
		"義間雜而修。此與蓮花戒論師宗義無別。又如前說入中論‧中觀心論‧寂天論師等‧意趣皆\n"+
		"爾。慈氏諸論。聖無著論‧亦多宣說。住持彼宗無倒聰叡寂靜論師‧於般若波羅蜜多教授論\n"+
		"中‧解釋尤顯。故修毘缽舍那法‧龍猛無著兩派所傳‧論典教授皆相隨順。\n"+
		"　　第四修觀成就之量。如是觀慧觀擇修習‧乃至未生前說輕安‧是名隨順毘缽舍那‧生\n"+
		"輕安已乃是真實毘缽舍那。輕安體相生起道理‧俱如前說。又奢摩他先得未失‧亦有由彼\n"+
		"所引輕安‧故非略有輕安便足。若爾云何‧謂修觀察‧若由自力能引輕安‧此後乃名毘缽舍\n"+
		"那。緣盡所有性及緣如所有性‧二種毘缽舍那‧得限皆同。如解深密經云‧「世尊‧若諸菩薩\n"+
		"乃至未得身心輕安‧於如所思所有諸法‧內三摩地所行影相作意思惟‧如是作意當名何\n"+
		"等。慈氏‧非毘缽舍那‧是隨順毘缽舍那勝解相應作意。」般若波羅蜜多教授論云‧「彼由\n"+
		"獲得身心輕安為所依止‧即於如所善思惟義‧內三摩地所行影像‧勝解觀察‧乃至未生身"
		,
		/*===========================第 551 頁===========================*/
		"心輕安‧是名隨順毘缽舍那所有作意。若時生起‧爾時即名毘缽舍那。」此說緣於盡所有\n"+
		"性成奢摩他‧毘缽舍那及雙運等‧與緣如所有性相同。若由自力能引輕安‧則亦能引心一\n"+
		"境性‧故由觀慧思擇自力而能引生心一境性‧是由已成正奢摩他所有功德。如是善成奢\n"+
		"摩他者‧由修觀察亦能助伴正奢摩他‧故不應執凡修觀察‧住分損減。又成不成緣如所有\n"+
		"止修觀修毘缽舍那‧謂由是否隨於一種無我正見‧獲得無謬清淨了解緣彼而修‧而為判\n"+
		"別‧非餘能判。為由何等不能判別‧謂修習故‧心境二相粗分皆滅‧如淨虛空‧心具顯了澄淨\n"+
		"差別‧如無風燭不動久住。意識所現內外諸相皆覺如虹或如薄煙‧久住彼相。又於意識現\n"+
		"起一切所取境界‧注心觀察皆不忍觀漸趣隱沒。又彼先從粗相外境‧色聲等上‧如是顯現。\n"+
		"次漸修習‧內心了別領觸等相亦漸離脫‧於彼住心皆不堪住‧雖有彼等境相現起‧然非獲\n"+
		"得‧通達無二真實正見。又彼諸境‧現為杳茫‧亦全不能立為通達中觀所說如幻之義‧以於\n"+
		"正見心未趣向久修住分‧皆有如是境相現故。如幻之義要如前說‧依止二量乃能現起‧一\n"+
		"決斷無性理智定解‧二顯現難遮名言量成。色等諸境於意識前‧現為薄淨似虹霓者‧是離\n"+
		"所觸礙著之相‧及雖無礙而甚明顯二相聚合。此定解中。全無無性真定解故‧是將所破自"
		,
		/*===========================第 552 頁===========================*/
		"性‧與質礙觸執二為一‧假名無自性故。若不爾者‧許彼即是中觀所說如幻妄義‧見如虹霓\n"+
		"薄煙之事‧應不於彼起諸分別‧執有自性‧以於彼事所起定解‧即是定解境無性故。又凡取\n"+
		"其質礙觸事‧應不於彼引無性解‧以取彼事即是妄執有自性故。是故色等如是現時‧現為\n"+
		"微薄澄淨等相‧非能破壞執實之境‧故亦非是如幻之義。若已先得清淨正見未忘失者‧容\n"+
		"現如幻‧前已廣說。善知識阿蘭若師所傳諸道次中‧關於引生空解道理‧曾作是說‧「先修\n"+
		"補特伽羅無我‧次於法無我義‧若念正知攝持而修‧若時太久‧念知難攝‧時沈時掉利益極\n"+
		"小‧故以上午下午初夜後夜四座之中各分四座‧一晝夜中修十六座‧尚覺明了感觸之時‧\n"+
		"即當止息。由如是修覺修未久‧然觀時間日時速逝‧是攝心相。若覺久修觀時未度‧是未攝\n"+
		"心‧攝持心時煩惱輕微‧自覺一生似無睡眠‧次能一座經上午等。爾時生定能具四相‧一無\n"+
		"分別‧謂住定時‧雖息出入皆不覺知。息及尋思至極微細‧二明了‧謂與秋季午時空界明了\n"+
		"無別。三澄淨‧謂澄如杯中‧注以淨水置日光下。四微細‧謂住前三相之中‧觀外諸法細如毛\n"+
		"端了了可見。如是隨順無分別智‧然若觀待無分別智‧則此自性仍是分別‧說名顛倒。辨中\n"+
		"邊論云‧隨順為顛倒。」如辨中邊論‧說諸異生修習空性‧其最善者‧亦當立為隨順顛倒‧故"
		,
		/*===========================第 553 頁===========================*/
		"雖未生所餘眾相‧若修前說無謬正見‧是名修習無我之義。若未能修決擇無謬正見之義‧\n"+
		"縱有四相不能立為修諸了義‧是故是否修如所有義‧如前所說。如修彼故‧後現如幻亦如\n"+
		"前說‧應當了知。\n"+
		"　　第三止觀雙運法。如前成就止觀量時所說‧若先未得止觀二法‧無可雙運‧必須先得\n"+
		"止觀二法。此復初得毘缽舍那即得雙運‧其中道理‧謂依先得奢摩他故‧修正觀察。論於此\n"+
		"中亦說漸生力勵轉等四種作意。若時生起‧如前所說第四作意即成雙運‧此謂修習觀察\n"+
		"之後‧雜修安住‧若得住相如前奢摩他時所得‧則成雙運。如聲聞地云‧「齊何當言奢摩他\n"+
		"毘缽舍那‧二種和合平等俱轉‧由此說名雙運轉道。答‧若有獲得九相心住中‧第九相心住\n"+
		"謂三摩呬多‧彼用如是圓滿三摩地為所依止。於觀法中修增上慧‧彼於爾時由觀法故。任\n"+
		"運轉道無功用轉。如奢摩他道不由加行‧毘缽舍那清淨鮮白‧隨奢摩他調柔攝受‧齊此名\n"+
		"為奢摩他毘缽舍那‧二種和合平等俱轉‧由此名為奢摩他毘缽舍那‧雙運轉道。」修次下\n"+
		"篇云‧「若時由其遠離沈掉平等俱轉‧任運轉故‧於真實義心最明了‧爾時當緩功用而修\n"+
		"等捨‧當知爾時是名成就奢摩他毘缽舍那‧雙運轉道。」何故彼名雙運轉道‧答由未雙得"
		,
		/*===========================第 554 頁===========================*/
		"止觀之前‧唯以觀慧修觀察力‧不能引生無分別住‧止修觀修必須各別功用修習‧得二品\n"+
		"已‧即以觀慧觀察之力‧便能引生正奢摩他‧故名雙運。此中觀察‧即是毘缽舍那。觀後安住\n"+
		"即奢摩他‧其殊勝者謂緣空性。般若波羅蜜多教授論云‧「從是之後‧即緣有分別影像‧若\n"+
		"時此心無間無缺‧作意相續‧雙證二品‧爾時說名雙運轉道。其奢摩他毘缽舍那‧是名為雙\n"+
		"運‧謂具足更互繫縛而轉。」無間缺者‧謂觀察後不須別修無分別住‧即由觀修‧便能引生\n"+
		"無分別住。證二品者‧謂緣無分別影相正奢摩他‧及緣有分別影相毘缽舍那‧二品俱證‧然\n"+
		"非同時‧謂即觀修作意無間相續而證。若爾‧前說成就奢摩他後‧即由觀慧修習觀察能引\n"+
		"住分‧豈不相違。答‧若未成就奢摩他前‧數數觀察雜修止相‧定不能成正奢摩他。若已獲得\n"+
		"奢摩他後‧如是雜修正奢摩他答可得成‧前文為顯如是差別‧故不相違。又將成就毘缽舍\n"+
		"那‧其前無間由觀察修‧有時能引專注一趣‧前亦思彼。今此宣說毘缽舍那未成之前‧以觀\n"+
		"察修不能引生無分別者‧除彼例外‧意取其前未能成時。總其未成奢摩他前。觀察之後雜\n"+
		"修止相‧不能成就正奢摩他。若已成就奢摩他後‧毘缽舍那未成之前‧觀察自力不能引發\n"+
		"堅穩安住專注一趣‧故以觀慧數數觀察‧即由觀察而能引得堅穩住者‧要得毘缽舍那乃"
		,
		/*===========================第 555 頁===========================*/
		"有‧故亦從此建立雙運。是故唯於未壞堅穩無分別住‧兼能觀察無我空義‧猶如小魚游安\n"+
		"靜水‧不當誤為止觀雙運。如是止觀雙運之理‧應如彼等清淨論典所說而知‧餘增益說‧非\n"+
		"可憑信。由此等門而修止觀‧雖尚可分眾多差別‧然恐文繁故不多述。\n"+
		"　　今當略說道之總義‧謂於最初道之根本‧即是親近知識道理‧故於彼上當善修鍊。次\n"+
		"於暇身‧若起真實取心要欲‧彼從內策令恆修行‧為生彼故當修暇滿。次若未滅求現法心‧\n"+
		"則於後世不能發生猛利希求‧故當勤修人身無常‧不能久住‧死後流轉惡趣道理。爾時由\n"+
		"生真心念畏‧便能誠信三寶功德‧安住皈依不共律儀學其應學。次於業果當由多門引發\n"+
		"堅固深忍信解‧是為一切白法根本‧勤修十善滅十不善‧相續轉趣四力之道。如是善修下\n"+
		"士法已‧當多思惟‧若總若別生死過患‧總於生死令心厭捨。次觀生死從何因生‧當識煩惱\n"+
		"及業自性‧發起真實樂斷之欲‧便於真能解脫生死三學總道‧能引定解‧特於所受別解脫\n"+
		"戒‧當勤修學。如是善學中士法已‧作意思惟‧如自墮落三有苦海‧眾生皆爾‧應當勤修慈悲\n"+
		"為本大菩提心‧必令生起。若無此心‧其六度行二次第等‧皆如無基而建樓閣。若相續中‧略\n"+
		"能生起菩提心相‧當如儀受勤學學處‧堅穩願心。次當聽聞菩薩所有諸廣大行‧善知進止‧"
		,
		/*===========================第 556 頁===========================*/
		"發生猛利樂修學欲。發此心已‧當如法受行心律儀‧學習六度成熟自身‧學四攝等成熟有\n"+
		"情‧尤當勤猛捨命防範諸根本罪‧中下纏犯及諸惡作‧亦當勤防莫令有染。若有誤犯‧應勤\n"+
		"還出。次當特學最後二度‧故當善巧修靜慮法引發正定。又於相續當生清淨遠離斷常二\n"+
		"無我見‧得彼見已‧應住見上善知清淨修法而修‧即於如是靜慮般若立止觀名‧非離後二\n"+
		"波羅蜜多‧而為別有。故是正受菩薩律儀‧學彼應學從中分出。此復若能修習下下‧漸於上\n"+
		"上增欲得心‧聽聞上上而於下下漸欲修行‧是最切要。若於前者全無所有‧專修心住專樂\n"+
		"見解‧難至宗要‧故須對於圓滿道體引生定解。修彼等時‧亦當聰利令心平等‧謂於引導修\n"+
		"道知識‧敬心微劣‧則斷一切善法根本‧故當勤修依師之法‧如是若心不樂修行‧當修暇滿‧\n"+
		"若著現法當修無常‧惡趣過患以為主要。若覺漫緩所受佛制‧當自思惟是於業果定解劣\n"+
		"弱‧則以修習業果為主。若於生死缺少厭患‧求解脫心則成虛言‧故當思惟生死過患。若凡\n"+
		"所作‧皆為利益有情之心不猛利者‧是則斷絕大乘根本‧故當多修願心及因。若受佛子所\n"+
		"有律儀‧學習諸行而覺執相繫縛猛利‧當以理智‧破執相心一切所緣‧而於如空如幻空性‧\n"+
		"淨修其心。若於善緣心不安住為散亂奴‧則當正修安住一趣‧是諸先覺已宣說者。以彼為"
		,
		/*===========================第 557 頁===========================*/
		"例‧其未說者亦當了知。總之‧莫令偏於一分‧令心堪修一切善品。\n"+
		"　　已釋上士道次第中學菩薩行‧應如何學慧性毘缽舍那之法。\n"+
		"　　第二特學金剛乘法。如是善修顯密共道‧其後無疑當入密咒‧以彼密道較諸餘法最\n"+
		"為希貴‧速能圓滿二資糧故。若入彼者‧如道炬論說‧先以財敬奉教行等‧令師歡喜。較前所\n"+
		"說尤為過上‧然是對於能具咒說最下之德相者‧乃如是行。其次先以清淨續部能熟灌頂‧\n"+
		"成熟身心。次當聽聞了知守護‧爾時所受三昧耶律。若為根本罪犯染著‧雖可重受‧然於相\n"+
		"續‧生道功德最為稽留‧故常勇猛莫令染著。又當勵力莫犯粗罪‧設有誤犯‧亦當勤修還出\n"+
		"方便‧彼等皆是修道基礎‧若無彼者‧則如牆傾‧諸危屋故。曼殊室利根本教云‧「佛未說犯\n"+
		"戒‧能成就諸咒。」此說全無上中下品三等成就。無上瑜伽續說‧若不守護諸三昧耶‧下劣\n"+
		"灌頂不知真實‧此三雖修終無成就‧故若不護三昧耶律而云修道‧是極漂轉咒理之外。\n"+
		"　　若能如是護三昧耶‧及諸律儀而修咒道‧當先修習堪為依據續部所說‧生起次第圓\n"+
		"滿尊輪。以咒道中不共所斷‧謂於蘊處界執為平俗庸常分別‧能斷彼者‧亦即能轉外器內\n"+
		"身及諸受用‧為殊勝事生次第故。如是善淨庸常分別‧一切時中恆得諸佛菩薩加持‧速能"
		,
		/*===========================第 558 頁===========================*/
		"圓滿無邊福聚‧堪為圓滿次第法器。其次當修堪為依據續部所說圓滿次第‧棄初次第‧唯\n"+
		"修後攝道一分者‧非彼續部及造彼釋聰叡所許‧故當攝持無上瑜伽圓滿道體二次宗要。\n"+
		"此中唯就彼等諸名‧略為顯示入咒方隅‧於諸咒道次第‧應當廣知。能如是學‧即是修學總\n"+
		"攝一切經咒宗要之圓滿道體‧令得暇身具足義利‧能於自他增廣佛教。\n"+
		"<b><s>　能觀無央佛語目　　如實善達一切法　　能令智者生歡喜　　由親諸修如斯理\n"+
		"　知識初佛妙音尊　　善皈依故是彼力　　故願善擇真實義　　彼勝智者恆護持\n"+
		"　南洲聰叡頂中嚴　　名稱幡幢照諸趣　　龍猛無著漸傳來　　謂此菩提道次第\n"+
		"　盡滿眾生希願義　　故是教授大寶王　　攝納經論千流故　　亦名吉祥善說海\n"+
		"　此由燃燈大智者　　光明顯揚雪山中　　此方觀視佛道眼　　故經多時未瞑閉\n"+
		"　次見如實知聖教　　宗要聰叡悉滅亡　　即此妙道久衰微　　為欲增廣聖教故\n"+
		"　盡佛所說諸法理　　攝為由一善士夫　　乘於大乘往佛位　　正所當修道次第\n"+
		"　此論文言非太廣　　一切要義無不具　　雖諸少慧且易解　　我以教理正引出\n"+
		"　佛子正行難通達　　我乃愚中最為愚　　故此所有諸過失　　當對如實知前悔</s></b>"
		,
		/*===========================第 559 頁===========================*/
		"<b><s>　於此策勤有集積　　二種資糧廣如空　　願成勝王而引導　　癡蔽慧目諸眾生\n"+
		"　未至佛位一切生　　願為妙音哀攝受　　獲得圓滿教次第　　正行勝道令佛喜\n"+
		"　如是所解道中要　　大悲引動善方便　　除遣眾生冥闇意　　長時住持佛教法\n"+
		"　聖教大寶未普及　　雖遍遷滅於是方　　願由大悲動我意　　光顯如是利樂藏\n"+
		"　從佛菩薩微妙業　　所成菩提道次第　　樂解脫意與勝德　　令長修持諸佛事\n"+
		"　願編善道除違緣　　辦諸順緣人非人　　一切生中不捨離　　諸佛所讚真淨道\n"+
		"　若時我於最勝乘　　如理勤修十法行　　爾時大力恆助伴　　吉祥德海遍十方</s></b>\n"+
		"　　總攝一切佛語扼要‧龍猛無著二師道軌‧能往一切種智地位勝士法範‧三士所修一\n"+
		"切次第圓滿開示‧如此菩提道次第者‧謂依哦姓具慧般若摩訶薩埵‧彼之紹師精善三藏‧\n"+
		"正行法義‧拔濟眾生‧長養聖教‧寶戒大師‧及因前代持律師中‧眾所稱歎賈持調伏。（號精\n"+
		"進然）彼之紹師智悲教證功德莊嚴‧大雪山聚持律之中高勝如幢‧第一律師嗉樸堪布\n"+
		"寶吉祥賢‧並諸餘眾誠希求者‧先曾屢勸。後因精善顯密眾典‧珍愛三學‧荷擔聖教無能倫\n"+
		"比‧善嫻二語大善知識‧摩訶薩埵勝依吉賢殷勤勸請。係從至尊勝士空諱（號虛空幢）"
		,
		/*===========================第 560 頁===========================*/
		"聞蘭若師‧傳內蘇巴及慬哦瓦所傳道次。又從至尊勝士賢號‧（名法依賢）聞博朵瓦傳\n"+
		"霞惹瓦及博朵瓦傳授鐸巴道次等義。教授根本道炬論中‧唯除開示三士總相‧餘文易解\n"+
		"故未全引。以大譯師（具慧般若）及卓壟巴父子所著道次為本‧並攝眾多道次要義‧圓\n"+
		"滿道分易於受持‧次第安布無諸紊亂。雪山聚中闢道大轍‧於無量教辯才無畏‧如理正行\n"+
		"經論深義‧能發諸佛菩薩歡喜‧最為希有摩訶薩埵‧至尊勝士叡達瓦等‧（號童慧）頂戴\n"+
		"彼諸尊長足塵。多聞比丘修斷行者東宗喀生‧善慧名稱吉祥‧著於惹珍勝阿蘭若獅子崖\n"+
		"下福吉祥賢書。\n"+
		"<b>菩提道次第廣論卷二十四終</b>\n"+
		"<b><s>　民國二十三年古曆冬月十五日‧譯於重慶縉雲山世界佛學苑漢藏教理院‧又本文前六卷\n"+
		"　係在藏地隨學隨譯‧次後五卷是在仰光及船上譯‧其後十三卷在本院譯‧二十四年六月並\n"+
		"　校改一次。</s></b>"
		,
		/*===========================第 561 頁===========================*/
		"<b><s>附錄一：</s></b>\n"+
		"<b>菩提道次第略論(止觀)　　　　　　　　　　　　　　　　　　　　　法尊法師</b>\n"+
		"<b><s>　子二別於後二度修學法分四‧丑初止觀自性‧丑二學止法‧丑三學觀法‧丑四學雙運法‧</s></b>\n"+
		"<b><s>　今初</s></b>\n"+
		"　　經說三乘一切功德皆是止觀之果‧大小乘一切三摩地皆於止觀中攝‧所言止者‧謂\n"+
		"內正住已‧即於如是善思惟法‧作意思惟‧令此作意內心相續‧如是正行多安住故‧起身輕\n"+
		"安及心輕安‧是名為止‧總之輕安所持‧於善所緣心一境性之定‧即止自性‧觀自性者‧經說\n"+
		"彼由獲得身心輕安為所依故‧捨離心相‧即於如是善思惟法‧內三摩地所行影像‧觀察勝\n"+
		"解‧即於如是勝三摩地所行影像所知義中‧能正思擇‧最極思擇‧周遍尋思‧周遍伺察‧若忍‧\n"+
		"若樂‧若覺‧若見‧若觀‧是名為觀‧總謂安住止中‧由觀察所緣之力‧引生輕安所持之觀慧‧即\n"+
		"觀自性‧莊嚴經論云‧「正住為所依‧心安住於心‧及善思擇法‧應知是止觀‧」\n"+
		"　　止觀必須俱修‧如夜間觀畫‧須燈明亮‧復無風動‧方能明了見諸色相‧隨缺其一便不"
		,
		/*===========================第 562 頁===========================*/
		"明顯‧如是觀甚深空性‧亦須無倒了解真實之慧‧及隨欲安住之止‧方能明了見真實義‧月\n"+
		"燈經云‧「由止力無動‧由觀故如山‧」\n"+
		"<b><s>　丑二學止法分二‧寅初修止法‧寅二修止量‧　初又分二‧卯初加行‧卯二正行‧　　今初</s></b>\n"+
		"　　入行論云‧「當知具止觀‧能摧諸煩惱‧故應先求止‧不貪世修成‧」故當先求修止‧復應\n"+
		"先備修止資糧‧如莊嚴經論云‧「具慧修行境‧謂易得善處‧善地及善友‧瑜伽安樂具‧」易得\n"+
		"謂易得衣食等順緣‧善處謂無猛獸怨魔等惱害‧善地謂不引生疾病‧善友謂具如法良友‧\n"+
		"瑜伽安樂具謂遠離喧鬧‧是謂隨順處所‧修止之人‧復須少欲‧不求眾多上妙飲食等‧略有\n"+
		"粗劣便能知足‧復不營商謀利‧棄捨醫卜等雜務‧及與他人往還之因緣‧嚴持所受淨戒‧思\n"+
		"惟諸欲過患與無常等理‧具備如是止資糧已‧於安樂座端身正坐‧足結跏趺‧雙手定印‧先\n"+
		"調息等‧如是所說加行六法‧及下士中士法皆應先修‧尤應善修大菩提心‧\n"+
		"<b><s>　卯二正行分二‧辰初明住心之所緣‧辰二明如何修住心‧初又分二‧巳初總明所緣‧巳二此</s></b>\n"+
		"<b><s>　處所緣‧　　今初</s></b>\n"+
		"總有四種所緣‧謂周遍所緣‧淨行所緣‧善巧所緣‧淨惑所緣‧初中有四‧謂有分別影像‧"
		,
		/*===========================第 563 頁===========================*/
		"無分別影像‧事邊際性‧所作成辦‧就能緣心安立二種影像‧初謂有觀察分別之毘缽舍那\n"+
		"所緣‧次謂無觀察分別之奢摩他所緣‧言影像者‧謂非所緣之自相實事‧乃是心中所現之\n"+
		"影像耳‧第三是就所緣境安立‧如思惟於五蘊中總攝一切有為法‧於四諦中總攝一切取\n"+
		"捨所知‧即於彼中數量決定‧是謂盡所有邊際性‧如思惟諸法本性如是‧更無他性‧是謂如\n"+
		"所有邊際性‧第四是就所修果安立‧謂由多修止觀之力‧便能引生輕安等‧成辦所作之果‧\n"+
		"此四名周遍所緣者‧謂此四種‧非離下諸所緣別有異體‧復能遍彼一切所緣也‧第二淨行\n"+
		"所緣有五‧謂多貪者緣不淨‧多瞋者緣慈悲‧多癡者緣十二因緣‧多慢者緣界差別‧多尋伺\n"+
		"者緣出入息‧第三善巧所緣亦有五‧謂善巧色等五蘊‧眼界等十八界‧眼處等十二處‧無明\n"+
		"等十二緣起‧從善業生可愛果為處‧從不善業不生可愛果為非處‧第四淨惑所緣有二‧謂\n"+
		"從欲界至無所有‧觀察下地粗相‧上地淨相‧暫伏煩惱種子‧及修無常等四諦十六行相永\n"+
		"斷煩惱種子‧\n"+
		"　　巳二此處所緣‧三摩地王經云‧「佛身如金色‧相好最端嚴‧菩薩應緣彼‧心轉修正定‧\n"+
		"」由緣佛身持心‧即是念佛生廣大福‧若佛身相明了堅固‧可作禮拜供養發願懺悔等修集"
		,
		/*===========================第 564 頁===========================*/
		"資糧‧淨治罪障之田‧臨命終時不失佛念‧若修密法尤與修天瑜伽相順‧利益極多‧故當以\n"+
		"佛身作所緣境也‧此所緣境復有二取法‧謂由心新想‧及於原有佛像想令明顯‧前者益大‧\n"+
		"後者通顯密乘‧今如後修‧先當求一莊嚴佛像若繪若鑄‧數數觀察善取其相‧作意思惟令\n"+
		"心中現‧此復當作真佛身想‧不應作繪鑄之像想‧唯當於一所緣令心堅住‧不可改換眾多\n"+
		"異類所緣‧先令身相粗分略為明顯‧即應專一而修‧爾時若觀黃色現為紅色‧欲觀坐相現\n"+
		"為立相‧欲修一尊現為多尊‧則不可隨轉‧唯應於一根本所緣令心不動‧聖勇師云‧「應於\n"+
		"一所緣‧堅固其意志‧若轉多所緣‧意為煩惱擾‧」以是作意所修身相時‧祇要有粗分於心\n"+
		"現起‧即是獲得所緣境‧當緣彼而修也‧\n"+
		"　　辰二明如何修住心‧辨中邊論云‧「懈怠忘聖言‧及沈沒掉舉‧不作行作行‧是為五過\n"+
		"失‧」此說由斷五種過失‧修八對治行而修止‧初於三摩地起加行時‧懈怠是過失‧對治此\n"+
		"過共有四法‧中邊論云‧「即所依能依‧及所因能果‧」所依謂希求三摩地之欲心‧此是勤修\n"+
		"三摩地之因‧能依謂精進‧所因謂見三摩地功德之信‧此是欲心之因‧能果謂輕安‧此是精\n"+
		"進之果‧由依淨信引生希欲‧依止希欲發生精進‧依精進故引生輕安‧故此四法是五過失"
		,
		/*===========================第 565 頁===========================*/
		"中懈怠之對治也‧\n"+
		"　　次精進修三摩地時‧忘失教授是過失‧對治此過當修正念‧非僅不忘所緣便足‧內心\n"+
		"專住所緣境已‧要有明了之定解方可‧集論云‧「云何為念‧於串習事心不忘為相‧不散為\n"+
		"業‧」謂不忘失所緣境‧令心與境串習和合‧即念自性‧\n"+
		"　　第三心住三摩地時‧掉舉沈沒是過失‧對治此過當修正知‧由正知力‧觀察沈掉‧為生\n"+
		"未生‧見沈掉生‧上者迎頭遮止‧中者纔生尋滅‧下者亦須生已不久即當斷除‧如是沈掉二\n"+
		"法‧為修清淨三摩地之主要障礙‧如云‧「於明了分沈沒為障‧於專住分掉舉為障‧故當了\n"+
		"知沈掉為修清淨三摩地之主要障礙‧」故當善知沈沒‧掉舉‧昏沈之行相‧其中昏沈‧俱舍\n"+
		"集論皆說所緣不明了‧身心粗重為相‧是癡分攝‧沈沒有粗細二分‧粗者‧令心黑闇‧或於所\n"+
		"緣雖未散動‧然失明了之力‧但澄淨而已‧微細沈沒‧謂有明淨二分‧而於所緣無定解力‧略\n"+
		"為低緩‧不應誤解沈沒昏沈為一事‧昏沈雖不向餘境流散‧而俱無明淨二分‧沈沒則有淨\n"+
		"分而無明分‧如云‧「沈沒謂於所緣‧心力放緩‧不能明了緣取所緣‧雖有淨分而無明了取\n"+
		"境之力‧即成沈沒‧」又云‧「有說‧心不向餘境流散‧俱無明淨之昏沈為沈沒者‧不應正理‧」"
		,
		/*===========================第 566 頁===========================*/
		"由此亦可了知昏沈之相‧沈沒從昏沈生‧有善無記二性‧昏沈是癡分‧是不善性或有覆無\n"+
		"記性‧如是沈沒起時‧若相微薄‧僅起少次‧則可策心堅持所緣而修‧若沈沒厚‧或數數起‧則\n"+
		"應暫置所修法而修對治‧其對治法‧如中觀心論云‧「退弱應寬廣‧修廣大所緣‧」又云‧「退\n"+
		"弱應策舉‧觀精進勝利‧」退弱沈沒之因‧謂心太向內攝‧或由放緩取境之力‧心漸低降‧或\n"+
		"由睡眠昏沈等因‧心覺黑闇‧初之對治‧當以觀慧觀察所緣令心廣大‧第二對治‧應當思惟\n"+
		"三寶功德菩提心之勝利‧人生義大等功德‧令心策舉‧第三對治‧亦應令心策舉‧及作意日\n"+
		"光等光明相‧或以水洗面‧或經行等‧掉舉者‧若心將現親友等可意境‧即是微細掉舉‧若忽\n"+
		"生貪相‧即粗分掉舉‧集論云‧「云何掉舉‧淨相隨轉‧貪分所攝心不靜相‧障止為業‧」微細掉\n"+
		"舉之對治‧謂心於境將流動時‧即應遮止繫於所緣‧粗分掉舉之對治‧謂生已即當了知‧攝\n"+
		"錄其心令住所緣‧若此不能治者‧則應暫停所修法‧思惟無常與惡趣苦等‧收攝其心‧待掉\n"+
		"舉滅已‧復修前事‧又速道論云‧「沈掉之對治當修風心與虛空相合之教授‧及強斷掉舉\n"+
		"之教授‧」初者‧謂想自身臍間有一白點量如雀卵‧從頂踊出‧與虛空相合‧即於彼上令心\n"+
		"安住‧第二謂一呼一吸合為一息‧於五息中持心不散而修‧次修十息‧十五息‧二十五息等‧"
		,
		/*===========================第 567 頁===========================*/
		"漸漸增長‧持心不散‧或想上風白色‧由鼻孔入‧漸向下壓‧下風黃色漸向上提‧於臍間相合‧\n"+
		"修瓶相風‧\n"+
		"　　僅能了解沈掉之義猶非完足‧要修定時以正知力‧常時伺察沈掉‧為起未起‧生此正\n"+
		"知之方便因‧謂不忘所緣之修正念法‧及正念堅固之中常時偵察‧心散未散‧任持其心‧入\n"+
		"行論云‧「住念護意門‧爾時生正知‧」又說第二因云‧「數數審觀察‧身心諸分位‧總應知彼\n"+
		"彼‧即護正知相‧」沈掉之因‧論說共因謂不護根門‧食不知量‧不修初夜後夜覺寤瑜伽‧不\n"+
		"正知住‧沈沒別因謂重睡眠‧心於所緣力太緩放‧止觀不均偏修寂止‧心相黑闇‧不樂緣境‧\n"+
		"掉舉別因謂少厭離‧心於所緣執力過猛‧未串習精進‧思親里等令心散亂‧\n"+
		"　　第四如是善修正念正知‧沈掉生起雖無不知之過‧然沈掉生時‧若不無間即斷‧亦是\n"+
		"過失‧此不起功用不作行之對治‧即是名為作行功用之思‧其思雖是於善惡無記隨一之\n"+
		"境‧驅役內心之心所法‧而此處是說沈掉生時‧令心斷彼之思也‧若心於所緣‧執持之力太\n"+
		"猛‧此雖有明了分而掉舉增盛‧極難安住‧若太不用力過於緩懈‧住分雖有而沈沒增盛難\n"+
		"得明了‧故當善忖內心‧而求急緩適中之界‧若覺內心較此再舉便生掉舉‧即當較彼略緩‧"
		,
		/*===========================第 568 頁===========================*/
		"若覺內心齊此而住便生沈沒‧即當較彼略高‧如是求得安住界已‧便於根本所緣‧令心明\n"+
		"了而住‧隨力所能住一時等‧又初發業者‧修時宜短次數宜多‧\n"+
		"　　第五已斷微細沈掉‧心三摩地相續轉時‧若起功用作行‧反成三摩地之過失‧修此對\n"+
		"治謂不作行安住於捨‧當知此捨‧是捨防護功用‧非捨取境之力也‧又非凡無沈掉之時皆\n"+
		"可修捨‧是於已摧沈掉力時乃修‧摧伏之義如修次中篇云‧「若時已無沈掉‧心於所緣能\n"+
		"正直住‧爾時可緩功用修習於捨‧如欲而住‧」聲聞地云‧「令心隨與任運作用‧」又捨總有\n"+
		"受捨‧無量捨‧行捨之三‧此是行捨‧初發業者最初難生無過妙三摩地‧故當以六力成九住\n"+
		"心‧依四作意之次第‧引生無過三摩地‧其六力中初聽聞力‧成辦九住心中初內住心‧謂由\n"+
		"初聞修定教授‧隨順所聞令心內住‧爾時便覺分別雜念如同懸河‧初識分別之相‧第二思\n"+
		"惟力‧成辦第二等住‧謂先住所緣‧由數數思惟而修‧初得少分相續安住‧此時便覺分別如\n"+
		"溪澗水時隱時現‧得分別休息之相‧此二住心‧沈掉時多正定時少‧必須力勵心方能住所\n"+
		"緣‧故於四作意中‧是初力勵運轉作意位‧第三念力‧成辦第三安住第四近住二種住心‧如\n"+
		"其次第‧於心散亂時能速念前緣令心安住‧及初以念力令心不散‧從寬泛境漸收其心‧使"
		,
		/*===========================第 569 頁===========================*/
		"其漸細漸高‧此時便覺分別‧如潭中水‧無違緣時安靜而住‧遇違緣時即不能住‧對於分別\n"+
		"起疲勞想‧第四正知力‧成辦第五調伏‧第六寂靜二心‧如其次第‧初以正知‧了知於分別及\n"+
		"隨煩惱諸相流動之過患‧令心不散調柔‧樂修三摩地‧次以正知‧了知散亂之過失‧滅除厭\n"+
		"修三摩地之情緒‧令心寂靜‧第五精進力成辦第七最極寂靜‧第八專住一趣二心‧如其次\n"+
		"第‧以精進力‧雖最細分別與隨煩惱‧皆能斷除不忍‧令心最極寂靜‧及由如是精進‧令沈掉\n"+
		"等初即不起‧心能相續住三摩地‧從第三至第七‧此五住心‧住定時雖多‧而有沈掉障礙‧故\n"+
		"是第二有間缺運轉作意位‧第八住心時‧如大海濤‧隨起何分別‧略修念知對治即自息滅‧\n"+
		"爾時雖須恆修功力‧然沈掉不能為障‧能長時修定‧故是第三無間缺運轉作意位‧第六串\n"+
		"習力‧成辦第九等持住心‧以於爾時不須專依正念正知‧其三摩地亦能任運於所緣轉故‧\n"+
		"又由爾時既無沈掉為障‧復不須恆依功用‧故是第四無功用運轉作意位‧\n"+
		"　　寅二修止量‧第九住心‧仍是欲界心一境性‧乃奢摩他隨順作意‧若得身心輕安即奢\n"+
		"摩他‧莊嚴經論云‧「由習無作行‧次獲得圓滿‧身心妙輕安‧名為有作意‧」所言作意即奢摩\n"+
		"他‧輕安之相如集論云‧「云何輕安‧謂止息身心粗重‧身心堪能性‧除遣一切障礙為業‧」所"
		,
		/*===========================第 570 頁===========================*/
		"言粗重‧謂於善所緣‧身心不能如欲而轉‧若得彼對治之輕安‧則除身心無堪能性‧能隨欲\n"+
		"轉也‧如是身心輕安‧初得三摩地時‧即生微細少分‧後漸增盛‧便成輕安與心一境性之奢\n"+
		"摩他‧將發眾相圓滿易見輕安之前相‧謂於頂上似重而起‧非損惱相‧此起無間‧心粗重性\n"+
		"即得除滅‧能對治彼‧心輕安性即先生起‧依此輕安生起之力‧次有隨順身輕安諸風大種\n"+
		"來入身中‧由此風大遍身轉故‧身粗重性皆得除滅‧能對治彼‧身輕安性即得生起‧由此力\n"+
		"故‧身極快樂‧由身樂故心輕安性轉復增長‧其後輕安初勢漸漸舒緩‧然非輕安永盡‧是由\n"+
		"初勢觸動內心‧彼勢退減‧有妙輕安如影隨形無諸散動與三摩地隨順而起‧心踴躍性亦\n"+
		"漸退減‧心於所緣堅固而住‧遠離喜動不寂靜性‧乃是獲得正奢摩他‧亦是已得第一靜慮\n"+
		"近分所攝少分定地作意‧外道諸仙修世間道於無所有以下離欲‧及修五種神通等‧皆須\n"+
		"依止此奢摩他‧內佛弟子‧以出離心及菩提心之所任持‧修無我義‧證得解脫‧一切種智‧亦\n"+
		"要依止此奢摩他‧故是內外所共之道‧略說奢摩他建立竟‧\n"+
		"<b><s>　丑三學觀法分二‧寅初總明觀資糧‧寅二別明決擇見‧　　今初</s></b>\n"+
		"　　修次中篇說‧親近善士‧聽聞正法‧如理思惟‧三種資糧‧意謂依止彼資糧‧決擇了解真"
		,
		/*===========================第 571 頁===========================*/
		"實義之正見‧引生通達如所有性之毘缽舍那也‧如斯正見‧要依堪為定量論師所造之論\n"+
		"而求‧其能遠離二邊‧解釋佛經甚深心要義之論師‧顯密經中多授記龍猛菩薩‧故當依彼\n"+
		"論而求正見‧印度諸大中觀師‧皆推崇提婆菩薩‧與龍猛菩薩相等‧咸依為量‧其能無倒解\n"+
		"釋‧聖父子意趣‧為隨應破中觀者‧則係佛護月稱二大論師‧今當隨彼而決擇聖父子之清\n"+
		"淨意趣也‧\n"+
		"<b><s>　寅二別明決擇見分二‧卯初明染污無明‧卯二尋求無我見‧　　今初</s></b>\n"+
		"　　四百論釋云‧「所言我者‧謂諸法不依仗他性‧若無此性即是無我‧此由人法差別為\n"+
		"二‧曰人無我及法無我‧」此中所破之實執‧謂覺非由無始分別增上而立‧執彼境上自體\n"+
		"成就‧其所執之境‧即名為我或名自性‧若於人上無彼所破‧即人無我‧若於眼耳等法上無\n"+
		"彼所破‧即法無我‧若於法上人上執有彼所破‧即法我執與人我執‧人我執之所緣‧即流轉\n"+
		"生死者及修解脫道者等名言所詮事‧依止諸蘊假立之我‧若緣他身之我‧執為有自相‧亦\n"+
		"是俱生人我執‧然非俱生薩迦耶見‧若緣自身之我‧執為有自相‧則俱是俱生人我執與俱\n"+
		"生薩迦耶見‧俱生我所執薩迦耶見之所緣‧則是俱生心覺有我所之我所‧非我之眼等‧俱"
		,
		/*===========================第 572 頁===========================*/
		"生法我執所緣‧謂自他內身所攝之色蘊眼耳等‧及內身不攝之山河房舍等‧我執之行相‧\n"+
		"即緣彼所緣‧執為由自相有也‧彼二種我執俱是生死根本‧入中論云‧「慧見煩惱諸過患‧\n"+
		"皆從薩迦耶見生‧由了知我是彼境‧故瑜伽師先破我‧」七十空性論云‧「因緣所生法‧若分\n"+
		"別真實‧佛說為無明‧彼生十二支‧」\n"+
		"　　問曰‧若二我執俱是生死根本‧生死則有異類二種根本‧不應道理‧答曰‧二種我執所\n"+
		"緣雖異‧行相無別‧故無過失‧欲斷如是生死根本‧須達無我慧‧此達無我慧‧要與無明我執\n"+
		"同一所緣‧行相相違‧方能斷除‧四百論云‧「若見境無我‧能滅三有種‧」釋量論云‧「慈與愚\n"+
		"無違‧故非真除過‧」此說慈悲雖是無明之對治品‧然非同一所緣行相相違‧故非真能對\n"+
		"治‧法稱師云‧「若不破彼境‧非能破彼執‧」此說須以達無我慧‧破除無明我執所執之境‧而\n"+
		"斷我執‧故知生死根本無明我執\n"+
		"之真對治厥為達無我慧也‧\n"+
		"<b><s>　卯二尋求無我見分二‧辰初決擇人無我‧辰二決擇法無我‧　　今初</s></b>\n"+
		"　　二我執生起之次序謂從法我執生人我執‧修無我之次序‧則應先修人無我‧次修法\n"+
		"無我‧於人法上所知無我‧雖無粗細之別‧然所別事‧於人則易了解‧於法上則難知‧如法我"
		,
		/*===========================第 573 頁===========================*/
		"執於眼耳上不易了解‧於影像上則易了解‧故成立無我之因時‧以影像等為同喻也‧三摩\n"+
		"地王經云‧「如汝知我想‧如是觀諸法‧」故當先決擇人無我而修‧此雖有多理‧但初修業者‧\n"+
		"觀察四事最為切要‧\n"+
		"　　初要‧謂決定所破‧吾人下至重睡眠時亦有我執堅持不捨‧彼心即是俱生我執‧當觀\n"+
		"彼執執何為我‧如何執我‧如是審細觀察彼執‧便見彼執‧非執於身心總聚上假名安立‧乃\n"+
		"執假立之我為有自體‧彼俱生我執所執之我‧即所破法‧初若未能直識其我‧則亦不能知\n"+
		"無我義‧靜天師云‧「未觸所計事‧不知彼事無‧」\n"+
		"　　第二要義‧謂決定二品‧彼堅固我執所執之我‧倘於五蘊上有者‧與自五蘊為一為異‧\n"+
		"離此二品‧當知更無第三品‧以凡有者‧不出一異二品故‧此依了知一異互違之量而成‧中\n"+
		"觀莊嚴論云‧「離於一多外‧所餘行相法‧決定不得有此二互違故‧」\n"+
		"　　第三要義‧謂破一品‧若所執我與五蘊一者‧應成一性‧此有三過‧一所計之我應成無\n"+
		"用‧二我應成多‧三我應有生滅‧初過謂汝所計應成無用‧以汝計我原為成立取捨五蘊之\n"+
		"作者‧若我與蘊成一體性‧則離所取之蘊別無能取者故‧自性無分之法‧不可安立為異法"
		,
		/*===========================第 574 頁===========================*/
		"故‧中論云‧「離於所取蘊‧別無能取我‧計蘊即是我‧汝我成無用‧」第二過謂若我蘊是一者‧\n"+
		"如一人有五蘊‧亦應有五我‧或我是一故‧五蘊亦應成一‧入中論云‧「若蘊即是我‧蘊多我\n"+
		"應多‧」第三過入中論云‧「若蘊即是我‧我應有生滅‧」由分別假立業果所依之我‧雖有生\n"+
		"滅亦無過失‧但如自所執之我若有生滅‧則成自性生滅‧此中復有三過‧初不念宿命過‧謂\n"+
		"不應憶念我於爾時如是生‧以念宿生要前後二我是一相續‧汝此二我自性各異不依他\n"+
		"故‧入中論云‧「所有自相各異法‧是一相續不應理‧」二造業失壞過‧謂前所造業應不受果‧\n"+
		"以造業之我未受果前即已謝滅‧別無與彼同一相續之我故‧以彼自性壞故‧三無業受果\n"+
		"過‧若謂前我謝滅後我受果者‧應未造業即可受果‧以他人造業‧他人受果故‧入中論云‧\n"+
		"「般涅槃前諸剎那‧生滅無作故無果‧他所造業餘受果‧」由是推察即知我與五蘊非是一\n"+
		"也‧\n"+
		"　　第四要義‧謂破異品‧若所執我與五蘊異者‧則離色等五蘊‧應有我可得‧如驢馬相異‧\n"+
		"離馬有驢可得‧然色蘊等一一除後實無我可得‧中論云‧「我異所取蘊‧是事終不然‧若異\n"+
		"應可見‧而實不可見‧」"
		,
		/*===========================第 575 頁===========================*/
		"　　依此四義觀察‧便知身心上‧全無俱生我執所計之我‧是為初得‧中觀正見‧若是宿世\n"+
		"曾習此見者‧覺如獲得所遺珍寶最極歡喜‧若先未習今創得者‧覺如遺失極可愛物‧起大\n"+
		"恐怖‧若俱無彼二感覺者‧則是未能了知所破‧或未善破除也‧\n"+
		"　　修習之法‧有定中修如虛空‧與後得修如幻化之二‧初謂如虛空‧唯由遮遣礙觸而立‧\n"+
		"此亦唯遮自相之我‧專一而修‧住空見中堅固不動為主‧若覺心相稍低劣時‧便應憶念前\n"+
		"四觀察‧引生定解相續修習‧二後得修如幻者‧謂由四相觀察‧破自相有之後‧次觀餘存何\n"+
		"法‧便覺行住坐臥一切威儀動作‧皆唯分別假立‧如同幻事都無自性‧又善得人無我見時‧\n"+
		"雖無俱生我執所執之我‧但業果所依之我則非全無‧如幻師所變象馬‧雖無象馬之體‧然\n"+
		"有象馬之相‧如是現在彼我‧本無自性現有自相‧唯由分別假立之我‧即能作善惡業‧受苦\n"+
		"樂果‧一切緣起作用皆應正理‧自性雖空非畢竟無‧故非斷見‧又一切法本來性空‧通達無\n"+
		"我慧即如是通達‧非是原有自性‧後由覺慧安立為空‧故空亦非由慧所作‧又一切法皆非\n"+
		"實有‧非一分空‧一分不空‧故亦非少分空‧故修一切法皆無自性‧即執一切法為實有之對\n"+
		"治也‧"
		,
		/*===========================第 576 頁===========================*/
		"<b><s>　辰二決擇法無我分二‧巳初決擇有為法無自性‧巳二決擇無為法無自性‧初又分三‧午初</s></b>\n"+
		"<b><s>　決擇色法‧午二決擇心法‧午三決擇不相應行‧　　今初</s></b>\n"+
		"\n"+
		"　　先當觀察自身‧心中堅執為我身者‧究執何物為身‧如何執著‧非於骨肉五支和集之\n"+
		"主執為分別假立‧是於假立境上執有自相成就之身‧若果有彼身者‧則與色蘊為一為異‧\n"+
		"若是一者‧此骨肉五支和集之身‧是由父母精血和成‧如身有五支‧則識所托之精血亦應\n"+
		"有五支‧又如支有五‧身亦應有五也‧若是異者‧則離一一支外‧應有身可得‧然實不可得‧故\n"+
		"無如是所執之身也‧\n"+
		"　　午二決擇心法‧如今日之識‧若覺非於上午識及下午識上分別假立‧而為自相有者‧\n"+
		"則當觀察與上午識及下午識為一為異‧若是一者‧於上午識上應有下午識‧於下午識上\n"+
		"亦有上午識‧若是異者‧除上午識與下午識‧應有彼識可得‧而實不可得‧故無如彼所執之\n"+
		"識也‧\n"+
		"　　午三決擇不相應行‧例如一年有十二月‧若覺非唯分別假立‧而有自相之年者‧應觀\n"+
		"彼年與十二月為一為異‧若是一者‧如月有十二‧年應有十二‧以年與各月皆成一體故‧若"
		,
		/*===========================第 577 頁===========================*/
		"是異者‧除十二月後應有年可得‧而實不可得也‧\n"+
		"　　巳二決擇無為法無自性‧如虛空界‧亦有四方及中央‧若覺虛空非於諸方分上分別\n"+
		"假立‧而是有自性者‧應觀虛空與彼諸分為一為異‧若是一者‧諸分成一‧東方虛空與西方\n"+
		"虛空‧亦應成一‧則東方空中降雨‧西方空中亦應降雨‧過失甚多‧若是異者‧則除虛空諸分\n"+
		"之後‧應有虛空可得‧然實不可得‧是故虛空非有自相‧\n"+
		"　　又一切法皆唯名言分別假立‧都無少許自性可得‧如於繩上妄執為蛇‧較易了解‧如\n"+
		"黑闇時‧見繩盤聚宛如真蛇‧便覺此處有蛇‧頓生怖畏‧爾時彼繩一一部分‧皆非有蛇‧諸分\n"+
		"積聚亦無有蛇‧離繩諸分及積聚外亦無有蛇‧然由見繩便生是蛇之心全無相違‧故彼繩\n"+
		"上之蛇‧唯由錯亂分別所假立也‧如是真蛇亦唯分別假立‧非自性有‧是由見蛇諸蘊而起\n"+
		"蛇覺‧若觀色蘊一一部分‧及彼積聚‧皆無有蛇‧離彼諸分及積聚外亦無有蛇‧然於蛇蘊唯\n"+
		"由分別假立為蛇則不相違‧\n"+
		"　　問曰‧如於繩上畢竟無蛇‧則於蛇蘊亦應畢竟無蛇‧以彼俱是分別假立‧尋求實蛇不\n"+
		"可得故‧答曰‧無過‧彼二雖同是分別假立‧以理智尋求無可獲得‧然由分別假立‧可否安立"
		,
		/*===========================第 578 頁===========================*/
		"為有‧則不相同‧以於繩上分別假立為蛇‧不可安立為有‧於蛇蘊上分別假立為蛇‧則可安\n"+
		"立為有‧以是分別假立非定是有‧如計聲常及人我等‧雖是分別假立‧然非是有‧分別假立\n"+
		"雖非定有‧然屬有者‧則定是分別假立‧以有者必是名言有‧名言有者‧尋求名言假立義時\n"+
		"必無可得‧尋求假義既無可得‧則唯是於無觀察識前‧由分別假立為有也‧繩上之蛇‧由名\n"+
		"言中無故成畢竟無‧蛇蘊上之蛇‧由名言中有故非畢竟無‧以繩上之蛇‧世名言量即能違\n"+
		"害‧蘊上之蛇‧世名言量不能害故‧\n"+
		"　　合上法喻‧如繩非是蛇‧喻五蘊非我‧如依於繩而生蛇覺‧喻依五蘊而起我想‧如依盤\n"+
		"繩而現蛇相‧喻依五蘊有我相現‧如依繩現蛇而蛇非有‧喻依五蘊有我相現‧而實非有‧此\n"+
		"即我無自性義‧又如繩上雖畢竟無蛇‧然由見繩為蛇故‧生大怖畏‧如見真蛇‧如是依自五\n"+
		"蘊所見之我雖非實有‧然由分別假立之我‧於行住坐臥等四威儀中作一切事亦不相違‧\n"+
		"此即緣起義‧如是若見一切法都無自性‧即由無自性故‧便能安立緣起因果‧是為性空現\n"+
		"為緣起義‧若見一切法唯由分別假立‧緣起因果皆應正理‧即由此故便能引生一切法皆\n"+
		"無自性之定解‧是為緣起現為性空義‧如云‧「此皆自性空‧依彼生此果‧二決定無礙‧更互"
		,
		/*===========================第 579 頁===========================*/
		"為助伴‧唯此為甚奇‧唯此最希有‧」又由略見緣起如幻‧即能破除妄計諸法實有之實執‧\n"+
		"引生無自性決定解‧是為正見觀察圓滿‧如云‧「若時二念不分離‧由見緣起不欺誑‧即破\n"+
		"一切所執境‧是為正見觀圓滿‧」言不分離者‧謂解空智與緣起智‧更互相助也‧如云‧「苗無\n"+
		"自性‧是緣起故‧」此於所破加簡別言‧謂無自性‧非說苗無‧由苗無自性語‧即能了知非畢\n"+
		"竟無苗‧故空能除無邊‧又由緣起因故‧即知苗是緣起必依待他‧既待他成即非自主‧既非\n"+
		"自主便非自相成就‧故現能破有邊‧如云‧「若知現能破有邊‧性空即能遣無邊‧性空現為\n"+
		"因果理‧一切邊見不能奪‧」\n"+
		"　　如是從色乃至一切種智‧皆是分別假立‧十地佛果等甚深功德‧雖初非世間常人之\n"+
		"所安立‧然諸佛隨順世間分別安立之理設立彼彼名言‧所化眾生即依彼地道等名言‧不\n"+
		"再觀察‧而有名言識轉‧若求地道等甚深功德‧名言假立之義都無可得‧故彼亦唯是名言\n"+
		"分別之所假立也‧問‧若佛假立地道等名‧佛意寧非亦有分別‧曰‧佛身雖無分別‧然為引誘\n"+
		"眾生‧故順眾生意樂立如是名‧以是當知隨應破派一切名言‧純係隨順世間建立‧如世間\n"+
		"俱生心‧隨其所見不復推究即便取捨‧如是隨應破派亦不觀察而立世俗‧有解隨順世間"
		,
		/*===========================第 580 頁===========================*/
		"之義‧謂凡世間愚人所說有無顛倒之事‧我亦皆許‧是未如實了知之大錯也‧又應知隨應\n"+
		"破派自宗‧於世俗法不分正倒‧觀待世間識則分正倒二類‧世俗不分正倒者‧以世俗諦‧真\n"+
		"理與現象必不相符‧是顛倒法‧無真正義‧觀待世間識分正倒者‧如世人說此處有瓶‧世名\n"+
		"言量不能違害‧瓶雖是虛妄法‧然亦可立為有‧故觀待世間立為正世俗‧若見一月為二月‧\n"+
		"見雪山為青色‧待彼亂識雖是實有‧然世間無錯亂心亦能了知彼是顛倒‧故觀待世間立\n"+
		"為倒世俗‧由是可知‧世間愚人所計之顛倒名言‧隨應破派亦不必許其有也‧總之‧當知生\n"+
		"死涅槃一切法‧唯是分別假立‧都無少許自性‧生定解已應善修習‧修習之法‧即如前說‧定\n"+
		"中修如虛空之空性‧後得修如幻事‧若時以觀察力‧引生身心輕安彼定即成毘缽舍那‧\n"+
		"　　丑四學雙運法‧若未先得止觀‧則無止觀雙運之事‧故修雙運必須先得止觀‧此復初\n"+
		"得毘缽舍那‧亦即獲得雙運‧謂由前已得奢摩他為依止乃修觀察‧若時由觀察力獲得無\n"+
		"功用運轉作意‧即得雙運轉道‧如聲聞地云‧「齊何當言奢摩他毘缽舍那‧二種和合平等\n"+
		"俱轉‧由此說名雙運轉道‧答‧若有獲得九住心中第九住心‧謂三摩呬多‧用如是三摩地為\n"+
		"所依止‧於觀法中修增上慧‧彼於爾時由觀法故‧任運轉道無功用轉‧如奢摩他道不由加"
		,
		/*===========================第 581 頁===========================*/
		"行‧毘缽舍那清淨鮮白‧隨奢摩他‧調柔攝受‧齊此名為奢摩他毘缽舍那二種和合平等俱\n"+
		"轉‧由此名為奢摩他毘缽舍那雙運轉道‧」修次下篇云‧「若時由離沈掉‧平等任運而轉‧心\n"+
		"於真義最極明了‧當緩功用而修等捨‧當知爾時名成止觀雙運轉道‧」般若教授論云‧「其\n"+
		"後即緣有分別影像‧若時彼心無間無缺相續作意雙證二品‧爾時說名止觀雙運轉道‧其\n"+
		"奢摩他毘缽舍那是名為雙‧運謂互相連繫而轉‧」無間缺者‧謂觀察後不須別修無分別\n"+
		"住‧即由觀修便能引生無分別住‧雙證二品者‧謂緣無分別影像之止‧與緣有分別影像之\n"+
		"觀‧二品俱證‧言相續者‧是依觀察修之毘缽舍那‧與觀後安住之奢摩他‧非同時生‧若由觀\n"+
		"力引生真奢摩他‧當知此奢摩他時‧有緣如所有性之擇法毘缽舍那‧與專住如所有性之\n"+
		"三摩地奢摩他‧相應而轉‧能得如是止觀平等俱轉者‧必先已得修所成之智德‧故住無分\n"+
		"別中‧略以觀慧觀無我義‧如諸小魚游安靜水‧祇可立為止觀隨順相‧非有真實止觀雙運\n"+
		"之義也‧\n"+
		"　　今者於攝道之總義‧略為說之‧最初道之根本‧於依止善知識之理趣‧當淨治之‧次於\n"+
		"閒暇生起無偽‧欲取精實‧以是修習‧由內懲誡‧為生此故‧宜修暇滿諸法‧次若未反求現世"
		,
		/*===========================第 582 頁===========================*/
		"之心‧則於後世不生猛利之希求‧故於身不久住之無常‧及死後飄流惡趣之理‧應勵力修\n"+
		"習‧爾時以生真實怖畏之念‧於三寶功德‧心生至誠之決定‧而住共同皈依之律儀‧於共學\n"+
		"處而勤修學‧次於一切白法根本之業果‧由多門中生起深忍之信‧令其堅固‧以致力於善\n"+
		"不善之行止‧而當恆住於四力之道‧如是若將下士諸法類貫入其心‧更多思惟生死總別\n"+
		"之過患‧從總生死‧遮止其心‧次知生死從何而起之因‧是為惑業‧而生起真實欲斷之心‧總\n"+
		"於能脫生死三學之道‧別於自所受之別解脫戒‧當努力焉‧如是若將中士諸法類貫入其\n"+
		"心‧如自墮於海‧有情諸母亦皆同爾‧而為作意‧修習慈悲為本之菩提心‧如何能生‧須當勵\n"+
		"力‧此若無者‧則六波羅蜜及二種次第等‧皆如無基而建樓閣‧若於彼稍生一二領受之行\n"+
		"相‧則以儀軌受戒‧於其學處而為努力‧以堅固願心‧應聽聞諸廣大行‧了知行止之諸界限‧\n"+
		"於彼而生希求‧彼若生者‧即以儀軌而受行戒‧於成熟自身之六度‧及成熟他身之四攝等\n"+
		"而修習之‧別於根本墮罪‧當捨命守護‧中下品纏及諸惡作‧亦勵力而毋令染‧設或有犯當\n"+
		"於還淨而精勤焉‧次於後二度特須修學‧於修靜慮法善巧已‧則修三摩地而於清淨之二\n"+
		"無我見‧當如何能於身心生起而得之‧須知住於見上修習之規而為修習耳‧於如是之靜"
		,
		/*===========================第 583 頁===========================*/
		"慮及慧‧施設止觀之名‧除於此二更無餘者‧是受菩薩律儀已‧從彼學處中而出也‧此亦須\n"+
		"修下下道時‧於上道愈起欲得‧若聽聞上時‧於下愈起欲修也‧修彼等時‧亦須斷除分別‧使\n"+
		"心平等‧如是若於引道之善知識敬信微薄‧是則斷善妙資糧之本‧故於依止法須應努力‧\n"+
		"若於修行勇銳微弱‧當修暇滿法類‧倘於此世耽著若甚‧當修無常及惡趣過患以為主要‧\n"+
		"若見於所受制之界限緩慢‧則修業果為主‧若於生死厭患微小‧則求解脫唯成虛語‧當思\n"+
		"生死過患‧若任何所作於為利有情之心不猛‧是斷大乘之根本‧故須修習願心‧若受菩薩\n"+
		"律儀‧於行修學‧其執相之繫縛若過堅利‧宜用理智破壞執相之所緣‧於如空如幻之空性\n"+
		"而修習‧心若不住所緣而作散亂之僕使‧則當修心一境性而為主要‧是諸前賢之所說‧由\n"+
		"此為例‧諸未說者‧如應了知‧總之莫成一品‧須令身心於一切善品而能安住也‧\n"+
		"　　辛二‧別於金剛乘修學之法者‧如是於諸顯密共道淨修之後‧不應猶豫當入密乘‧此\n"+
		"道較餘法特為寶貴‧以能速疾圓滿二資糧故‧若入彼者‧當如道炬論所說‧於初令師歡喜‧\n"+
		"較前所說尤須增上‧此亦須於彼中所說最下之性相全者‧而如是作也‧次應先以密部根\n"+
		"據所說之灌頂‧成熟自己之身心‧次於爾時聽聞所受之三昧耶及律儀等了知守護‧若犯"
		,
		/*===========================第 584 頁===========================*/
		"本罪雖可重受‧然道之功德‧於身心生起極為留難‧故當勵力毋令染污‧粗罪不犯‧亦當致\n"+
		"力‧設有所犯‧亦當作諸還淨之方便‧此乃修道之根本‧彼等若無‧如基礎損壞‧則樓閣必倒\n"+
		"塌也‧文殊根本教王經云‧「能仁於壞戒‧不說咒成就‧」如是所說等之三種成就‧任何亦無\n"+
		"也‧於無上瑜伽之經中‧亦說不護三昧耶‧及灌頂下劣‧不了真性‧以此三者‧雖行修習‧任何\n"+
		"亦無成就‧若不守護三昧耶及律儀而言修道者‧是飄流於密法之外‧如是能守護三昧耶\n"+
		"及律儀於密道而修者‧若於下三部‧則於有相無相之二種瑜伽依次修學‧如於上部則於\n"+
		"二種次第瑜伽依次而學焉‧以上是唯名言略示轉入密咒之方隅‧廣者須於真言道次第\n"+
		"中而知也‧若如是學‧即是於攝一切顯密扼要之圓滿道體而修學‧能於所得有暇‧具足義\n"+
		"利‧將佛聖教於自他之身心增廣也‧\n"+
		"<b><s>　佛說顯密二種道　　於中顯教諸經論　　能生無礙大辯才　　速易通達為教授</s></b>\n"+
		"<b><s>　又於密教諸共道　　亦能光顯淨身心　　特於內外大小乘　　大乘顯密及諸續</s></b>\n"+
		"<b><s>　二次第等所共須　　正修妙三摩地法　　如智者論已善說　　能除行者諸歧途</s></b>\n"+
		"<b><s>　為利諸求解脫者　　重著菩提道略論　　如斯甚深廣行道　　是由彌勒與文殊</s></b>"
		,
		/*===========================第 585 頁===========================*/
		"<b><s>　龍猛無著寂靜天　　輾轉傳來三法流　　匯歸阿底峽尊者　　揉成殊勝之教授</s></b>\n"+
		"<b><s>　願此所得諸善根　　迴向眾生利樂本　　如來聖教久住世　　永離一切諸垢染</s></b>\n"+
		"　　謂攝一切佛語之樞要‧龍猛無著二大派之準繩‧勝士趣入一切智地之法軌‧三類士\n"+
		"夫修持之次第‧宣示一切完全之菩提道次第‧是聽聞阿蘭若者‧傳內鄔蘇巴及傳慬哦瓦\n"+
		"相傳之二‧並從博朵瓦傳霞惹瓦及博朵瓦傳鐸巴諸教授義‧從廣道次第中‧此復略攝‧"
	};
}